[Killed] ConditionalExpression
src/app.js:22:23
 
   async detectDevice() {
     const deviceStatus = document.getElementById('device-status');
-    const hasWebGPU = navigator.gpu !== undefined;
+    const hasWebGPU = false;
     
     if (hasWebGPU) {
killedBy: AppController (app.js) detectDevice with gpu support variations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "webgpu"
Received: "wasm (webgpu unsupported)"

[Killed] ConditionalExpression
src/app.js:24:9
     const deviceStatus = document.getElementById('device-status');
     const hasWebGPU = navigator.gpu !== undefined;
     
-    if (hasWebGPU) {
+    if (false) {
       try {
         const adapter = await navigator.gpu.requestAdapter();
killedBy: AppController (app.js) detectDevice with gpu support variations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "webgpu"
Received: "wasm (webgpu unsupported)"

[Killed] BlockStatement
src/app.js:195:31
           output.scrollTop = output.scrollHeight;
           
           // Update tokens per second
-          if (firstTokenTime) {
-            const elapsed = (Date.now() - firstTokenTime) / 1000;
-            const tokensPerSec = elapsed > 0 ? (tokenCount / elapsed).toFixed(1) : '0';
-            statsEl.tokensPerSec.textContent = `Tokens/s: ${tokensPerSec}`;
-          }
+          if (firstTokenTime) {}
         },
         onProgress: (progress) => {
killedBy: AppController (app.js) generateText happy path streams tokens and updates stats
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Tokens"
Received string:    ""

[Killed] BlockStatement
src/app.js:227:26
       return;
     }
 
-    if (this.isSpeaking) {
-      this.stopTTS();
-    }
+    if (this.isSpeaking) {}
 
     try {
killedBy: AppController (app.js) playTTS stops existing speech first
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/app.js:279:9
 
   async generateAndSpeak() {
     const prompt = document.getElementById('combined-prompt').value.trim();
-    if (!prompt) {
+    if (true) {
       this.showError('Please enter a prompt');
       return;
killedBy: AppController (app.js) generateAndSpeak runs both generation and speech
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Hello world"
Received string:    ""
