[NoCoverage] BlockStatement
src/worklet.js:3:17
 // AudioWorklet processor for PCM audio playback
 class PCMQueueProcessor extends AudioWorkletProcessor {
-  constructor() {
-    super();
-    
-    // Audio queue and playback state
-    this.audioQueue = [];
-    this.currentBuffer = null;
-    this.bufferPosition = 0;
-    this.chunkIndex = 0;
-    this.isPaused = false;
-    this.isPlaying = false;
-    
-    // Ring buffer for smooth playback
-    this.ringBuffer = new Float32Array(sampleRate * 2); // 2 seconds buffer
-    this.writePosition = 0;
-    this.readPosition = 0;
-    this.availableSamples = 0;
-    
-    // Handle messages from main thread
-    this.port.onmessage = (event) => {
-      this.handleMessage(event.data);
-    };
-  }
+  constructor() {}
 
   handleMessage(data) {

[NoCoverage] BooleanLiteral
src/worklet.js:11:21
     this.currentBuffer = null;
     this.bufferPosition = 0;
     this.chunkIndex = 0;
-    this.isPaused = false;
+    this.isPaused = true;
     this.isPlaying = false;
     

[NoCoverage] BooleanLiteral
src/worklet.js:12:22
     this.bufferPosition = 0;
     this.chunkIndex = 0;
     this.isPaused = false;
-    this.isPlaying = false;
+    this.isPlaying = true;
     
     // Ring buffer for smooth playback

[NoCoverage] ArithmeticOperator
src/worklet.js:15:40
     this.isPlaying = false;
     
     // Ring buffer for smooth playback
-    this.ringBuffer = new Float32Array(sampleRate * 2); // 2 seconds buffer
+    this.ringBuffer = new Float32Array(sampleRate / 2); // 2 seconds buffer
     this.writePosition = 0;
     this.readPosition = 0;

[NoCoverage] BlockStatement
src/worklet.js:21:38
     this.availableSamples = 0;
     
     // Handle messages from main thread
-    this.port.onmessage = (event) => {
-      this.handleMessage(event.data);
-    };
+    this.port.onmessage = (event) => {};
   }
 

[NoCoverage] BlockStatement
src/worklet.js:26:23
     };
   }
 
-  handleMessage(data) {
-    if (typeof data === 'object' && data !== null) {
-      const { type } = data;
-      
-      switch (type) {
-        case 'queue-audio':
-          this.queueAudio(data.audioData, data.metadata);
-          break;
-        case 'pause':
-          this.isPaused = true;
-          break;
-        case 'resume':
-          this.isPaused = false;
-          break;
-        case 'stop':
-          this.stop();
-          break;
-      }
-    } else if (data instanceof Float32Array) {
-      // Direct Float32Array data from Kokoro
-      this.queueAudio(data);
-    }
-  }
+  handleMessage(data) {}
 
   queueAudio(audioData, metadata = {}) {

[NoCoverage] LogicalOperator
src/worklet.js:27:9
   }
 
   handleMessage(data) {
-    if (typeof data === 'object' && data !== null) {
+    if (typeof data === 'object' || data !== null) {
       const { type } = data;
       

[NoCoverage] BlockStatement
src/worklet.js:27:52
   }
 
   handleMessage(data) {
-    if (typeof data === 'object' && data !== null) {
-      const { type } = data;
-      
-      switch (type) {
-        case 'queue-audio':
-          this.queueAudio(data.audioData, data.metadata);
-          break;
-        case 'pause':
-          this.isPaused = true;
-          break;
-        case 'resume':
-          this.isPaused = false;
-          break;
-        case 'stop':
-          this.stop();
-          break;
-      }
-    } else if (data instanceof Float32Array) {
+    if (typeof data === 'object' && data !== null) {} else if (data instanceof Float32Array) {
       // Direct Float32Array data from Kokoro
       this.queueAudio(data);

[NoCoverage] ConditionalExpression
src/worklet.js:31:9
       const { type } = data;
       
       switch (type) {
-        case 'queue-audio':
-          this.queueAudio(data.audioData, data.metadata);
-          break;
+        case 'queue-audio':
         case 'pause':
           this.isPaused = true;

[NoCoverage] ConditionalExpression
src/worklet.js:34:9
         case 'queue-audio':
           this.queueAudio(data.audioData, data.metadata);
           break;
-        case 'pause':
-          this.isPaused = true;
-          break;
+        case 'pause':
         case 'resume':
           this.isPaused = false;

[NoCoverage] BooleanLiteral
src/worklet.js:35:27
           this.queueAudio(data.audioData, data.metadata);
           break;
         case 'pause':
-          this.isPaused = true;
+          this.isPaused = false;
           break;
         case 'resume':

[NoCoverage] ConditionalExpression
src/worklet.js:37:9
         case 'pause':
           this.isPaused = true;
           break;
-        case 'resume':
-          this.isPaused = false;
-          break;
+        case 'resume':
         case 'stop':
           this.stop();

[NoCoverage] BooleanLiteral
src/worklet.js:38:27
           this.isPaused = true;
           break;
         case 'resume':
-          this.isPaused = false;
+          this.isPaused = true;
           break;
         case 'stop':

[NoCoverage] ConditionalExpression
src/worklet.js:40:9
         case 'resume':
           this.isPaused = false;
           break;
-        case 'stop':
-          this.stop();
-          break;
+        case 'stop':
       }
     } else if (data instanceof Float32Array) {

[NoCoverage] ConditionalExpression
src/worklet.js:44:16
           this.stop();
           break;
       }
-    } else if (data instanceof Float32Array) {
+    } else if (false) {
       // Direct Float32Array data from Kokoro
       this.queueAudio(data);

[NoCoverage] ConditionalExpression
src/worklet.js:44:16
           this.stop();
           break;
       }
-    } else if (data instanceof Float32Array) {
+    } else if (true) {
       // Direct Float32Array data from Kokoro
       this.queueAudio(data);

[NoCoverage] BlockStatement
src/worklet.js:50:40
     }
   }
 
-  queueAudio(audioData, metadata = {}) {
-    // Convert to Float32Array if needed
-    let float32Data;
-    if (audioData instanceof Float32Array) {
-      float32Data = audioData;
-    } else if (audioData instanceof Array) {
-      float32Data = new Float32Array(audioData);
-    } else {
-      console.error('Invalid audio data type');
-      return;
-    }
-
-    this.audioQueue.push({
-      data: float32Data,
-      metadata: {
-        ...metadata,
-        chunkIndex: this.chunkIndex++
-      }
-    });
-
-    // Fill ring buffer
-    this.fillRingBuffer();
-  }
+  queueAudio(audioData, metadata = {}) {}
 
   fillRingBuffer() {

[NoCoverage] BlockStatement
src/worklet.js:53:44
   queueAudio(audioData, metadata = {}) {
     // Convert to Float32Array if needed
     let float32Data;
-    if (audioData instanceof Float32Array) {
-      float32Data = audioData;
-    } else if (audioData instanceof Array) {
+    if (audioData instanceof Float32Array) {} else if (audioData instanceof Array) {
       float32Data = new Float32Array(audioData);
     } else {

[NoCoverage] BlockStatement
src/worklet.js:55:44
     let float32Data;
     if (audioData instanceof Float32Array) {
       float32Data = audioData;
-    } else if (audioData instanceof Array) {
-      float32Data = new Float32Array(audioData);
-    } else {
+    } else if (audioData instanceof Array) {} else {
       console.error('Invalid audio data type');
       return;

[NoCoverage] ConditionalExpression
src/worklet.js:55:16
     let float32Data;
     if (audioData instanceof Float32Array) {
       float32Data = audioData;
-    } else if (audioData instanceof Array) {
+    } else if (true) {
       float32Data = new Float32Array(audioData);
     } else {

[NoCoverage] BlockStatement
src/worklet.js:57:12
       float32Data = audioData;
     } else if (audioData instanceof Array) {
       float32Data = new Float32Array(audioData);
-    } else {
-      console.error('Invalid audio data type');
-      return;
-    }
+    } else {}
 
     this.audioQueue.push({

[NoCoverage] UpdateOperator
src/worklet.js:66:21
       data: float32Data,
       metadata: {
         ...metadata,
-        chunkIndex: this.chunkIndex++
+        chunkIndex: this.chunkIndex--
       }
     });

[NoCoverage] BlockStatement
src/worklet.js:74:20
     this.fillRingBuffer();
   }
 
-  fillRingBuffer() {
-    while (this.audioQueue.length > 0 && this.availableSamples < this.ringBuffer.length * 0.8) {
-      const chunk = this.audioQueue.shift();
-      const data = chunk.data;
-      
-      for (let i = 0; i < data.length; i++) {
-        this.ringBuffer[this.writePosition] = data[i];
-        this.writePosition = (this.writePosition + 1) % this.ringBuffer.length;
-        this.availableSamples++;
-        
-        // Prevent buffer overflow
-        if (this.availableSamples >= this.ringBuffer.length) {
-          break;
-        }
-      }
-      
-      // Notify that chunk has been queued
-      this.port.postMessage({
-        type: 'chunk-queued',
-        data: chunk.metadata
-      });
-    }
-  }
+  fillRingBuffer() {}
 
   stop() {

[NoCoverage] EqualityOperator
src/worklet.js:75:12
   }
 
   fillRingBuffer() {
-    while (this.audioQueue.length > 0 && this.availableSamples < this.ringBuffer.length * 0.8) {
+    while (this.audioQueue.length >= 0 && this.availableSamples < this.ringBuffer.length * 0.8) {
       const chunk = this.audioQueue.shift();
       const data = chunk.data;

[NoCoverage] ArithmeticOperator
src/worklet.js:75:66
   }
 
   fillRingBuffer() {
-    while (this.audioQueue.length > 0 && this.availableSamples < this.ringBuffer.length * 0.8) {
+    while (this.audioQueue.length > 0 && this.availableSamples < this.ringBuffer.length / 0.8) {
       const chunk = this.audioQueue.shift();
       const data = chunk.data;

[NoCoverage] EqualityOperator
src/worklet.js:79:23
       const chunk = this.audioQueue.shift();
       const data = chunk.data;
       
-      for (let i = 0; i < data.length; i++) {
+      for (let i = 0; i <= data.length; i++) {
         this.ringBuffer[this.writePosition] = data[i];
         this.writePosition = (this.writePosition + 1) % this.ringBuffer.length;

[NoCoverage] EqualityOperator
src/worklet.js:79:23
       const chunk = this.audioQueue.shift();
       const data = chunk.data;
       
-      for (let i = 0; i < data.length; i++) {
+      for (let i = 0; i >= data.length; i++) {
         this.ringBuffer[this.writePosition] = data[i];
         this.writePosition = (this.writePosition + 1) % this.ringBuffer.length;

[NoCoverage] ArithmeticOperator
src/worklet.js:81:31
       
       for (let i = 0; i < data.length; i++) {
         this.ringBuffer[this.writePosition] = data[i];
-        this.writePosition = (this.writePosition + 1) % this.ringBuffer.length;
+        this.writePosition = (this.writePosition - 1) % this.ringBuffer.length;
         this.availableSamples++;
         

[NoCoverage] ArithmeticOperator
src/worklet.js:81:30
       
       for (let i = 0; i < data.length; i++) {
         this.ringBuffer[this.writePosition] = data[i];
-        this.writePosition = (this.writePosition + 1) % this.ringBuffer.length;
+        this.writePosition = (this.writePosition + 1) * this.ringBuffer.length;
         this.availableSamples++;
         

[NoCoverage] UpdateOperator
src/worklet.js:82:9
       for (let i = 0; i < data.length; i++) {
         this.ringBuffer[this.writePosition] = data[i];
         this.writePosition = (this.writePosition + 1) % this.ringBuffer.length;
-        this.availableSamples++;
+        this.availableSamples--;
         
         // Prevent buffer overflow

[NoCoverage] BlockStatement
src/worklet.js:85:62
         this.availableSamples++;
         
         // Prevent buffer overflow
-        if (this.availableSamples >= this.ringBuffer.length) {
-          break;
-        }
+        if (this.availableSamples >= this.ringBuffer.length) {}
       }
       

[NoCoverage] EqualityOperator
src/worklet.js:85:13
         this.availableSamples++;
         
         // Prevent buffer overflow
-        if (this.availableSamples >= this.ringBuffer.length) {
+        if (this.availableSamples < this.ringBuffer.length) {
           break;
         }

[NoCoverage] ObjectLiteral
src/worklet.js:91:29
       }
       
       // Notify that chunk has been queued
-      this.port.postMessage({
-        type: 'chunk-queued',
-        data: chunk.metadata
-      });
+      this.port.postMessage({});
     }
   }

[NoCoverage] StringLiteral
src/worklet.js:92:15
       
       // Notify that chunk has been queued
       this.port.postMessage({
-        type: 'chunk-queued',
+        type: "",
         data: chunk.metadata
       });

[NoCoverage] BlockStatement
src/worklet.js:98:10
     }
   }
 
-  stop() {
-    this.audioQueue = [];
-    this.currentBuffer = null;
-    this.bufferPosition = 0;
-    this.isPaused = false;
-    this.isPlaying = false;
-    this.availableSamples = 0;
-    this.readPosition = 0;
-    this.writePosition = 0;
-    this.chunkIndex = 0;
-  }
+  stop() {}
 
   process(inputs, outputs) {

[NoCoverage] ArrayDeclaration
src/worklet.js:99:23
   }
 
   stop() {
-    this.audioQueue = [];
+    this.audioQueue = ["Stryker was here"];
     this.currentBuffer = null;
     this.bufferPosition = 0;

[NoCoverage] BooleanLiteral
src/worklet.js:102:21
     this.audioQueue = [];
     this.currentBuffer = null;
     this.bufferPosition = 0;
-    this.isPaused = false;
+    this.isPaused = true;
     this.isPlaying = false;
     this.availableSamples = 0;

[NoCoverage] BlockStatement
src/worklet.js:110:28
     this.chunkIndex = 0;
   }
 
-  process(inputs, outputs) {
-    const output = outputs[0];
-
-    if (!this._validOutput(output)) return true;
-
-    const outputChannel = output[0];
-    const framesToProcess = outputChannel.length;
-
-    if (this.isPaused || this.availableSamples === 0) {
-      outputChannel.fill(0);
-      return true;
-    }
-
-    const { samplesWritten, wasPlaying } = this._writeOutput(outputChannel, framesToProcess);
-
-    this._maybeRefillBuffer();
-    this._maybeReportChunkCompletion(samplesWritten);
-    this._maybeReportPlaybackEnded(wasPlaying);
-    this._maybeReportUnderrun(samplesWritten, framesToProcess);
-
-    return true;
-  }
+  process(inputs, outputs) {}
 
   _validOutput(output) {

[NoCoverage] BooleanLiteral
src/worklet.js:113:44
   process(inputs, outputs) {
     const output = outputs[0];
 
-    if (!this._validOutput(output)) return true;
+    if (!this._validOutput(output)) return false;
 
     const outputChannel = output[0];

[NoCoverage] ConditionalExpression
src/worklet.js:113:9
   process(inputs, outputs) {
     const output = outputs[0];
 
-    if (!this._validOutput(output)) return true;
+    if (true) return true;
 
     const outputChannel = output[0];

[NoCoverage] ConditionalExpression
src/worklet.js:118:9
     const outputChannel = output[0];
     const framesToProcess = outputChannel.length;
 
-    if (this.isPaused || this.availableSamples === 0) {
+    if (true) {
       outputChannel.fill(0);
       return true;

[NoCoverage] ConditionalExpression
src/worklet.js:118:26
     const outputChannel = output[0];
     const framesToProcess = outputChannel.length;
 
-    if (this.isPaused || this.availableSamples === 0) {
+    if (this.isPaused || false) {
       outputChannel.fill(0);
       return true;

[NoCoverage] BooleanLiteral
src/worklet.js:120:14
 
     if (this.isPaused || this.availableSamples === 0) {
       outputChannel.fill(0);
-      return true;
+      return false;
     }
 

[NoCoverage] BlockStatement
src/worklet.js:133:24
     return true;
   }
 
-  _validOutput(output) {
-    return output && output.length > 0;
-  }
+  _validOutput(output) {}
 
   _writeOutput(outputChannel, frames) {

[NoCoverage] ConditionalExpression
src/worklet.js:134:12
   }
 
   _validOutput(output) {
-    return output && output.length > 0;
+    return false;
   }
 

[NoCoverage] EqualityOperator
src/worklet.js:134:22
   }
 
   _validOutput(output) {
-    return output && output.length > 0;
+    return output && output.length >= 0;
   }
 

[NoCoverage] BlockStatement
src/worklet.js:137:39
     return output && output.length > 0;
   }
 
-  _writeOutput(outputChannel, frames) {
-    let samplesWritten = 0;
-    const wasPlaying = this.isPlaying;
-    this.isPlaying = true;
-
-    for (let i = 0; i < frames; i++) {
-      if (this.availableSamples > 0) {
-        outputChannel[i] = this.ringBuffer[this.readPosition];
-        this.readPosition = (this.readPosition + 1) % this.ringBuffer.length;
-        this.availableSamples--;
-        samplesWritten++;
-      } else {
-        outputChannel[i] = 0;
-      }
-    }
-
-    return { samplesWritten, wasPlaying };
-  }
+  _writeOutput(outputChannel, frames) {}
 
   _maybeRefillBuffer() {

[NoCoverage] BooleanLiteral
src/worklet.js:140:22
   _writeOutput(outputChannel, frames) {
     let samplesWritten = 0;
     const wasPlaying = this.isPlaying;
-    this.isPlaying = true;
+    this.isPlaying = false;
 
     for (let i = 0; i < frames; i++) {

[NoCoverage] BlockStatement
src/worklet.js:142:38
     const wasPlaying = this.isPlaying;
     this.isPlaying = true;
 
-    for (let i = 0; i < frames; i++) {
-      if (this.availableSamples > 0) {
-        outputChannel[i] = this.ringBuffer[this.readPosition];
-        this.readPosition = (this.readPosition + 1) % this.ringBuffer.length;
-        this.availableSamples--;
-        samplesWritten++;
-      } else {
-        outputChannel[i] = 0;
-      }
-    }
+    for (let i = 0; i < frames; i++) {}
 
     return { samplesWritten, wasPlaying };

[NoCoverage] EqualityOperator
src/worklet.js:142:21
     const wasPlaying = this.isPlaying;
     this.isPlaying = true;
 
-    for (let i = 0; i < frames; i++) {
+    for (let i = 0; i >= frames; i++) {
       if (this.availableSamples > 0) {
         outputChannel[i] = this.ringBuffer[this.readPosition];

[NoCoverage] EqualityOperator
src/worklet.js:143:11
     this.isPlaying = true;
 
     for (let i = 0; i < frames; i++) {
-      if (this.availableSamples > 0) {
+      if (this.availableSamples >= 0) {
         outputChannel[i] = this.ringBuffer[this.readPosition];
         this.readPosition = (this.readPosition + 1) % this.ringBuffer.length;

[NoCoverage] EqualityOperator
src/worklet.js:143:11
     this.isPlaying = true;
 
     for (let i = 0; i < frames; i++) {
-      if (this.availableSamples > 0) {
+      if (this.availableSamples <= 0) {
         outputChannel[i] = this.ringBuffer[this.readPosition];
         this.readPosition = (this.readPosition + 1) % this.ringBuffer.length;

[NoCoverage] ArithmeticOperator
src/worklet.js:145:30
     for (let i = 0; i < frames; i++) {
       if (this.availableSamples > 0) {
         outputChannel[i] = this.ringBuffer[this.readPosition];
-        this.readPosition = (this.readPosition + 1) % this.ringBuffer.length;
+        this.readPosition = (this.readPosition - 1) % this.ringBuffer.length;
         this.availableSamples--;
         samplesWritten++;

[NoCoverage] ArithmeticOperator
src/worklet.js:145:29
     for (let i = 0; i < frames; i++) {
       if (this.availableSamples > 0) {
         outputChannel[i] = this.ringBuffer[this.readPosition];
-        this.readPosition = (this.readPosition + 1) % this.ringBuffer.length;
+        this.readPosition = (this.readPosition + 1) * this.ringBuffer.length;
         this.availableSamples--;
         samplesWritten++;

[NoCoverage] UpdateOperator
src/worklet.js:146:9
       if (this.availableSamples > 0) {
         outputChannel[i] = this.ringBuffer[this.readPosition];
         this.readPosition = (this.readPosition + 1) % this.ringBuffer.length;
-        this.availableSamples--;
+        this.availableSamples++;
         samplesWritten++;
       } else {

[NoCoverage] UpdateOperator
src/worklet.js:147:9
         outputChannel[i] = this.ringBuffer[this.readPosition];
         this.readPosition = (this.readPosition + 1) % this.ringBuffer.length;
         this.availableSamples--;
-        samplesWritten++;
+        samplesWritten--;
       } else {
         outputChannel[i] = 0;

[NoCoverage] BlockStatement
src/worklet.js:148:14
         this.readPosition = (this.readPosition + 1) % this.ringBuffer.length;
         this.availableSamples--;
         samplesWritten++;
-      } else {
-        outputChannel[i] = 0;
-      }
+      } else {}
     }
 

[NoCoverage] ObjectLiteral
src/worklet.js:153:12
       }
     }
 
-    return { samplesWritten, wasPlaying };
+    return {};
   }
 

[NoCoverage] BlockStatement
src/worklet.js:156:24
     return { samplesWritten, wasPlaying };
   }
 
-  _maybeRefillBuffer() {
-    if (this.availableSamples < this.ringBuffer.length * 0.3) {
-      this.fillRingBuffer();
-    }
-  }
+  _maybeRefillBuffer() {}
 
   _maybeReportChunkCompletion(samplesWritten) {

[NoCoverage] ConditionalExpression
src/worklet.js:157:9
   }
 
   _maybeRefillBuffer() {
-    if (this.availableSamples < this.ringBuffer.length * 0.3) {
+    if (false) {
       this.fillRingBuffer();
     }

[NoCoverage] EqualityOperator
src/worklet.js:157:9
   }
 
   _maybeRefillBuffer() {
-    if (this.availableSamples < this.ringBuffer.length * 0.3) {
+    if (this.availableSamples >= this.ringBuffer.length * 0.3) {
       this.fillRingBuffer();
     }

[NoCoverage] BlockStatement
src/worklet.js:162:47
     }
   }
 
-  _maybeReportChunkCompletion(samplesWritten) {
-    if (samplesWritten <= 0) return;
-
-    const samplesPerChunk = sampleRate * 0.1; // Assuming 100ms chunks
-    if (this.bufferPosition > 0 && this.bufferPosition % samplesPerChunk < samplesWritten) {
-      this.port.postMessage({
-        type: 'next_chunk',
-        data: {
-          chunkIndex: Math.floor(this.bufferPosition / samplesPerChunk),
-          timestamp: currentTime
-        }
-      });
-    }
-
-    this.bufferPosition += samplesWritten;
-  }
+  _maybeReportChunkCompletion(samplesWritten) {}
 
   _maybeReportPlaybackEnded(wasPlaying) {

[NoCoverage] EqualityOperator
src/worklet.js:163:9
   }
 
   _maybeReportChunkCompletion(samplesWritten) {
-    if (samplesWritten <= 0) return;
+    if (samplesWritten < 0) return;
 
     const samplesPerChunk = sampleRate * 0.1; // Assuming 100ms chunks

[NoCoverage] EqualityOperator
src/worklet.js:163:9
   }
 
   _maybeReportChunkCompletion(samplesWritten) {
-    if (samplesWritten <= 0) return;
+    if (samplesWritten > 0) return;
 
     const samplesPerChunk = sampleRate * 0.1; // Assuming 100ms chunks

[NoCoverage] ArithmeticOperator
src/worklet.js:165:29
   _maybeReportChunkCompletion(samplesWritten) {
     if (samplesWritten <= 0) return;
 
-    const samplesPerChunk = sampleRate * 0.1; // Assuming 100ms chunks
+    const samplesPerChunk = sampleRate / 0.1; // Assuming 100ms chunks
     if (this.bufferPosition > 0 && this.bufferPosition % samplesPerChunk < samplesWritten) {
       this.port.postMessage({

[NoCoverage] ConditionalExpression
src/worklet.js:166:9
     if (samplesWritten <= 0) return;
 
     const samplesPerChunk = sampleRate * 0.1; // Assuming 100ms chunks
-    if (this.bufferPosition > 0 && this.bufferPosition % samplesPerChunk < samplesWritten) {
+    if (true) {
       this.port.postMessage({
         type: 'next_chunk',

[NoCoverage] ConditionalExpression
src/worklet.js:166:9
     if (samplesWritten <= 0) return;
 
     const samplesPerChunk = sampleRate * 0.1; // Assuming 100ms chunks
-    if (this.bufferPosition > 0 && this.bufferPosition % samplesPerChunk < samplesWritten) {
+    if (true && this.bufferPosition % samplesPerChunk < samplesWritten) {
       this.port.postMessage({
         type: 'next_chunk',

[NoCoverage] ObjectLiteral
src/worklet.js:169:15
     if (this.bufferPosition > 0 && this.bufferPosition % samplesPerChunk < samplesWritten) {
       this.port.postMessage({
         type: 'next_chunk',
-        data: {
-          chunkIndex: Math.floor(this.bufferPosition / samplesPerChunk),
-          timestamp: currentTime
-        }
+        data: {}
       });
     }

[NoCoverage] ArithmeticOperator
src/worklet.js:170:34
       this.port.postMessage({
         type: 'next_chunk',
         data: {
-          chunkIndex: Math.floor(this.bufferPosition / samplesPerChunk),
+          chunkIndex: Math.floor(this.bufferPosition * samplesPerChunk),
           timestamp: currentTime
         }

[NoCoverage] AssignmentOperator
src/worklet.js:176:5
       });
     }
 
-    this.bufferPosition += samplesWritten;
+    this.bufferPosition -= samplesWritten;
   }
 

[NoCoverage] BlockStatement
src/worklet.js:179:41
     this.bufferPosition += samplesWritten;
   }
 
-  _maybeReportPlaybackEnded(wasPlaying) {
-    if (wasPlaying && this.availableSamples === 0 && this.audioQueue.length === 0) {
-      this.isPlaying = false;
-      this.port.postMessage({ type: 'playback_ended' });
-    }
-  }
+  _maybeReportPlaybackEnded(wasPlaying) {}
 
   _maybeReportUnderrun(samplesWritten, framesToProcess) {

[NoCoverage] EqualityOperator
src/worklet.js:180:23
   }
 
   _maybeReportPlaybackEnded(wasPlaying) {
-    if (wasPlaying && this.availableSamples === 0 && this.audioQueue.length === 0) {
+    if (wasPlaying && this.availableSamples !== 0 && this.audioQueue.length === 0) {
       this.isPlaying = false;
       this.port.postMessage({ type: 'playback_ended' });

[NoCoverage] EqualityOperator
src/worklet.js:180:54
   }
 
   _maybeReportPlaybackEnded(wasPlaying) {
-    if (wasPlaying && this.availableSamples === 0 && this.audioQueue.length === 0) {
+    if (wasPlaying && this.availableSamples === 0 && this.audioQueue.length !== 0) {
       this.isPlaying = false;
       this.port.postMessage({ type: 'playback_ended' });

[NoCoverage] BooleanLiteral
src/worklet.js:181:24
 
   _maybeReportPlaybackEnded(wasPlaying) {
     if (wasPlaying && this.availableSamples === 0 && this.audioQueue.length === 0) {
-      this.isPlaying = false;
+      this.isPlaying = true;
       this.port.postMessage({ type: 'playback_ended' });
     }

[NoCoverage] BlockStatement
src/worklet.js:186:57
     }
   }
 
-  _maybeReportUnderrun(samplesWritten, framesToProcess) {
-    if (samplesWritten < framesToProcess && this.isPlaying) {
-      this.port.postMessage({
-        type: 'buffer-underrun',
-        data: { requested: framesToProcess, available: samplesWritten }
-      });
-    }
-  }
+  _maybeReportUnderrun(samplesWritten, framesToProcess) {}
 }
 

[NoCoverage] ConditionalExpression
src/worklet.js:187:9
   }
 
   _maybeReportUnderrun(samplesWritten, framesToProcess) {
-    if (samplesWritten < framesToProcess && this.isPlaying) {
+    if (false) {
       this.port.postMessage({
         type: 'buffer-underrun',

[NoCoverage] ConditionalExpression
src/worklet.js:187:9
   }
 
   _maybeReportUnderrun(samplesWritten, framesToProcess) {
-    if (samplesWritten < framesToProcess && this.isPlaying) {
+    if (true) {
       this.port.postMessage({
         type: 'buffer-underrun',

[NoCoverage] StringLiteral
src/worklet.js:189:15
   _maybeReportUnderrun(samplesWritten, framesToProcess) {
     if (samplesWritten < framesToProcess && this.isPlaying) {
       this.port.postMessage({
-        type: 'buffer-underrun',
+        type: "",
         data: { requested: framesToProcess, available: samplesWritten }
       });
