[Killed] ConditionalExpression
src/worklet.js:27:9
   }
 
   handleMessage(data) {
-    if (typeof data === 'object' && data !== null) {
+    if (false) {
       const { type } = data;
       
killedBy: PCMQueueProcessor queues audio and processes frames generating underrun then playback ended
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/worklet.js:75:12
   }
 
   fillRingBuffer() {
-    while (this.audioQueue.length > 0 && this.availableSamples < this.ringBuffer.length * 0.8) {
+    while (true && this.availableSamples < this.ringBuffer.length * 0.8) {
       const chunk = this.audioQueue.shift();
       const data = chunk.data;
killedBy: PCMQueueProcessor queues audio and processes frames generating underrun then playback ended
statusReason: TypeError: Cannot read properties of undefined (reading 'data')
