[Killed] BlockStatement
src/audio.js:144:28
       this.workletNode = null;
     }
     
-    if (this.audioContext) {
-      this.audioContext.close();
-      this.audioContext = null;
-    }
+    if (this.audioContext) {}
     
     this.isInitialized = false;
killedBy: AudioModule destroy cleans resources
statusReason: Error: expect(received).toBeNull()

Received: {"audioWorklet": {"addModule": [Function mockConstructor]}, "close": [Function mockConstructor], "destination": {}, "resume": [Function mockConstructor], "state": "running"}
