[Killed] StringLiteral
src/llm.js:4:22
 // Configuration
 // Primary model (ONNX format) – file set contains onnx/model*.onnx
 // Using the v3 transformers.js package already declared in package.json.
-const LLM_MODEL_ID = 'onnx-community/Qwen2.5-0.5B-Instruct-ONNX';
+const LLM_MODEL_ID = "";
 
 // Local model base is read dynamically during environment configuration so tests
killedBy: LLMModule additional coverage device, model id and initialized state accessors
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Qwen2.5"
Received string:    ""

[Killed] BlockStatement
src/llm.js:17:22
     this.setupEnvironment();
   }
 
-  setupEnvironment() {
-    // env config applied after dynamic import if not already available.
-    if (typeof window !== 'undefined' && window.transformers) {
-      this._configureEnv(window.transformers.env);
-    }
-  }
+  setupEnvironment() {}
 
   _configureEnv(env) {
killedBy: LLMModule additional coverage setupEnvironment configures existing window.transformers env
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] LogicalOperator
src/llm.js:19:9
 
   setupEnvironment() {
     // env config applied after dynamic import if not already available.
-    if (typeof window !== 'undefined' && window.transformers) {
+    if (typeof window !== 'undefined' || window.transformers) {
       this._configureEnv(window.transformers.env);
     }
killedBy: LLMModule additional coverage non-streaming path simulates token streaming when onToken provided
statusReason: TypeError: Cannot read properties of undefined (reading 'env')

[Killed] BlockStatement
src/llm.js:19:63
 
   setupEnvironment() {
     // env config applied after dynamic import if not already available.
-    if (typeof window !== 'undefined' && window.transformers) {
-      this._configureEnv(window.transformers.env);
-    }
+    if (typeof window !== 'undefined' && window.transformers) {}
   }
 
killedBy: LLMModule additional coverage setupEnvironment configures existing window.transformers env
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
src/llm.js:24:22
     }
   }
 
-  _configureEnv(env) {
-    // Enable browser cache between sessions
-    env.useBrowserCache = true;
-    env.allowLocalModels = true;
-    // Allow remote models unless user explicitly sets local-only flag
-    const forceLocalOnly = (typeof window !== 'undefined' && window.LOCAL_LLM_LOCAL_ONLY) || false;
-    env.allowRemoteModels = !forceLocalOnly;
-    const base = (typeof window !== 'undefined' && window.LOCAL_LLM_MODELS_BASE) || null;
-    if (base) {
-      env.localModelPath = base.endsWith('/') ? base : `${base}/`;
-    }
-    // Optimize ONNX WASM threads (safe fallback 4)
-    if (env.backends?.onnx?.wasm) {
-      env.backends.onnx.wasm.numThreads = navigator.hardwareConcurrency || 4;
-    }
-  }
+  _configureEnv(env) {}
 
   async detectDevice() {
killedBy: LLMModule additional coverage setupEnvironment configures existing window.transformers env
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BooleanLiteral
src/llm.js:26:27
 
   _configureEnv(env) {
     // Enable browser cache between sessions
-    env.useBrowserCache = true;
+    env.useBrowserCache = false;
     env.allowLocalModels = true;
     // Allow remote models unless user explicitly sets local-only flag
killedBy: LLMModule additional coverage setupEnvironment configures existing window.transformers env
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/llm.js:27:28
   _configureEnv(env) {
     // Enable browser cache between sessions
     env.useBrowserCache = true;
-    env.allowLocalModels = true;
+    env.allowLocalModels = false;
     // Allow remote models unless user explicitly sets local-only flag
     const forceLocalOnly = (typeof window !== 'undefined' && window.LOCAL_LLM_LOCAL_ONLY) || false;
killedBy: LLMModule additional coverage setupEnvironment configures existing window.transformers env
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/llm.js:29:29
     env.useBrowserCache = true;
     env.allowLocalModels = true;
     // Allow remote models unless user explicitly sets local-only flag
-    const forceLocalOnly = (typeof window !== 'undefined' && window.LOCAL_LLM_LOCAL_ONLY) || false;
+    const forceLocalOnly = (typeof window === 'undefined' && window.LOCAL_LLM_LOCAL_ONLY) || false;
     env.allowRemoteModels = !forceLocalOnly;
     const base = (typeof window !== 'undefined' && window.LOCAL_LLM_MODELS_BASE) || null;
killedBy: LLMModule core behavior environment respects local only & localModelPath when flags set before initialization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/llm.js:29:29
     env.useBrowserCache = true;
     env.allowLocalModels = true;
     // Allow remote models unless user explicitly sets local-only flag
-    const forceLocalOnly = (typeof window !== 'undefined' && window.LOCAL_LLM_LOCAL_ONLY) || false;
+    const forceLocalOnly = (false) || false;
     env.allowRemoteModels = !forceLocalOnly;
     const base = (typeof window !== 'undefined' && window.LOCAL_LLM_MODELS_BASE) || null;
killedBy: LLMModule core behavior environment respects local only & localModelPath when flags set before initialization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/llm.js:30:29
     env.allowLocalModels = true;
     // Allow remote models unless user explicitly sets local-only flag
     const forceLocalOnly = (typeof window !== 'undefined' && window.LOCAL_LLM_LOCAL_ONLY) || false;
-    env.allowRemoteModels = !forceLocalOnly;
+    env.allowRemoteModels = forceLocalOnly;
     const base = (typeof window !== 'undefined' && window.LOCAL_LLM_MODELS_BASE) || null;
     if (base) {
killedBy: LLMModule core behavior environment respects local only & localModelPath when flags set before initialization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/llm.js:31:18
     // Allow remote models unless user explicitly sets local-only flag
     const forceLocalOnly = (typeof window !== 'undefined' && window.LOCAL_LLM_LOCAL_ONLY) || false;
     env.allowRemoteModels = !forceLocalOnly;
-    const base = (typeof window !== 'undefined' && window.LOCAL_LLM_MODELS_BASE) || null;
+    const base = true;
     if (base) {
       env.localModelPath = base.endsWith('/') ? base : `${base}/`;
killedBy: LLMModule additional coverage setupEnvironment configures existing window.transformers env
statusReason: TypeError: base.endsWith is not a function

[Killed] EqualityOperator
src/llm.js:31:19
     // Allow remote models unless user explicitly sets local-only flag
     const forceLocalOnly = (typeof window !== 'undefined' && window.LOCAL_LLM_LOCAL_ONLY) || false;
     env.allowRemoteModels = !forceLocalOnly;
-    const base = (typeof window !== 'undefined' && window.LOCAL_LLM_MODELS_BASE) || null;
+    const base = (typeof window === 'undefined' && window.LOCAL_LLM_MODELS_BASE) || null;
     if (base) {
       env.localModelPath = base.endsWith('/') ? base : `${base}/`;
killedBy: LLMModule core behavior environment respects local only & localModelPath when flags set before initialization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/models/"
Received: undefined

[Killed] ConditionalExpression
src/llm.js:32:9
     const forceLocalOnly = (typeof window !== 'undefined' && window.LOCAL_LLM_LOCAL_ONLY) || false;
     env.allowRemoteModels = !forceLocalOnly;
     const base = (typeof window !== 'undefined' && window.LOCAL_LLM_MODELS_BASE) || null;
-    if (base) {
+    if (true) {
       env.localModelPath = base.endsWith('/') ? base : `${base}/`;
     }
killedBy: LLMModule core behavior generate uses streaming path when async iterator returned
statusReason: Error: Text generation failed: Failed to load LLM model: Cannot read properties of null (reading 'endsWith')

[Killed] BlockStatement
src/llm.js:32:15
     const forceLocalOnly = (typeof window !== 'undefined' && window.LOCAL_LLM_LOCAL_ONLY) || false;
     env.allowRemoteModels = !forceLocalOnly;
     const base = (typeof window !== 'undefined' && window.LOCAL_LLM_MODELS_BASE) || null;
-    if (base) {
-      env.localModelPath = base.endsWith('/') ? base : `${base}/`;
-    }
+    if (base) {}
     // Optimize ONNX WASM threads (safe fallback 4)
     if (env.backends?.onnx?.wasm) {
killedBy: LLMModule core behavior environment respects local only & localModelPath when flags set before initialization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/models/"
Received: undefined

[Killed] MethodExpression
src/llm.js:33:28
     env.allowRemoteModels = !forceLocalOnly;
     const base = (typeof window !== 'undefined' && window.LOCAL_LLM_MODELS_BASE) || null;
     if (base) {
-      env.localModelPath = base.endsWith('/') ? base : `${base}/`;
+      env.localModelPath = base.startsWith('/') ? base : `${base}/`;
     }
     // Optimize ONNX WASM threads (safe fallback 4)
killedBy: LLMModule core behavior environment respects local only & localModelPath when flags set before initialization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/models/"
Received: "/models"

[Killed] StringLiteral
src/llm.js:33:56
     env.allowRemoteModels = !forceLocalOnly;
     const base = (typeof window !== 'undefined' && window.LOCAL_LLM_MODELS_BASE) || null;
     if (base) {
-      env.localModelPath = base.endsWith('/') ? base : `${base}/`;
+      env.localModelPath = base.endsWith('/') ? base : ``;
     }
     // Optimize ONNX WASM threads (safe fallback 4)
killedBy: LLMModule core behavior environment respects local only & localModelPath when flags set before initialization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/models/"
Received: ""

[Killed] BlockStatement
src/llm.js:36:35
       env.localModelPath = base.endsWith('/') ? base : `${base}/`;
     }
     // Optimize ONNX WASM threads (safe fallback 4)
-    if (env.backends?.onnx?.wasm) {
-      env.backends.onnx.wasm.numThreads = navigator.hardwareConcurrency || 4;
-    }
+    if (env.backends?.onnx?.wasm) {}
   }
 
killedBy: LLMModule additional coverage setupEnvironment configures existing window.transformers env
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 0

[Killed] ConditionalExpression
src/llm.js:36:9
       env.localModelPath = base.endsWith('/') ? base : `${base}/`;
     }
     // Optimize ONNX WASM threads (safe fallback 4)
-    if (env.backends?.onnx?.wasm) {
+    if (false) {
       env.backends.onnx.wasm.numThreads = navigator.hardwareConcurrency || 4;
     }
killedBy: LLMModule additional coverage setupEnvironment configures existing window.transformers env
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 0

[Killed] ConditionalExpression
src/llm.js:37:43
     }
     // Optimize ONNX WASM threads (safe fallback 4)
     if (env.backends?.onnx?.wasm) {
-      env.backends.onnx.wasm.numThreads = navigator.hardwareConcurrency || 4;
+      env.backends.onnx.wasm.numThreads = false;
     }
   }
killedBy: LLMModule additional coverage setupEnvironment configures existing window.transformers env
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: false

[Killed] LogicalOperator
src/llm.js:37:43
     }
     // Optimize ONNX WASM threads (safe fallback 4)
     if (env.backends?.onnx?.wasm) {
-      env.backends.onnx.wasm.numThreads = navigator.hardwareConcurrency || 4;
+      env.backends.onnx.wasm.numThreads = navigator.hardwareConcurrency && 4;
     }
   }
killedBy: LLMModule additional coverage setupEnvironment configures existing window.transformers env
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 4

[Killed] ConditionalExpression
src/llm.js:43:9
 
   async detectDevice() {
     // Check WebGPU availability
-    if (navigator.gpu) {
+    if (false) {
       try {
         const adapter = await navigator.gpu.requestAdapter();
killedBy: LLMModule core behavior detectDevice returns wasm when no gpu, webgpu when gpu available
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "webgpu"
Received: "wasm"

[Killed] BlockStatement
src/llm.js:46:22
     if (navigator.gpu) {
       try {
         const adapter = await navigator.gpu.requestAdapter();
-        if (adapter) {
-          return 'webgpu';
-        }
+        if (adapter) {}
       } catch {
         console.warn('WebGPU adapter request failed');
killedBy: LLMModule core behavior detectDevice returns wasm when no gpu, webgpu when gpu available
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "webgpu"
Received: "wasm"

[Killed] StringLiteral
src/llm.js:47:18
       try {
         const adapter = await navigator.gpu.requestAdapter();
         if (adapter) {
-          return 'webgpu';
+          return "";
         }
       } catch {
killedBy: LLMModule core behavior detectDevice returns wasm when no gpu, webgpu when gpu available
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "webgpu"
Received: ""

[Killed] ConditionalExpression
src/llm.js:58:9
 
   async initializePipeline(onProgress) {
     if (this.pipeline) return this.pipeline;
-    if (this.isLoading) {
+    if (true) {
       // Wait for current loading to complete
       while (this.isLoading) {
killedBy: LLMModule additional coverage non-streaming path simulates token streaming when onToken provided
statusReason: Error: Text generation failed: pipeline is not a function

[Killed] BlockStatement
src/llm.js:72:11
       // Dynamically import the installed v3 transformers.js package (preferred)
       // Fallback: if import fails (should not in normal build), raise clear error.
       let transformers;
-      try {
-        transformers = await import('@huggingface/transformers');
-      } catch {
+      try {} catch {
         throw new Error('Failed to load @huggingface/transformers package – ensure dependency is installed.');
       }
killedBy: LLMModule additional coverage non-streaming path simulates token streaming when onToken provided
statusReason: Error: Text generation failed: Failed to load LLM model: Cannot destructure property 'pipeline' of 'transformers' as it is undefined.

[Killed] StringLiteral
src/llm.js:73:37
       // Fallback: if import fails (should not in normal build), raise clear error.
       let transformers;
       try {
-        transformers = await import('@huggingface/transformers');
+        transformers = await import("");
       } catch {
         throw new Error('Failed to load @huggingface/transformers package – ensure dependency is installed.');
killedBy: LLMModule additional coverage non-streaming path simulates token streaming when onToken provided
statusReason: Error: Text generation failed: Failed to load LLM model: Cannot set properties of undefined (setting 'useBrowserCache')

[NoCoverage] BlockStatement
src/llm.js:74:15
       let transformers;
       try {
         transformers = await import('@huggingface/transformers');
-      } catch {
-        throw new Error('Failed to load @huggingface/transformers package – ensure dependency is installed.');
-      }
+      } catch {}
 
       const { pipeline, env } = transformers; // v3 API

[Survived] ObjectLiteral
src/llm.js:85:20
       this.device = await this.detectDevice();
       
       // Create pipeline with progress callback
-      onProgress?.({ percentage: 0, text: 'Initializing pipeline...' });
+      onProgress?.({});
       
       this.pipeline = await pipeline('text-generation', LLM_MODEL_ID, {

[NoCoverage] BlockStatement
src/llm.js:90:42
       this.pipeline = await pipeline('text-generation', LLM_MODEL_ID, {
         device: this.device,
         // Let transformers.js choose correct model.onnx / model_quantized.onnx automatically.
-        progress_callback: (progress) => {
-          // Some progress events may lack total; guard to avoid NaN.
-            const total = progress.total || progress.loaded || 1;
-            const loaded = progress.loaded || 0;
-            const percentage = Math.min(100, Math.max(0, Math.round((loaded / total) * 100)));
-            onProgress?.({
-              percentage,
-              text: `Loading ${progress.file || 'model'}: ${percentage}%`
-            });
-        }
+        progress_callback: (progress) => {}
       });
 

[NoCoverage] LogicalOperator
src/llm.js:92:27
         // Let transformers.js choose correct model.onnx / model_quantized.onnx automatically.
         progress_callback: (progress) => {
           // Some progress events may lack total; guard to avoid NaN.
-            const total = progress.total || progress.loaded || 1;
+            const total = progress.total && progress.loaded || 1;
             const loaded = progress.loaded || 0;
             const percentage = Math.min(100, Math.max(0, Math.round((loaded / total) * 100)));

[NoCoverage] ConditionalExpression
src/llm.js:92:27
         // Let transformers.js choose correct model.onnx / model_quantized.onnx automatically.
         progress_callback: (progress) => {
           // Some progress events may lack total; guard to avoid NaN.
-            const total = progress.total || progress.loaded || 1;
+            const total = true;
             const loaded = progress.loaded || 0;
             const percentage = Math.min(100, Math.max(0, Math.round((loaded / total) * 100)));

[NoCoverage] ConditionalExpression
src/llm.js:93:28
         progress_callback: (progress) => {
           // Some progress events may lack total; guard to avoid NaN.
             const total = progress.total || progress.loaded || 1;
-            const loaded = progress.loaded || 0;
+            const loaded = true;
             const percentage = Math.min(100, Math.max(0, Math.round((loaded / total) * 100)));
             onProgress?.({

[NoCoverage] LogicalOperator
src/llm.js:93:28
         progress_callback: (progress) => {
           // Some progress events may lack total; guard to avoid NaN.
             const total = progress.total || progress.loaded || 1;
-            const loaded = progress.loaded || 0;
+            const loaded = progress.loaded && 0;
             const percentage = Math.min(100, Math.max(0, Math.round((loaded / total) * 100)));
             onProgress?.({

[NoCoverage] MethodExpression
src/llm.js:94:32
           // Some progress events may lack total; guard to avoid NaN.
             const total = progress.total || progress.loaded || 1;
             const loaded = progress.loaded || 0;
-            const percentage = Math.min(100, Math.max(0, Math.round((loaded / total) * 100)));
+            const percentage = Math.max(100, Math.max(0, Math.round(loaded / total * 100)));
             onProgress?.({
               percentage,

[NoCoverage] ArithmeticOperator
src/llm.js:94:70
           // Some progress events may lack total; guard to avoid NaN.
             const total = progress.total || progress.loaded || 1;
             const loaded = progress.loaded || 0;
-            const percentage = Math.min(100, Math.max(0, Math.round((loaded / total) * 100)));
+            const percentage = Math.min(100, Math.max(0, Math.round((loaded * total) * 100)));
             onProgress?.({
               percentage,

[NoCoverage] OptionalChaining
src/llm.js:95:13
             const total = progress.total || progress.loaded || 1;
             const loaded = progress.loaded || 0;
             const percentage = Math.min(100, Math.max(0, Math.round((loaded / total) * 100)));
-            onProgress?.({
-              percentage,
-              text: `Loading ${progress.file || 'model'}: ${percentage}%`
-            });
+            onProgress({
+  percentage,
+  text: `Loading ${progress.file || 'model'}: ${percentage}%`
+});
         }
       });

[NoCoverage] StringLiteral
src/llm.js:106:21
       return this.pipeline;
 
     } catch (error) {
-      console.error('Failed to initialize LLM pipeline:', error);
+      console.error("", error);
       throw new Error(`Failed to load LLM model: ${error.message}`);
     } finally {

[Killed] ConditionalExpression
src/llm.js:141:11
       });
 
       // Delegate handling to helpers for clarity (streaming vs non-streaming)
-      if (generator && typeof generator[Symbol.asyncIterator] === 'function') {
+      if (true) {
         return await this._handleStreamingGenerator(generator, onToken);
       }
killedBy: LLMModule additional coverage non-streaming path simulates token streaming when onToken provided
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 3
Received:    1

[Killed] EqualityOperator
src/llm.js:141:24
       });
 
       // Delegate handling to helpers for clarity (streaming vs non-streaming)
-      if (generator && typeof generator[Symbol.asyncIterator] === 'function') {
+      if (generator && typeof generator[Symbol.asyncIterator] !== 'function') {
         return await this._handleStreamingGenerator(generator, onToken);
       }
killedBy: LLMModule additional coverage non-streaming path simulates token streaming when onToken provided
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 3
Received:    1

[Killed] StringLiteral
src/llm.js:154:20
   }
 
   async _handleStreamingGenerator(generator, onToken) {
-    let fullText = '';
+    let fullText = "Stryker was here!";
     for await (const chunk of generator) {
       const token = this.extractToken(chunk);
killedBy: LLMModule core behavior generate uses streaming path when async iterator returned
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world"
Received: "Stryker was here!Hello world"

[Killed] ConditionalExpression
src/llm.js:157:11
     let fullText = '';
     for await (const chunk of generator) {
       const token = this.extractToken(chunk);
-      if (token) {
+      if (false) {
         fullText += token;
         onToken?.(token);
killedBy: LLMModule core behavior generate uses streaming path when async iterator returned
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world"
Received: ""

[Killed] ConditionalExpression
src/llm.js:167:18
 
   async _handleNonStreamingResult(generator, onToken) {
     const result = Array.isArray(generator) ? generator[0] : generator;
-    const text = result?.generated_text || result?.text || '';
+    const text = false;
 
     // Simulate streaming for consistency
killedBy: LLMModule additional coverage non-streaming path simulates token streaming when onToken provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world"
Received: false

[Killed] ConditionalExpression
src/llm.js:167:18
 
   async _handleNonStreamingResult(generator, onToken) {
     const result = Array.isArray(generator) ? generator[0] : generator;
-    const text = result?.generated_text || result?.text || '';
+    const text = false || '';
 
     // Simulate streaming for consistency
killedBy: LLMModule additional coverage non-streaming path simulates token streaming when onToken provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world"
Received: ""

[Killed] BlockStatement
src/llm.js:193:36
 
   extractToken(chunk) {
     // Extract token from different possible chunk formats
-    if (typeof chunk === 'string') {
-      return chunk;
-    }
+    if (typeof chunk === 'string') {}
     if (chunk && chunk.token) {
       return chunk.token.text || chunk.token;
killedBy: LLMModule core behavior extractToken handles multiple shapes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "hello"
Received: ""

[Killed] BlockStatement
src/llm.js:196:31
     if (typeof chunk === 'string') {
       return chunk;
     }
-    if (chunk && chunk.token) {
-      return chunk.token.text || chunk.token;
-    }
+    if (chunk && chunk.token) {}
     if (chunk && chunk.generated_text) {
       return chunk.generated_text;
killedBy: LLMModule core behavior extractToken handles multiple shapes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "hi"
Received: ""

[Killed] ConditionalExpression
src/llm.js:199:9
     if (chunk && chunk.token) {
       return chunk.token.text || chunk.token;
     }
-    if (chunk && chunk.generated_text) {
+    if (false) {
       return chunk.generated_text;
     }
killedBy: LLMModule core behavior extractToken handles multiple shapes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "done"
Received: ""

[Survived] Regex
src/llm.js:208:30
   tokenizeForDisplay(text) {
     // Simple tokenization for display purposes
     // In a real implementation, this could use the model's actual tokenizer
-    const words = text.split(/(\s+)/);
+    const words = text.split(/(\S+)/);
     const tokens = [];
     

[Killed] EqualityOperator
src/llm.js:229:12
   }
 
   isInitialized() {
-    return this.pipeline !== null;
+    return this.pipeline === null;
   }
 }
killedBy: LLMModule additional coverage device, model id and initialized state accessors
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
