[NoCoverage] BlockStatement
src/worklet.js:26:23
     };
   }
 
-  handleMessage(data) {
-    const { type } = data;
-    
-    switch (type) {
-      case 'queue-audio':
-        this.queueAudio(data.audioData, data.metadata);
-        break;
-      case 'pause':
-        this.isPaused = true;
-        break;
-      case 'resume':
-        this.isPaused = false;
-        break;
-      case 'stop':
-        this.stop();
-        break;
-    }
-  }
+  handleMessage(data) {}
 
   queueAudio(audioData, metadata = {}) {

[NoCoverage] ConditionalExpression
src/worklet.js:50:16
     let float32Data;
     if (audioData instanceof Float32Array) {
       float32Data = audioData;
-    } else if (audioData instanceof Array) {
+    } else if (false) {
       float32Data = new Float32Array(audioData);
     } else {

[NoCoverage] StringLiteral
src/worklet.js:53:21
     } else if (audioData instanceof Array) {
       float32Data = new Float32Array(audioData);
     } else {
-      console.error('Invalid audio data type');
+      console.error("");
       return;
     }

[NoCoverage] ObjectLiteral
src/worklet.js:59:17
 
     this.audioQueue.push({
       data: float32Data,
-      metadata: {
-        ...metadata,
-        chunkIndex: this.chunkIndex++
-      }
+      metadata: {}
     });
 

[NoCoverage] EqualityOperator
src/worklet.js:70:42
   }
 
   fillRingBuffer() {
-    while (this.audioQueue.length > 0 && this.availableSamples < this.ringBuffer.length * 0.8) {
+    while (this.audioQueue.length > 0 && this.availableSamples <= this.ringBuffer.length * 0.8) {
       const chunk = this.audioQueue.shift();
       const data = chunk.data;

[NoCoverage] ConditionalExpression
src/worklet.js:74:23
       const chunk = this.audioQueue.shift();
       const data = chunk.data;
       
-      for (let i = 0; i < data.length; i++) {
+      for (let i = 0; false; i++) {
         this.ringBuffer[this.writePosition] = data[i];
         this.writePosition = (this.writePosition + 1) % this.ringBuffer.length;

[NoCoverage] BlockStatement
src/worklet.js:74:45
       const chunk = this.audioQueue.shift();
       const data = chunk.data;
       
-      for (let i = 0; i < data.length; i++) {
-        this.ringBuffer[this.writePosition] = data[i];
-        this.writePosition = (this.writePosition + 1) % this.ringBuffer.length;
-        this.availableSamples++;
-        
-        // Prevent buffer overflow
-        if (this.availableSamples >= this.ringBuffer.length) {
-          break;
-        }
-      }
+      for (let i = 0; i < data.length; i++) {}
       
       // Notify that chunk has been queued

[NoCoverage] ConditionalExpression
src/worklet.js:108:9
   process(inputs, outputs) {
     const output = outputs[0];
 
-    if (!this._validOutput(output)) return true;
+    if (false) return true;
 
     const outputChannel = output[0];

[NoCoverage] LogicalOperator
src/worklet.js:113:9
     const outputChannel = output[0];
     const framesToProcess = outputChannel.length;
 
-    if (this.isPaused || this.availableSamples === 0) {
+    if (this.isPaused && this.availableSamples === 0) {
       outputChannel.fill(0);
       return true;

[NoCoverage] ConditionalExpression
src/worklet.js:129:12
   }
 
   _validOutput(output) {
-    return output && output.length > 0;
+    return true;
   }
 

[NoCoverage] UpdateOperator
src/worklet.js:137:33
     const wasPlaying = this.isPlaying;
     this.isPlaying = true;
 
-    for (let i = 0; i < frames; i++) {
+    for (let i = 0; i < frames; i--) {
       if (this.availableSamples > 0) {
         outputChannel[i] = this.ringBuffer[this.readPosition];

[NoCoverage] ConditionalExpression
src/worklet.js:152:9
   }
 
   _maybeRefillBuffer() {
-    if (this.availableSamples < this.ringBuffer.length * 0.3) {
+    if (true) {
       this.fillRingBuffer();
     }

[NoCoverage] ArithmeticOperator
src/worklet.js:152:33
   }
 
   _maybeRefillBuffer() {
-    if (this.availableSamples < this.ringBuffer.length * 0.3) {
+    if (this.availableSamples < this.ringBuffer.length / 0.3) {
       this.fillRingBuffer();
     }

[NoCoverage] BlockStatement
src/worklet.js:157:47
     }
   }
 
-  _maybeReportChunkCompletion(samplesWritten) {
-    if (samplesWritten <= 0) return;
-
-    const samplesPerChunk = sampleRate * 0.1; // Assuming 100ms chunks
-    if (this.bufferPosition > 0 && this.bufferPosition % samplesPerChunk < samplesWritten) {
-      this.port.postMessage({
-        type: 'chunk-complete',
-        data: {
-          chunkIndex: Math.floor(this.bufferPosition / samplesPerChunk),
-          timestamp: currentTime
-        }
-      });
-    }
-
-    this.bufferPosition += samplesWritten;
-  }
+  _maybeReportChunkCompletion(samplesWritten) {}
 
   _maybeReportPlaybackEnded(wasPlaying) {

[NoCoverage] ConditionalExpression
src/worklet.js:158:9
   }
 
   _maybeReportChunkCompletion(samplesWritten) {
-    if (samplesWritten <= 0) return;
+    if (false) return;
 
     const samplesPerChunk = sampleRate * 0.1; // Assuming 100ms chunks

[NoCoverage] ConditionalExpression
src/worklet.js:158:9
   }
 
   _maybeReportChunkCompletion(samplesWritten) {
-    if (samplesWritten <= 0) return;
+    if (true) return;
 
     const samplesPerChunk = sampleRate * 0.1; // Assuming 100ms chunks

[NoCoverage] StringLiteral
src/worklet.js:163:15
     const samplesPerChunk = sampleRate * 0.1; // Assuming 100ms chunks
     if (this.bufferPosition > 0 && this.bufferPosition % samplesPerChunk < samplesWritten) {
       this.port.postMessage({
-        type: 'chunk-complete',
+        type: "",
         data: {
           chunkIndex: Math.floor(this.bufferPosition / samplesPerChunk),

[NoCoverage] ObjectLiteral
src/worklet.js:164:15
     if (this.bufferPosition > 0 && this.bufferPosition % samplesPerChunk < samplesWritten) {
       this.port.postMessage({
         type: 'chunk-complete',
-        data: {
-          chunkIndex: Math.floor(this.bufferPosition / samplesPerChunk),
-          timestamp: currentTime
-        }
+        data: {}
       });
     }

[NoCoverage] BlockStatement
src/worklet.js:174:41
     this.bufferPosition += samplesWritten;
   }
 
-  _maybeReportPlaybackEnded(wasPlaying) {
-    if (wasPlaying && this.availableSamples === 0 && this.audioQueue.length === 0) {
-      this.isPlaying = false;
-      this.port.postMessage({ type: 'playback-ended' });
-    }
-  }
+  _maybeReportPlaybackEnded(wasPlaying) {}
 
   _maybeReportUnderrun(samplesWritten, framesToProcess) {

[NoCoverage] BlockStatement
src/worklet.js:175:84
   }
 
   _maybeReportPlaybackEnded(wasPlaying) {
-    if (wasPlaying && this.availableSamples === 0 && this.audioQueue.length === 0) {
-      this.isPlaying = false;
-      this.port.postMessage({ type: 'playback-ended' });
-    }
+    if (wasPlaying && this.availableSamples === 0 && this.audioQueue.length === 0) {}
   }
 

[NoCoverage] ConditionalExpression
src/worklet.js:175:9
   }
 
   _maybeReportPlaybackEnded(wasPlaying) {
-    if (wasPlaying && this.availableSamples === 0 && this.audioQueue.length === 0) {
+    if (false) {
       this.isPlaying = false;
       this.port.postMessage({ type: 'playback-ended' });

[NoCoverage] ObjectLiteral
src/worklet.js:177:29
   _maybeReportPlaybackEnded(wasPlaying) {
     if (wasPlaying && this.availableSamples === 0 && this.audioQueue.length === 0) {
       this.isPlaying = false;
-      this.port.postMessage({ type: 'playback-ended' });
+      this.port.postMessage({});
     }
   }

[NoCoverage] EqualityOperator
src/worklet.js:182:9
   }
 
   _maybeReportUnderrun(samplesWritten, framesToProcess) {
-    if (samplesWritten < framesToProcess && this.isPlaying) {
+    if (samplesWritten <= framesToProcess && this.isPlaying) {
       this.port.postMessage({
         type: 'buffer-underrun',

[NoCoverage] ObjectLiteral
src/worklet.js:183:29
 
   _maybeReportUnderrun(samplesWritten, framesToProcess) {
     if (samplesWritten < framesToProcess && this.isPlaying) {
-      this.port.postMessage({
-        type: 'buffer-underrun',
-        data: { requested: framesToProcess, available: samplesWritten }
-      });
+      this.port.postMessage({});
     }
   }

[NoCoverage] ObjectLiteral
src/worklet.js:185:15
     if (samplesWritten < framesToProcess && this.isPlaying) {
       this.port.postMessage({
         type: 'buffer-underrun',
-        data: { requested: framesToProcess, available: samplesWritten }
+        data: {}
       });
     }
