[Killed] LogicalOperator
src/tts.js:25:9
   }
 
   initializeWebSpeech() {
-    if ('speechSynthesis' in window && speechSynthesis) {
+    if ('speechSynthesis' in window || speechSynthesis) {
       // Load voices
       this.loadVoices();
killedBy: TTSModule speakWithKokoro should throw error when no TTS system available
statusReason: ReferenceError: speechSynthesis is not defined

[Killed] ConditionalExpression
src/tts.js:40:26
     if (!('speechSynthesis' in window) || !speechSynthesis) return;
     
     const voices = speechSynthesis.getVoices();
-    const voiceSelect = (typeof document !== 'undefined' && typeof document.getElementById === 'function')
+    const voiceSelect = (false)
       ? document.getElementById('tts-voice')
       : null;
killedBy: TTSModule - Comprehensive Coverage loadVoices should load voices and populate voice selector
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

[Killed] ConditionalExpression
src/tts.js:65:20
         // Append option in a safe manner depending on what's available on the mocked element
         if (typeof voiceSelect.appendChild === 'function') {
           voiceSelect.appendChild(option);
-        } else if (typeof voiceSelect.append === 'function') {
+        } else if (false) {
           try { voiceSelect.append(option); } catch { /* ignore */ }
         } else {
killedBy: TTSModule - Comprehensive Coverage Additional Tests should call onProgress during kokoro initialization
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"percentage": 50, "text": "Loading Kokoro model: 50%"}
Received
       1
          Object {
        -   "percentage": 50,
        -   "text": "Loading Kokoro model: 50%",

[Killed] ConditionalExpression
src/tts.js:108:9
     onProgress?.({ percentage: 0, text: 'Loading Kokoro TTS model...' });
     
     // Check for WebGPU availability first
-    if (!navigator.gpu) {
+    if (false) {
       throw new Error('WebGPU not available');
     }
killedBy: TTSModule - Comprehensive Coverage TTSModule state and configuration isKokoroAvailable should return true after initialization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] OptionalChaining
src/tts.js:119:43
       dtype: "fp32",
       device: "webgpu",
       progress_callback: (item) => {
-        if (item.status === "progress" && item.file?.endsWith?.("onnx")) {
+        if (item.status === "progress" && item.file?.endsWith("onnx")) {
           const progress = Math.round(item.progress * 100);
           onProgress?.({ percentage: progress, text: `Loading Kokoro model: ${progress}%` });
killedBy: TTSModule - Comprehensive Coverage Additional Tests should call onProgress during kokoro initialization
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"percentage": 50, "text": "Loading Kokoro model: 50%"}
Received
       1
          Object {
        -   "percentage": 50,
        -   "text": "Loading Kokoro model: 50%",
