[Killed] EqualityOperator
src/utils/text-processing.js:15:11
     if (currentChunk.join(' ').length + word.length + 1 <= chunkSize) {
       currentChunk.push(word);
     } else {
-      if (currentChunk.length > 0) {
+      if (currentChunk.length <= 0) {
         chunks.push(currentChunk.join(' '));
         currentChunk = [word];
killedBy: Text Processing Utilities splitTextIntoChunks should handle single word longer than chunk size
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
+   "",
    "supercalifragilisticexpialidocious",
