[NoCoverage] BlockStatement
src/app.js:6:17
 import { AudioModule } from './audio.js';
 
 class AppController {
-  constructor() {
-    this.llm = new LLMModule();
-    this.tts = new TTSModule();
-    this.audio = new AudioModule();
-    
-    this.currentTab = 'llm-stream';
-    this.isGenerating = false;
-    this.isSpeaking = false;
-    
-    this.initializeUI();
-    this.setupEventListeners();
-    this.detectDevice();
-  }
+  constructor() {}
 
   async detectDevice() {

[NoCoverage] BooleanLiteral
src/app.js:12:25
     this.audio = new AudioModule();
     
     this.currentTab = 'llm-stream';
-    this.isGenerating = false;
+    this.isGenerating = true;
     this.isSpeaking = false;
     

[NoCoverage] BooleanLiteral
src/app.js:13:23
     
     this.currentTab = 'llm-stream';
     this.isGenerating = false;
-    this.isSpeaking = false;
+    this.isSpeaking = true;
     
     this.initializeUI();

[NoCoverage] BlockStatement
src/app.js:20:24
     this.detectDevice();
   }
 
-  async detectDevice() {
-    const deviceStatus = document.getElementById('device-status');
-    const hasWebGPU = navigator.gpu !== undefined;
-    
-    if (hasWebGPU) {
-      try {
-        const adapter = await navigator.gpu.requestAdapter();
-        if (adapter) {
-          deviceStatus.textContent = 'webgpu';
-          deviceStatus.className = 'text-green-600';
-        } else {
-          deviceStatus.textContent = 'wasm (webgpu unavailable)';
-          deviceStatus.className = 'text-orange-600';
-        }
-      } catch {
-        deviceStatus.textContent = 'wasm (webgpu error)';
-        deviceStatus.className = 'text-orange-600';
-      }
-    } else {
-      deviceStatus.textContent = 'wasm (webgpu unsupported)';
-      deviceStatus.className = 'text-orange-600';
-    }
-  }
+  async detectDevice() {}
 
   initializeUI() {

[NoCoverage] StringLiteral
src/app.js:21:50
   }
 
   async detectDevice() {
-    const deviceStatus = document.getElementById('device-status');
+    const deviceStatus = document.getElementById("");
     const hasWebGPU = navigator.gpu !== undefined;
     

[NoCoverage] ConditionalExpression
src/app.js:22:23
 
   async detectDevice() {
     const deviceStatus = document.getElementById('device-status');
-    const hasWebGPU = navigator.gpu !== undefined;
+    const hasWebGPU = true;
     
     if (hasWebGPU) {

[NoCoverage] EqualityOperator
src/app.js:22:23
 
   async detectDevice() {
     const deviceStatus = document.getElementById('device-status');
-    const hasWebGPU = navigator.gpu !== undefined;
+    const hasWebGPU = navigator.gpu === undefined;
     
     if (hasWebGPU) {

[NoCoverage] BlockStatement
src/app.js:24:20
     const deviceStatus = document.getElementById('device-status');
     const hasWebGPU = navigator.gpu !== undefined;
     
-    if (hasWebGPU) {
-      try {
-        const adapter = await navigator.gpu.requestAdapter();
-        if (adapter) {
-          deviceStatus.textContent = 'webgpu';
-          deviceStatus.className = 'text-green-600';
-        } else {
-          deviceStatus.textContent = 'wasm (webgpu unavailable)';
-          deviceStatus.className = 'text-orange-600';
-        }
-      } catch {
-        deviceStatus.textContent = 'wasm (webgpu error)';
-        deviceStatus.className = 'text-orange-600';
-      }
-    } else {
+    if (hasWebGPU) {} else {
       deviceStatus.textContent = 'wasm (webgpu unsupported)';
       deviceStatus.className = 'text-orange-600';

[NoCoverage] ConditionalExpression
src/app.js:24:9
     const deviceStatus = document.getElementById('device-status');
     const hasWebGPU = navigator.gpu !== undefined;
     
-    if (hasWebGPU) {
+    if (true) {
       try {
         const adapter = await navigator.gpu.requestAdapter();

[NoCoverage] BlockStatement
src/app.js:25:11
     const hasWebGPU = navigator.gpu !== undefined;
     
     if (hasWebGPU) {
-      try {
-        const adapter = await navigator.gpu.requestAdapter();
-        if (adapter) {
-          deviceStatus.textContent = 'webgpu';
-          deviceStatus.className = 'text-green-600';
-        } else {
-          deviceStatus.textContent = 'wasm (webgpu unavailable)';
-          deviceStatus.className = 'text-orange-600';
-        }
-      } catch {
+      try {} catch {
         deviceStatus.textContent = 'wasm (webgpu error)';
         deviceStatus.className = 'text-orange-600';

[NoCoverage] BlockStatement
src/app.js:27:22
     if (hasWebGPU) {
       try {
         const adapter = await navigator.gpu.requestAdapter();
-        if (adapter) {
-          deviceStatus.textContent = 'webgpu';
-          deviceStatus.className = 'text-green-600';
-        } else {
+        if (adapter) {} else {
           deviceStatus.textContent = 'wasm (webgpu unavailable)';
           deviceStatus.className = 'text-orange-600';

[NoCoverage] ConditionalExpression
src/app.js:27:13
     if (hasWebGPU) {
       try {
         const adapter = await navigator.gpu.requestAdapter();
-        if (adapter) {
+        if (true) {
           deviceStatus.textContent = 'webgpu';
           deviceStatus.className = 'text-green-600';

[NoCoverage] BlockStatement
src/app.js:30:16
         if (adapter) {
           deviceStatus.textContent = 'webgpu';
           deviceStatus.className = 'text-green-600';
-        } else {
-          deviceStatus.textContent = 'wasm (webgpu unavailable)';
-          deviceStatus.className = 'text-orange-600';
-        }
+        } else {}
       } catch {
         deviceStatus.textContent = 'wasm (webgpu error)';

[NoCoverage] StringLiteral
src/app.js:31:38
           deviceStatus.textContent = 'webgpu';
           deviceStatus.className = 'text-green-600';
         } else {
-          deviceStatus.textContent = 'wasm (webgpu unavailable)';
+          deviceStatus.textContent = "";
           deviceStatus.className = 'text-orange-600';
         }

[NoCoverage] BlockStatement
src/app.js:34:15
           deviceStatus.textContent = 'wasm (webgpu unavailable)';
           deviceStatus.className = 'text-orange-600';
         }
-      } catch {
-        deviceStatus.textContent = 'wasm (webgpu error)';
-        deviceStatus.className = 'text-orange-600';
-      }
+      } catch {}
     } else {
       deviceStatus.textContent = 'wasm (webgpu unsupported)';

[NoCoverage] BlockStatement
src/app.js:38:12
         deviceStatus.textContent = 'wasm (webgpu error)';
         deviceStatus.className = 'text-orange-600';
       }
-    } else {
-      deviceStatus.textContent = 'wasm (webgpu unsupported)';
-      deviceStatus.className = 'text-orange-600';
-    }
+    } else {}
   }
 

[NoCoverage] BlockStatement
src/app.js:44:18
     }
   }
 
-  initializeUI() {
-    // Initialize tab switching
-    this.switchTab('llm-stream');
-    
-    // Initialize TTS controls
-    this.updateTTSControls();
-    
-    // Hide loading progress initially
-    document.getElementById('loading-progress').classList.add('hidden');
-  }
+  initializeUI() {}
 
   setupEventListeners() {

[NoCoverage] StringLiteral
src/app.js:52:29
     this.updateTTSControls();
     
     // Hide loading progress initially
-    document.getElementById('loading-progress').classList.add('hidden');
+    document.getElementById("").classList.add('hidden');
   }
 

[NoCoverage] BlockStatement
src/app.js:57:58
 
   setupEventListeners() {
     // Tab switching
-    document.querySelectorAll('.tab-btn').forEach(btn => {
-      btn.addEventListener('click', (e) => {
-        this.switchTab(e.target.dataset.tab);
-      });
-    });
+    document.querySelectorAll('.tab-btn').forEach(btn => {});
 
     // LLM Stream tab

[NoCoverage] StringLiteral
src/app.js:57:31
 
   setupEventListeners() {
     // Tab switching
-    document.querySelectorAll('.tab-btn').forEach(btn => {
+    document.querySelectorAll("").forEach(btn => {
       btn.addEventListener('click', (e) => {
         this.switchTab(e.target.dataset.tab);

[NoCoverage] BlockStatement
src/app.js:58:44
   setupEventListeners() {
     // Tab switching
     document.querySelectorAll('.tab-btn').forEach(btn => {
-      btn.addEventListener('click', (e) => {
-        this.switchTab(e.target.dataset.tab);
-      });
+      btn.addEventListener('click', (e) => {});
     });
 

[NoCoverage] BlockStatement
src/app.js:64:77
     });
 
     // LLM Stream tab
-    document.getElementById('generate-btn').addEventListener('click', () => {
-      this.generateText();
-    });
+    document.getElementById('generate-btn').addEventListener('click', () => {});
 
     // TTS Only tab

[NoCoverage] BlockStatement
src/app.js:69:73
     });
 
     // TTS Only tab
-    document.getElementById('tts-play').addEventListener('click', () => {
-      this.playTTS();
-    });
+    document.getElementById('tts-play').addEventListener('click', () => {});
     document.getElementById('tts-pause').addEventListener('click', () => {
       this.pauseTTS();

[NoCoverage] BlockStatement
src/app.js:72:74
     document.getElementById('tts-play').addEventListener('click', () => {
       this.playTTS();
     });
-    document.getElementById('tts-pause').addEventListener('click', () => {
-      this.pauseTTS();
-    });
+    document.getElementById('tts-pause').addEventListener('click', () => {});
     document.getElementById('tts-resume').addEventListener('click', () => {
       this.resumeTTS();

[NoCoverage] StringLiteral
src/app.js:72:59
     document.getElementById('tts-play').addEventListener('click', () => {
       this.playTTS();
     });
-    document.getElementById('tts-pause').addEventListener('click', () => {
+    document.getElementById('tts-pause').addEventListener("", () => {
       this.pauseTTS();
     });

[NoCoverage] BlockStatement
src/app.js:75:75
     document.getElementById('tts-pause').addEventListener('click', () => {
       this.pauseTTS();
     });
-    document.getElementById('tts-resume').addEventListener('click', () => {
-      this.resumeTTS();
-    });
+    document.getElementById('tts-resume').addEventListener('click', () => {});
     document.getElementById('tts-stop').addEventListener('click', () => {
       this.stopTTS();

[NoCoverage] StringLiteral
src/app.js:75:29
     document.getElementById('tts-pause').addEventListener('click', () => {
       this.pauseTTS();
     });
-    document.getElementById('tts-resume').addEventListener('click', () => {
+    document.getElementById("").addEventListener('click', () => {
       this.resumeTTS();
     });

[NoCoverage] BlockStatement
src/app.js:78:73
     document.getElementById('tts-resume').addEventListener('click', () => {
       this.resumeTTS();
     });
-    document.getElementById('tts-stop').addEventListener('click', () => {
-      this.stopTTS();
-    });
+    document.getElementById('tts-stop').addEventListener('click', () => {});
 
     // TTS controls

[NoCoverage] BlockStatement
src/app.js:83:74
     });
 
     // TTS controls
-    document.getElementById('tts-rate').addEventListener('input', (e) => {
-      document.getElementById('rate-value').textContent = e.target.value;
-      this.tts.setRate(parseFloat(e.target.value));
-    });
+    document.getElementById('tts-rate').addEventListener('input', (e) => {});
     document.getElementById('tts-pitch').addEventListener('input', (e) => {
       document.getElementById('pitch-value').textContent = e.target.value;

[NoCoverage] StringLiteral
src/app.js:83:58
     });
 
     // TTS controls
-    document.getElementById('tts-rate').addEventListener('input', (e) => {
+    document.getElementById('tts-rate').addEventListener("", (e) => {
       document.getElementById('rate-value').textContent = e.target.value;
       this.tts.setRate(parseFloat(e.target.value));

[NoCoverage] BlockStatement
src/app.js:87:75
       document.getElementById('rate-value').textContent = e.target.value;
       this.tts.setRate(parseFloat(e.target.value));
     });
-    document.getElementById('tts-pitch').addEventListener('input', (e) => {
-      document.getElementById('pitch-value').textContent = e.target.value;
-      this.tts.setPitch(parseFloat(e.target.value));
-    });
+    document.getElementById('tts-pitch').addEventListener('input', (e) => {});
     document.getElementById('tts-voice').addEventListener('change', (e) => {
       this.tts.setVoice(e.target.value);

[NoCoverage] BlockStatement
src/app.js:91:76
       document.getElementById('pitch-value').textContent = e.target.value;
       this.tts.setPitch(parseFloat(e.target.value));
     });
-    document.getElementById('tts-voice').addEventListener('change', (e) => {
-      this.tts.setVoice(e.target.value);
-    });
+    document.getElementById('tts-voice').addEventListener('change', (e) => {});
 
     // LLM → TTS tab

[NoCoverage] StringLiteral
src/app.js:91:29
       document.getElementById('pitch-value').textContent = e.target.value;
       this.tts.setPitch(parseFloat(e.target.value));
     });
-    document.getElementById('tts-voice').addEventListener('change', (e) => {
+    document.getElementById("").addEventListener('change', (e) => {
       this.tts.setVoice(e.target.value);
     });

[NoCoverage] BlockStatement
src/app.js:96:83
     });
 
     // LLM → TTS tab
-    document.getElementById('generate-speak-btn').addEventListener('click', () => {
-      this.generateAndSpeak();
-    });
+    document.getElementById('generate-speak-btn').addEventListener('click', () => {});
     document.getElementById('combined-pause').addEventListener('click', () => {
       this.pauseTTS();

[NoCoverage] BlockStatement
src/app.js:99:79
     document.getElementById('generate-speak-btn').addEventListener('click', () => {
       this.generateAndSpeak();
     });
-    document.getElementById('combined-pause').addEventListener('click', () => {
-      this.pauseTTS();
-    });
+    document.getElementById('combined-pause').addEventListener('click', () => {});
     document.getElementById('combined-stop').addEventListener('click', () => {
       this.stopTTS();

[NoCoverage] StringLiteral
src/app.js:99:64
     document.getElementById('generate-speak-btn').addEventListener('click', () => {
       this.generateAndSpeak();
     });
-    document.getElementById('combined-pause').addEventListener('click', () => {
+    document.getElementById('combined-pause').addEventListener("", () => {
       this.pauseTTS();
     });

[NoCoverage] BlockStatement
src/app.js:102:78
     document.getElementById('combined-pause').addEventListener('click', () => {
       this.pauseTTS();
     });
-    document.getElementById('combined-stop').addEventListener('click', () => {
-      this.stopTTS();
-    });
+    document.getElementById('combined-stop').addEventListener('click', () => {});
 
     // Audio module events

[NoCoverage] StringLiteral
src/app.js:102:29
     document.getElementById('combined-pause').addEventListener('click', () => {
       this.pauseTTS();
     });
-    document.getElementById('combined-stop').addEventListener('click', () => {
+    document.getElementById("").addEventListener('click', () => {
       this.stopTTS();
     });

[NoCoverage] BlockStatement
src/app.js:107:61
     });
 
     // Audio module events
-    this.audio.addEventListener('chunk-complete', (data) => {
-      this.tts.markSentenceSpoken(data.sentenceIndex);
-    });
+    this.audio.addEventListener('chunk-complete', (data) => {});
     this.audio.addEventListener('playback-ended', () => {
       this.isSpeaking = false;

[NoCoverage] BlockStatement
src/app.js:110:57
     this.audio.addEventListener('chunk-complete', (data) => {
       this.tts.markSentenceSpoken(data.sentenceIndex);
     });
-    this.audio.addEventListener('playback-ended', () => {
-      this.isSpeaking = false;
-      this.updateTTSControls();
-    });
+    this.audio.addEventListener('playback-ended', () => {});
   }
 

[NoCoverage] BooleanLiteral
src/app.js:111:25
       this.tts.markSentenceSpoken(data.sentenceIndex);
     });
     this.audio.addEventListener('playback-ended', () => {
-      this.isSpeaking = false;
+      this.isSpeaking = true;
       this.updateTTSControls();
     });

[NoCoverage] BlockStatement
src/app.js:116:22
     });
   }
 
-  switchTab(tabName) {
-    // Update tab buttons
-    document.querySelectorAll('.tab-btn').forEach(btn => {
-      btn.classList.remove('active', 'bg-indigo-600', 'text-white');
-      btn.classList.add('bg-gray-200', 'text-gray-700');
-    });
-    document.querySelector(`[data-tab="${tabName}"]`).classList.add('active', 'bg-indigo-600', 'text-white');
-    document.querySelector(`[data-tab="${tabName}"]`).classList.remove('bg-gray-200', 'text-gray-700');
-
-    // Update tab content
-    document.querySelectorAll('.tab-content').forEach(content => {
-      content.classList.remove('active');
-    });
-    document.getElementById(tabName).classList.add('active');
-
-    this.currentTab = tabName;
-  }
+  switchTab(tabName) {}
 
   showProgress(show, text = 'Loading models...') {

[NoCoverage] BlockStatement
src/app.js:118:58
 
   switchTab(tabName) {
     // Update tab buttons
-    document.querySelectorAll('.tab-btn').forEach(btn => {
-      btn.classList.remove('active', 'bg-indigo-600', 'text-white');
-      btn.classList.add('bg-gray-200', 'text-gray-700');
-    });
+    document.querySelectorAll('.tab-btn').forEach(btn => {});
     document.querySelector(`[data-tab="${tabName}"]`).classList.add('active', 'bg-indigo-600', 'text-white');
     document.querySelector(`[data-tab="${tabName}"]`).classList.remove('bg-gray-200', 'text-gray-700');

[NoCoverage] StringLiteral
src/app.js:119:28
   switchTab(tabName) {
     // Update tab buttons
     document.querySelectorAll('.tab-btn').forEach(btn => {
-      btn.classList.remove('active', 'bg-indigo-600', 'text-white');
+      btn.classList.remove("", 'bg-indigo-600', 'text-white');
       btn.classList.add('bg-gray-200', 'text-gray-700');
     });

[NoCoverage] BlockStatement
src/app.js:126:66
     document.querySelector(`[data-tab="${tabName}"]`).classList.remove('bg-gray-200', 'text-gray-700');
 
     // Update tab content
-    document.querySelectorAll('.tab-content').forEach(content => {
-      content.classList.remove('active');
-    });
+    document.querySelectorAll('.tab-content').forEach(content => {});
     document.getElementById(tabName).classList.add('active');
 

[NoCoverage] StringLiteral
src/app.js:129:52
     document.querySelectorAll('.tab-content').forEach(content => {
       content.classList.remove('active');
     });
-    document.getElementById(tabName).classList.add('active');
+    document.getElementById(tabName).classList.add("");
 
     this.currentTab = tabName;

[NoCoverage] BlockStatement
src/app.js:134:50
     this.currentTab = tabName;
   }
 
-  showProgress(show, text = 'Loading models...') {
-    const progressContainer = document.getElementById('loading-progress');
-    const progressText = document.getElementById('loading-text');
-    
-    if (show) {
-      progressContainer.classList.remove('hidden');
-      progressText.textContent = text;
-    } else {
-      progressContainer.classList.add('hidden');
-    }
-  }
+  showProgress(show, text = 'Loading models...') {}
 
   updateProgress(percentage, text) {

[NoCoverage] StringLiteral
src/app.js:135:55
   }
 
   showProgress(show, text = 'Loading models...') {
-    const progressContainer = document.getElementById('loading-progress');
+    const progressContainer = document.getElementById("");
     const progressText = document.getElementById('loading-text');
     

[NoCoverage] StringLiteral
src/app.js:136:50
 
   showProgress(show, text = 'Loading models...') {
     const progressContainer = document.getElementById('loading-progress');
-    const progressText = document.getElementById('loading-text');
+    const progressText = document.getElementById("");
     
     if (show) {

[NoCoverage] ConditionalExpression
src/app.js:138:9
     const progressContainer = document.getElementById('loading-progress');
     const progressText = document.getElementById('loading-text');
     
-    if (show) {
+    if (true) {
       progressContainer.classList.remove('hidden');
       progressText.textContent = text;

[NoCoverage] ConditionalExpression
src/app.js:138:9
     const progressContainer = document.getElementById('loading-progress');
     const progressText = document.getElementById('loading-text');
     
-    if (show) {
+    if (false) {
       progressContainer.classList.remove('hidden');
       progressText.textContent = text;

[NoCoverage] BlockStatement
src/app.js:141:12
     if (show) {
       progressContainer.classList.remove('hidden');
       progressText.textContent = text;
-    } else {
-      progressContainer.classList.add('hidden');
-    }
+    } else {}
   }
 

[NoCoverage] BlockStatement
src/app.js:146:36
     }
   }
 
-  updateProgress(percentage, text) {
-    const progressBar = document.getElementById('progress-bar');
-    const progressText = document.getElementById('loading-text');
-    
-    progressBar.style.width = `${percentage}%`;
-    if (text) progressText.textContent = text;
-  }
+  updateProgress(percentage, text) {}
 
   async generateText() {

[NoCoverage] ConditionalExpression
src/app.js:151:9
     const progressText = document.getElementById('loading-text');
     
     progressBar.style.width = `${percentage}%`;
-    if (text) progressText.textContent = text;
+    if (false) progressText.textContent = text;
   }
 

[NoCoverage] ConditionalExpression
src/app.js:151:9
     const progressText = document.getElementById('loading-text');
     
     progressBar.style.width = `${percentage}%`;
-    if (text) progressText.textContent = text;
+    if (true) progressText.textContent = text;
   }
 

[NoCoverage] ConditionalExpression
src/app.js:155:9
   }
 
   async generateText() {
-    if (this.isGenerating) return;
+    if (false) return;
 
     const prompt = document.getElementById('llm-prompt').value.trim();

[NoCoverage] ConditionalExpression
src/app.js:155:9
   }
 
   async generateText() {
-    if (this.isGenerating) return;
+    if (true) return;
 
     const prompt = document.getElementById('llm-prompt').value.trim();

[NoCoverage] MethodExpression
src/app.js:157:20
   async generateText() {
     if (this.isGenerating) return;
 
-    const prompt = document.getElementById('llm-prompt').value.trim();
+    const prompt = document.getElementById('llm-prompt').value;
     if (!prompt) {
       this.showError('Please enter a prompt');

[NoCoverage] BlockStatement
src/app.js:158:18
     if (this.isGenerating) return;
 
     const prompt = document.getElementById('llm-prompt').value.trim();
-    if (!prompt) {
-      this.showError('Please enter a prompt');
-      return;
-    }
+    if (!prompt) {}
 
     this.isGenerating = true;

[NoCoverage] ConditionalExpression
src/app.js:158:9
     if (this.isGenerating) return;
 
     const prompt = document.getElementById('llm-prompt').value.trim();
-    if (!prompt) {
+    if (true) {
       this.showError('Please enter a prompt');
       return;

[NoCoverage] StringLiteral
src/app.js:159:22
 
     const prompt = document.getElementById('llm-prompt').value.trim();
     if (!prompt) {
-      this.showError('Please enter a prompt');
+      this.showError("");
       return;
     }

[NoCoverage] BooleanLiteral
src/app.js:163:25
       return;
     }
 
-    this.isGenerating = true;
+    this.isGenerating = false;
     const generateBtn = document.getElementById('generate-btn');
     const output = document.getElementById('llm-output');

[NoCoverage] BooleanLiteral
src/app.js:172:28
     };
 
     generateBtn.textContent = 'Generating...';
-    generateBtn.disabled = true;
+    generateBtn.disabled = false;
     output.textContent = '';
 

[NoCoverage] StringLiteral
src/app.js:173:26
 
     generateBtn.textContent = 'Generating...';
     generateBtn.disabled = true;
-    output.textContent = '';
+    output.textContent = "Stryker was here!";
 
     try {

[NoCoverage] BooleanLiteral
src/app.js:176:25
     output.textContent = '';
 
     try {
-      this.showProgress(true, 'Loading LLM model...');
+      this.showProgress(false, 'Loading LLM model...');
       
       let startTime = Date.now();

[NoCoverage] BlockStatement
src/app.js:183:29
       let tokenCount = 0;
 
       await this.llm.generate(prompt, {
-        onToken: (token) => {
-          if (!firstTokenTime) {
-            firstTokenTime = Date.now();
-            const ttfb = firstTokenTime - startTime;
-            statsEl.ttfb.textContent = `TTFB: ${ttfb}ms`;
-          }
-          
-          tokenCount++;
-          output.textContent += token;
-          output.scrollTop = output.scrollHeight;
-          
-          // Update tokens per second
-          if (firstTokenTime) {
-            const elapsed = (Date.now() - firstTokenTime) / 1000;
-            const tokensPerSec = elapsed > 0 ? (tokenCount / elapsed).toFixed(1) : '0';
-            statsEl.tokensPerSec.textContent = `Tokens/s: ${tokensPerSec}`;
-          }
-        },
+        onToken: (token) => {},
         onProgress: (progress) => {
           this.updateProgress(progress.percentage, progress.text);

[NoCoverage] BooleanLiteral
src/app.js:184:15
 
       await this.llm.generate(prompt, {
         onToken: (token) => {
-          if (!firstTokenTime) {
+          if (firstTokenTime) {
             firstTokenTime = Date.now();
             const ttfb = firstTokenTime - startTime;

[NoCoverage] BlockStatement
src/app.js:184:32
 
       await this.llm.generate(prompt, {
         onToken: (token) => {
-          if (!firstTokenTime) {
-            firstTokenTime = Date.now();
-            const ttfb = firstTokenTime - startTime;
-            statsEl.ttfb.textContent = `TTFB: ${ttfb}ms`;
-          }
+          if (!firstTokenTime) {}
           
           tokenCount++;

[NoCoverage] ArithmeticOperator
src/app.js:186:26
         onToken: (token) => {
           if (!firstTokenTime) {
             firstTokenTime = Date.now();
-            const ttfb = firstTokenTime - startTime;
+            const ttfb = firstTokenTime + startTime;
             statsEl.ttfb.textContent = `TTFB: ${ttfb}ms`;
           }

[NoCoverage] UpdateOperator
src/app.js:190:11
             statsEl.ttfb.textContent = `TTFB: ${ttfb}ms`;
           }
           
-          tokenCount++;
+          tokenCount--;
           output.textContent += token;
           output.scrollTop = output.scrollHeight;

[NoCoverage] AssignmentOperator
src/app.js:191:11
           }
           
           tokenCount++;
-          output.textContent += token;
+          output.textContent -= token;
           output.scrollTop = output.scrollHeight;
           

[NoCoverage] ConditionalExpression
src/app.js:195:15
           output.scrollTop = output.scrollHeight;
           
           // Update tokens per second
-          if (firstTokenTime) {
+          if (true) {
             const elapsed = (Date.now() - firstTokenTime) / 1000;
             const tokensPerSec = elapsed > 0 ? (tokenCount / elapsed).toFixed(1) : '0';

[NoCoverage] ConditionalExpression
src/app.js:195:15
           output.scrollTop = output.scrollHeight;
           
           // Update tokens per second
-          if (firstTokenTime) {
+          if (false) {
             const elapsed = (Date.now() - firstTokenTime) / 1000;
             const tokensPerSec = elapsed > 0 ? (tokenCount / elapsed).toFixed(1) : '0';

[NoCoverage] ArithmeticOperator
src/app.js:196:29
           
           // Update tokens per second
           if (firstTokenTime) {
-            const elapsed = (Date.now() - firstTokenTime) / 1000;
+            const elapsed = (Date.now() - firstTokenTime) * 1000;
             const tokensPerSec = elapsed > 0 ? (tokenCount / elapsed).toFixed(1) : '0';
             statsEl.tokensPerSec.textContent = `Tokens/s: ${tokensPerSec}`;

[NoCoverage] ArithmeticOperator
src/app.js:196:30
           
           // Update tokens per second
           if (firstTokenTime) {
-            const elapsed = (Date.now() - firstTokenTime) / 1000;
+            const elapsed = (Date.now() + firstTokenTime) / 1000;
             const tokensPerSec = elapsed > 0 ? (tokenCount / elapsed).toFixed(1) : '0';
             statsEl.tokensPerSec.textContent = `Tokens/s: ${tokensPerSec}`;

[NoCoverage] ConditionalExpression
src/app.js:197:34
           // Update tokens per second
           if (firstTokenTime) {
             const elapsed = (Date.now() - firstTokenTime) / 1000;
-            const tokensPerSec = elapsed > 0 ? (tokenCount / elapsed).toFixed(1) : '0';
+            const tokensPerSec = true ? (tokenCount / elapsed).toFixed(1) : '0';
             statsEl.tokensPerSec.textContent = `Tokens/s: ${tokensPerSec}`;
           }

[NoCoverage] EqualityOperator
src/app.js:197:34
           // Update tokens per second
           if (firstTokenTime) {
             const elapsed = (Date.now() - firstTokenTime) / 1000;
-            const tokensPerSec = elapsed > 0 ? (tokenCount / elapsed).toFixed(1) : '0';
+            const tokensPerSec = elapsed >= 0 ? (tokenCount / elapsed).toFixed(1) : '0';
             statsEl.tokensPerSec.textContent = `Tokens/s: ${tokensPerSec}`;
           }

[NoCoverage] StringLiteral
src/app.js:198:48
           if (firstTokenTime) {
             const elapsed = (Date.now() - firstTokenTime) / 1000;
             const tokensPerSec = elapsed > 0 ? (tokenCount / elapsed).toFixed(1) : '0';
-            statsEl.tokensPerSec.textContent = `Tokens/s: ${tokensPerSec}`;
+            statsEl.tokensPerSec.textContent = ``;
           }
         },

[NoCoverage] BlockStatement
src/app.js:201:35
             statsEl.tokensPerSec.textContent = `Tokens/s: ${tokensPerSec}`;
           }
         },
-        onProgress: (progress) => {
-          this.updateProgress(progress.percentage, progress.text);
-        }
+        onProgress: (progress) => {}
       });
 
