[NoCoverage] StringLiteral
src/app.js:206:31
         }
       });
 
-      document.getElementById('llm-status').textContent = 'loaded';
+      document.getElementById("").textContent = 'loaded';
       document.getElementById('llm-status').className = 'text-green-600';
       

[NoCoverage] StringLiteral
src/app.js:207:57
       });
 
       document.getElementById('llm-status').textContent = 'loaded';
-      document.getElementById('llm-status').className = 'text-green-600';
+      document.getElementById('llm-status').className = "";
       
     } catch (error) {

[NoCoverage] BlockStatement
src/app.js:209:21
       document.getElementById('llm-status').textContent = 'loaded';
       document.getElementById('llm-status').className = 'text-green-600';
       
-    } catch (error) {
-      this.showError(`Generation failed: ${error.message}`);
-      console.error('Generation error:', error);
-    } finally {
+    } catch (error) {} finally {
       this.isGenerating = false;
       generateBtn.textContent = 'Generate';

[NoCoverage] BlockStatement
src/app.js:212:15
     } catch (error) {
       this.showError(`Generation failed: ${error.message}`);
       console.error('Generation error:', error);
-    } finally {
-      this.isGenerating = false;
-      generateBtn.textContent = 'Generate';
-      generateBtn.disabled = false;
-      this.showProgress(false);
-    }
+    } finally {}
   }
 

[NoCoverage] BooleanLiteral
src/app.js:213:27
       this.showError(`Generation failed: ${error.message}`);
       console.error('Generation error:', error);
     } finally {
-      this.isGenerating = false;
+      this.isGenerating = true;
       generateBtn.textContent = 'Generate';
       generateBtn.disabled = false;

[NoCoverage] BooleanLiteral
src/app.js:215:30
     } finally {
       this.isGenerating = false;
       generateBtn.textContent = 'Generate';
-      generateBtn.disabled = false;
+      generateBtn.disabled = true;
       this.showProgress(false);
     }

[NoCoverage] BooleanLiteral
src/app.js:216:25
       this.isGenerating = false;
       generateBtn.textContent = 'Generate';
       generateBtn.disabled = false;
-      this.showProgress(false);
+      this.showProgress(true);
     }
   }

[NoCoverage] MethodExpression
src/app.js:221:18
   }
 
   async playTTS() {
-    const text = document.getElementById('tts-text').value.trim();
+    const text = document.getElementById('tts-text').value;
     if (!text) {
       this.showError('Please enter text to speak');

[NoCoverage] BlockStatement
src/app.js:222:16
 
   async playTTS() {
     const text = document.getElementById('tts-text').value.trim();
-    if (!text) {
-      this.showError('Please enter text to speak');
-      return;
-    }
+    if (!text) {}
 
     if (this.isSpeaking) {

[NoCoverage] ConditionalExpression
src/app.js:222:9
 
   async playTTS() {
     const text = document.getElementById('tts-text').value.trim();
-    if (!text) {
+    if (true) {
       this.showError('Please enter text to speak');
       return;

[NoCoverage] ConditionalExpression
src/app.js:227:9
       return;
     }
 
-    if (this.isSpeaking) {
+    if (false) {
       this.stopTTS();
     }

[NoCoverage] ConditionalExpression
src/app.js:227:9
       return;
     }
 
-    if (this.isSpeaking) {
+    if (true) {
       this.stopTTS();
     }

[NoCoverage] BlockStatement
src/app.js:231:9
       this.stopTTS();
     }
 
-    try {
-      this.showProgress(true, 'Loading TTS model...');
-      this.isSpeaking = true;
-      this.updateTTSControls();
-
-      const outputEl = document.getElementById('tts-output');
-      outputEl.innerHTML = '';
-
-      await this.tts.speak(text, {
-        outputElement: outputEl,
-        audioModule: this.audio,
-        onProgress: (progress) => {
-          this.updateProgress(progress.percentage, progress.text);
-        }
-      });
-
-      document.getElementById('tts-status').textContent = 'loaded';
-      document.getElementById('tts-status').className = 'text-blue-600';
-
-    } catch (error) {
+    try {} catch (error) {
       this.showError(`TTS failed: ${error.message}`);
       console.error('TTS error:', error);

[NoCoverage] BooleanLiteral
src/app.js:232:25
     }
 
     try {
-      this.showProgress(true, 'Loading TTS model...');
+      this.showProgress(false, 'Loading TTS model...');
       this.isSpeaking = true;
       this.updateTTSControls();

[NoCoverage] BooleanLiteral
src/app.js:233:25
 
     try {
       this.showProgress(true, 'Loading TTS model...');
-      this.isSpeaking = true;
+      this.isSpeaking = false;
       this.updateTTSControls();
 

[NoCoverage] BlockStatement
src/app.js:242:35
       await this.tts.speak(text, {
         outputElement: outputEl,
         audioModule: this.audio,
-        onProgress: (progress) => {
-          this.updateProgress(progress.percentage, progress.text);
-        }
+        onProgress: (progress) => {}
       });
 

[NoCoverage] StringLiteral
src/app.js:248:57
       });
 
       document.getElementById('tts-status').textContent = 'loaded';
-      document.getElementById('tts-status').className = 'text-blue-600';
+      document.getElementById('tts-status').className = "";
 
     } catch (error) {

[NoCoverage] BlockStatement
src/app.js:250:21
       document.getElementById('tts-status').textContent = 'loaded';
       document.getElementById('tts-status').className = 'text-blue-600';
 
-    } catch (error) {
-      this.showError(`TTS failed: ${error.message}`);
-      console.error('TTS error:', error);
-      this.isSpeaking = false;
-      this.updateTTSControls();
-    } finally {
+    } catch (error) {} finally {
       this.showProgress(false);
     }

[NoCoverage] StringLiteral
src/app.js:252:21
 
     } catch (error) {
       this.showError(`TTS failed: ${error.message}`);
-      console.error('TTS error:', error);
+      console.error("", error);
       this.isSpeaking = false;
       this.updateTTSControls();

[NoCoverage] BooleanLiteral
src/app.js:253:25
     } catch (error) {
       this.showError(`TTS failed: ${error.message}`);
       console.error('TTS error:', error);
-      this.isSpeaking = false;
+      this.isSpeaking = true;
       this.updateTTSControls();
     } finally {

[NoCoverage] BlockStatement
src/app.js:255:15
       console.error('TTS error:', error);
       this.isSpeaking = false;
       this.updateTTSControls();
-    } finally {
-      this.showProgress(false);
-    }
+    } finally {}
   }
 

[NoCoverage] BooleanLiteral
src/app.js:256:25
       this.isSpeaking = false;
       this.updateTTSControls();
     } finally {
-      this.showProgress(false);
+      this.showProgress(true);
     }
   }

[NoCoverage] BlockStatement
src/app.js:260:14
     }
   }
 
-  pauseTTS() {
-    this.tts.pause();
-    this.audio.pause();
-  }
+  pauseTTS() {}
 
   resumeTTS() {

[NoCoverage] BlockStatement
src/app.js:265:15
     this.audio.pause();
   }
 
-  resumeTTS() {
-    this.tts.resume();
-    this.audio.resume();
-  }
+  resumeTTS() {}
 
   stopTTS() {

[NoCoverage] BlockStatement
src/app.js:270:13
     this.audio.resume();
   }
 
-  stopTTS() {
-    this.tts.stop();
-    this.audio.stop();
-    this.isSpeaking = false;
-    this.updateTTSControls();
-  }
+  stopTTS() {}
 
   async generateAndSpeak() {

[NoCoverage] BooleanLiteral
src/app.js:273:23
   stopTTS() {
     this.tts.stop();
     this.audio.stop();
-    this.isSpeaking = false;
+    this.isSpeaking = true;
     this.updateTTSControls();
   }

[NoCoverage] MethodExpression
src/app.js:278:20
   }
 
   async generateAndSpeak() {
-    const prompt = document.getElementById('combined-prompt').value.trim();
+    const prompt = document.getElementById('combined-prompt').value;
     if (!prompt) {
       this.showError('Please enter a prompt');

[NoCoverage] BooleanLiteral
src/app.js:279:9
 
   async generateAndSpeak() {
     const prompt = document.getElementById('combined-prompt').value.trim();
-    if (!prompt) {
+    if (prompt) {
       this.showError('Please enter a prompt');
       return;

[NoCoverage] BlockStatement
src/app.js:279:18
 
   async generateAndSpeak() {
     const prompt = document.getElementById('combined-prompt').value.trim();
-    if (!prompt) {
-      this.showError('Please enter a prompt');
-      return;
-    }
+    if (!prompt) {}
 
     if (this.isGenerating || this.isSpeaking) return;

[NoCoverage] ConditionalExpression
src/app.js:284:9
       return;
     }
 
-    if (this.isGenerating || this.isSpeaking) return;
+    if (true) return;
 
     this.isGenerating = true;

[NoCoverage] ConditionalExpression
src/app.js:284:9
       return;
     }
 
-    if (this.isGenerating || this.isSpeaking) return;
+    if (false) return;
 
     this.isGenerating = true;

[NoCoverage] StringLiteral
src/app.js:287:49
     if (this.isGenerating || this.isSpeaking) return;
 
     this.isGenerating = true;
-    const generateBtn = document.getElementById('generate-speak-btn');
+    const generateBtn = document.getElementById("");
     const output = document.getElementById('combined-output');
 

[NoCoverage] StringLiteral
src/app.js:288:44
 
     this.isGenerating = true;
     const generateBtn = document.getElementById('generate-speak-btn');
-    const output = document.getElementById('combined-output');
+    const output = document.getElementById("");
 
     generateBtn.textContent = 'Generating...';

[NoCoverage] StringLiteral
src/app.js:290:31
     const generateBtn = document.getElementById('generate-speak-btn');
     const output = document.getElementById('combined-output');
 
-    generateBtn.textContent = 'Generating...';
+    generateBtn.textContent = "";
     generateBtn.disabled = true;
     output.innerHTML = '';

[NoCoverage] BooleanLiteral
src/app.js:295:25
     output.innerHTML = '';
 
     try {
-      this.showProgress(true, 'Loading models...');
+      this.showProgress(false, 'Loading models...');
       
       // Generate text first

[NoCoverage] StringLiteral
src/app.js:298:27
       this.showProgress(true, 'Loading models...');
       
       // Generate text first
-      let generatedText = '';
+      let generatedText = "Stryker was here!";
       await this.llm.generate(prompt, {
         onToken: (token) => {

[NoCoverage] ObjectLiteral
src/app.js:299:39
       
       // Generate text first
       let generatedText = '';
-      await this.llm.generate(prompt, {
-        onToken: (token) => {
-          generatedText += token;
-          output.textContent = generatedText;
-          output.scrollTop = output.scrollHeight;
-        },
-        onProgress: (progress) => {
-          this.updateProgress(progress.percentage * 0.7, `Loading LLM: ${progress.text}`);
-        }
-      });
+      await this.llm.generate(prompt, {});
 
       // Then speak it

[NoCoverage] BlockStatement
src/app.js:300:29
       // Generate text first
       let generatedText = '';
       await this.llm.generate(prompt, {
-        onToken: (token) => {
-          generatedText += token;
-          output.textContent = generatedText;
-          output.scrollTop = output.scrollHeight;
-        },
+        onToken: (token) => {},
         onProgress: (progress) => {
           this.updateProgress(progress.percentage * 0.7, `Loading LLM: ${progress.text}`);

[NoCoverage] AssignmentOperator
src/app.js:301:11
       let generatedText = '';
       await this.llm.generate(prompt, {
         onToken: (token) => {
-          generatedText += token;
+          generatedText -= token;
           output.textContent = generatedText;
           output.scrollTop = output.scrollHeight;

[NoCoverage] BlockStatement
src/app.js:305:35
           output.textContent = generatedText;
           output.scrollTop = output.scrollHeight;
         },
-        onProgress: (progress) => {
-          this.updateProgress(progress.percentage * 0.7, `Loading LLM: ${progress.text}`);
-        }
+        onProgress: (progress) => {}
       });
 

[NoCoverage] ArithmeticOperator
src/app.js:306:31
           output.scrollTop = output.scrollHeight;
         },
         onProgress: (progress) => {
-          this.updateProgress(progress.percentage * 0.7, `Loading LLM: ${progress.text}`);
+          this.updateProgress(progress.percentage / 0.7, `Loading LLM: ${progress.text}`);
         }
       });

[NoCoverage] StringLiteral
src/app.js:306:58
           output.scrollTop = output.scrollHeight;
         },
         onProgress: (progress) => {
-          this.updateProgress(progress.percentage * 0.7, `Loading LLM: ${progress.text}`);
+          this.updateProgress(progress.percentage * 0.7, ``);
         }
       });

[NoCoverage] BooleanLiteral
src/app.js:311:27
       });
 
       // Then speak it
-      this.isGenerating = false;
+      this.isGenerating = true;
       this.isSpeaking = true;
       generateBtn.textContent = 'Speaking...';

[NoCoverage] BooleanLiteral
src/app.js:312:25
 
       // Then speak it
       this.isGenerating = false;
-      this.isSpeaking = true;
+      this.isSpeaking = false;
       generateBtn.textContent = 'Speaking...';
       

[NoCoverage] StringLiteral
src/app.js:313:33
       // Then speak it
       this.isGenerating = false;
       this.isSpeaking = true;
-      generateBtn.textContent = 'Speaking...';
+      generateBtn.textContent = "";
       
       output.innerHTML = '';

[NoCoverage] StringLiteral
src/app.js:315:26
       this.isSpeaking = true;
       generateBtn.textContent = 'Speaking...';
       
-      output.innerHTML = '';
+      output.innerHTML = "Stryker was here!";
       await this.tts.speak(generatedText, {
         outputElement: output,

[NoCoverage] ObjectLiteral
src/app.js:316:43
       generateBtn.textContent = 'Speaking...';
       
       output.innerHTML = '';
-      await this.tts.speak(generatedText, {
-        outputElement: output,
-        audioModule: this.audio,
-        onProgress: (progress) => {
-          this.updateProgress(70 + progress.percentage * 0.3, `Loading TTS: ${progress.text}`);
-        }
-      });
+      await this.tts.speak(generatedText, {});
 
       document.getElementById('llm-status').textContent = 'loaded';

[NoCoverage] BlockStatement
src/app.js:319:35
       await this.tts.speak(generatedText, {
         outputElement: output,
         audioModule: this.audio,
-        onProgress: (progress) => {
-          this.updateProgress(70 + progress.percentage * 0.3, `Loading TTS: ${progress.text}`);
-        }
+        onProgress: (progress) => {}
       });
 

[NoCoverage] ArithmeticOperator
src/app.js:320:31
         outputElement: output,
         audioModule: this.audio,
         onProgress: (progress) => {
-          this.updateProgress(70 + progress.percentage * 0.3, `Loading TTS: ${progress.text}`);
+          this.updateProgress(70 - progress.percentage * 0.3, `Loading TTS: ${progress.text}`);
         }
       });

[NoCoverage] ArithmeticOperator
src/app.js:320:36
         outputElement: output,
         audioModule: this.audio,
         onProgress: (progress) => {
-          this.updateProgress(70 + progress.percentage * 0.3, `Loading TTS: ${progress.text}`);
+          this.updateProgress(70 + progress.percentage / 0.3, `Loading TTS: ${progress.text}`);
         }
       });

[NoCoverage] StringLiteral
src/app.js:325:59
       });
 
       document.getElementById('llm-status').textContent = 'loaded';
-      document.getElementById('tts-status').textContent = 'loaded';
+      document.getElementById('tts-status').textContent = "";
 
     } catch (error) {

[NoCoverage] BlockStatement
src/app.js:327:21
       document.getElementById('llm-status').textContent = 'loaded';
       document.getElementById('tts-status').textContent = 'loaded';
 
-    } catch (error) {
-      this.showError(`Generation/Speech failed: ${error.message}`);
-      console.error('Combined error:', error);
-    } finally {
+    } catch (error) {} finally {
       this.isGenerating = false;
       this.isSpeaking = false;

[NoCoverage] BlockStatement
src/app.js:330:15
     } catch (error) {
       this.showError(`Generation/Speech failed: ${error.message}`);
       console.error('Combined error:', error);
-    } finally {
-      this.isGenerating = false;
-      this.isSpeaking = false;
-      generateBtn.textContent = 'Generate & Speak';
-      generateBtn.disabled = false;
-      this.showProgress(false);
-    }
+    } finally {}
   }
 

[NoCoverage] StringLiteral
src/app.js:333:33
     } finally {
       this.isGenerating = false;
       this.isSpeaking = false;
-      generateBtn.textContent = 'Generate & Speak';
+      generateBtn.textContent = "";
       generateBtn.disabled = false;
       this.showProgress(false);

[NoCoverage] BooleanLiteral
src/app.js:334:30
       this.isGenerating = false;
       this.isSpeaking = false;
       generateBtn.textContent = 'Generate & Speak';
-      generateBtn.disabled = false;
+      generateBtn.disabled = true;
       this.showProgress(false);
     }

[NoCoverage] BlockStatement
src/app.js:344:22
     // This would be more complex in a real implementation
   }
 
-  showError(message) {
-    const errorContainer = document.getElementById('error-container');
-    const errorMessage = document.getElementById('error-message');
-    
-    errorMessage.textContent = message;
-    errorContainer.classList.remove('hidden');
-    
-    setTimeout(() => {
-      errorContainer.classList.add('hidden');
-    }, 5000);
-  }
+  showError(message) {}
 }
 

[NoCoverage] StringLiteral
src/app.js:345:52
   }
 
   showError(message) {
-    const errorContainer = document.getElementById('error-container');
+    const errorContainer = document.getElementById("");
     const errorMessage = document.getElementById('error-message');
     

[NoCoverage] StringLiteral
src/app.js:346:50
 
   showError(message) {
     const errorContainer = document.getElementById('error-container');
-    const errorMessage = document.getElementById('error-message');
+    const errorMessage = document.getElementById("");
     
     errorMessage.textContent = message;

[NoCoverage] BlockStatement
src/app.js:351:22
     errorMessage.textContent = message;
     errorContainer.classList.remove('hidden');
     
-    setTimeout(() => {
-      errorContainer.classList.add('hidden');
-    }, 5000);
+    setTimeout(() => {}, 5000);
   }
 }

[NoCoverage] BlockStatement
src/app.js:358:53
 }
 
 // Initialize app when DOM is loaded
-document.addEventListener('DOMContentLoaded', () => {
-  window.app = new AppController();
-});
+document.addEventListener('DOMContentLoaded', () => {});
 
