[NoCoverage] BlockStatement
src/audio.js:2:17
 export class AudioModule extends EventTarget {
-  constructor() {
-    super();
-    this.audioContext = null;
-    this.workletNode = null;
-    this.isInitialized = false;
-    this.isPaused = false;
-    this.queue = [];
-  }
+  constructor() {}
 
   async initialize() {

[NoCoverage] BooleanLiteral
src/audio.js:6:26
     super();
     this.audioContext = null;
     this.workletNode = null;
-    this.isInitialized = false;
+    this.isInitialized = true;
     this.isPaused = false;
     this.queue = [];

[NoCoverage] BooleanLiteral
src/audio.js:7:21
     this.audioContext = null;
     this.workletNode = null;
     this.isInitialized = false;
-    this.isPaused = false;
+    this.isPaused = true;
     this.queue = [];
   }

[NoCoverage] ArrayDeclaration
src/audio.js:8:18
     this.workletNode = null;
     this.isInitialized = false;
     this.isPaused = false;
-    this.queue = [];
+    this.queue = ["Stryker was here"];
   }
 

[NoCoverage] ConditionalExpression
src/audio.js:12:9
   }
 
   async initialize() {
-    if (this.isInitialized) return;
+    if (true) return;
 
     try {

[NoCoverage] ConditionalExpression
src/audio.js:12:9
   }
 
   async initialize() {
-    if (this.isInitialized) return;
+    if (false) return;
 
     try {

[NoCoverage] LogicalOperator
src/audio.js:16:32
 
     try {
       // Create AudioContext with appropriate sample rate for TTS
-      this.audioContext = new (window.AudioContext || window.webkitAudioContext)({
+      this.audioContext = new (window.AudioContext && window.webkitAudioContext)({
         sampleRate: 24000
       });

[NoCoverage] ConditionalExpression
src/audio.js:16:32
 
     try {
       // Create AudioContext with appropriate sample rate for TTS
-      this.audioContext = new (window.AudioContext || window.webkitAudioContext)({
+      this.audioContext = new (true)({
         sampleRate: 24000
       });

[NoCoverage] StringLiteral
src/audio.js:24:66
       await this.audioContext.audioWorklet.addModule('./src/worklet.js');
 
       // Create the worklet node
-      this.workletNode = new AudioWorkletNode(this.audioContext, 'pcm-queue-processor');
+      this.workletNode = new AudioWorkletNode(this.audioContext, "");
 
       // Connect to speakers

[NoCoverage] BlockStatement
src/audio.js:30:52
       this.workletNode.connect(this.audioContext.destination);
 
       // Set up message handling
-      this.workletNode.port.onmessage = (event) => {
-        const { type, data } = event.data;
-        
-        switch (type) {
-          case 'next_chunk':
-            this.dispatchEvent(new CustomEvent('next_chunk', { detail: data }));
-            break;
-          case 'chunk-complete':
-            this.dispatchEvent(new CustomEvent('chunk-complete', { detail: data }));
-            break;
-          case 'playback_ended':
-            this.dispatchEvent(new CustomEvent('playback_ended'));
-            break;
-          case 'buffer-underrun':
-            this.dispatchEvent(new CustomEvent('buffer-underrun'));
-            break;
-        }
-      };
+      this.workletNode.port.onmessage = (event) => {};
 
       this.isInitialized = true;

[NoCoverage] ConditionalExpression
src/audio.js:34:11
         const { type, data } = event.data;
         
         switch (type) {
-          case 'next_chunk':
-            this.dispatchEvent(new CustomEvent('next_chunk', { detail: data }));
-            break;
+          case 'next_chunk':
           case 'chunk-complete':
             this.dispatchEvent(new CustomEvent('chunk-complete', { detail: data }));

[NoCoverage] ObjectLiteral
src/audio.js:35:62
         
         switch (type) {
           case 'next_chunk':
-            this.dispatchEvent(new CustomEvent('next_chunk', { detail: data }));
+            this.dispatchEvent(new CustomEvent('next_chunk', {}));
             break;
           case 'chunk-complete':

[NoCoverage] ConditionalExpression
src/audio.js:37:11
           case 'next_chunk':
             this.dispatchEvent(new CustomEvent('next_chunk', { detail: data }));
             break;
-          case 'chunk-complete':
-            this.dispatchEvent(new CustomEvent('chunk-complete', { detail: data }));
-            break;
+          case 'chunk-complete':
           case 'playback_ended':
             this.dispatchEvent(new CustomEvent('playback_ended'));

[NoCoverage] StringLiteral
src/audio.js:37:16
           case 'next_chunk':
             this.dispatchEvent(new CustomEvent('next_chunk', { detail: data }));
             break;
-          case 'chunk-complete':
+          case "":
             this.dispatchEvent(new CustomEvent('chunk-complete', { detail: data }));
             break;

[NoCoverage] StringLiteral
src/audio.js:38:48
             this.dispatchEvent(new CustomEvent('next_chunk', { detail: data }));
             break;
           case 'chunk-complete':
-            this.dispatchEvent(new CustomEvent('chunk-complete', { detail: data }));
+            this.dispatchEvent(new CustomEvent("", { detail: data }));
             break;
           case 'playback_ended':

[NoCoverage] ConditionalExpression
src/audio.js:40:11
           case 'chunk-complete':
             this.dispatchEvent(new CustomEvent('chunk-complete', { detail: data }));
             break;
-          case 'playback_ended':
-            this.dispatchEvent(new CustomEvent('playback_ended'));
-            break;
+          case 'playback_ended':
           case 'buffer-underrun':
             this.dispatchEvent(new CustomEvent('buffer-underrun'));

[NoCoverage] StringLiteral
src/audio.js:40:16
           case 'chunk-complete':
             this.dispatchEvent(new CustomEvent('chunk-complete', { detail: data }));
             break;
-          case 'playback_ended':
+          case "":
             this.dispatchEvent(new CustomEvent('playback_ended'));
             break;

[NoCoverage] ConditionalExpression
src/audio.js:43:11
           case 'playback_ended':
             this.dispatchEvent(new CustomEvent('playback_ended'));
             break;
-          case 'buffer-underrun':
-            this.dispatchEvent(new CustomEvent('buffer-underrun'));
-            break;
+          case 'buffer-underrun':
         }
       };

[NoCoverage] StringLiteral
src/audio.js:43:16
           case 'playback_ended':
             this.dispatchEvent(new CustomEvent('playback_ended'));
             break;
-          case 'buffer-underrun':
+          case "":
             this.dispatchEvent(new CustomEvent('buffer-underrun'));
             break;

[NoCoverage] StringLiteral
src/audio.js:44:48
             this.dispatchEvent(new CustomEvent('playback_ended'));
             break;
           case 'buffer-underrun':
-            this.dispatchEvent(new CustomEvent('buffer-underrun'));
+            this.dispatchEvent(new CustomEvent(""));
             break;
         }

[NoCoverage] BooleanLiteral
src/audio.js:49:28
         }
       };
 
-      this.isInitialized = true;
+      this.isInitialized = false;
 
     } catch (error) {

[NoCoverage] BlockStatement
src/audio.js:51:21
 
       this.isInitialized = true;
 
-    } catch (error) {
-      console.error('Failed to initialize AudioModule:', error);
-      throw new Error(`Audio initialization failed: ${error.message}`);
-    }
+    } catch (error) {}
   }
 

[NoCoverage] StringLiteral
src/audio.js:52:21
       this.isInitialized = true;
 
     } catch (error) {
-      console.error('Failed to initialize AudioModule:', error);
+      console.error("", error);
       throw new Error(`Audio initialization failed: ${error.message}`);
     }

[NoCoverage] BlockStatement
src/audio.js:57:14
     }
   }
 
-  get port() {
-    return this.workletNode?.port;
-  }
+  get port() {}
 
   async resumeAudioContext() {

[NoCoverage] OptionalChaining
src/audio.js:58:12
   }
 
   get port() {
-    return this.workletNode?.port;
+    return this.workletNode.port;
   }
 

[NoCoverage] BlockStatement
src/audio.js:61:30
     return this.workletNode?.port;
   }
 
-  async resumeAudioContext() {
-    if (this.audioContext && this.audioContext.state === 'suspended') {
-      await this.audioContext.resume();
-    }
-  }
+  async resumeAudioContext() {}
 
   async queueAudio(audioData, metadata = {}) {

[NoCoverage] ConditionalExpression
src/audio.js:62:9
   }
 
   async resumeAudioContext() {
-    if (this.audioContext && this.audioContext.state === 'suspended') {
+    if (false) {
       await this.audioContext.resume();
     }

[NoCoverage] EqualityOperator
src/audio.js:62:30
   }
 
   async resumeAudioContext() {
-    if (this.audioContext && this.audioContext.state === 'suspended') {
+    if (this.audioContext && this.audioContext.state !== 'suspended') {
       await this.audioContext.resume();
     }

[NoCoverage] BlockStatement
src/audio.js:67:46
     }
   }
 
-  async queueAudio(audioData, metadata = {}) {
-    await this.initialize();
-    await this.resumeAudioContext();
-
-    if (this.isPaused) {
-      // Queue for later playback
-      this.queue.push({ audioData, metadata });
-      return;
-    }
-
-    this.workletNode.port.postMessage({
-      type: 'queue-audio',
-      audioData: audioData,
-      metadata: metadata
-    });
-  }
+  async queueAudio(audioData, metadata = {}) {}
 
   async pause() {

[NoCoverage] ConditionalExpression
src/audio.js:71:9
     await this.initialize();
     await this.resumeAudioContext();
 
-    if (this.isPaused) {
+    if (false) {
       // Queue for later playback
       this.queue.push({ audioData, metadata });

[NoCoverage] ConditionalExpression
src/audio.js:71:9
     await this.initialize();
     await this.resumeAudioContext();
 
-    if (this.isPaused) {
+    if (true) {
       // Queue for later playback
       this.queue.push({ audioData, metadata });

[NoCoverage] ObjectLiteral
src/audio.js:73:23
 
     if (this.isPaused) {
       // Queue for later playback
-      this.queue.push({ audioData, metadata });
+      this.queue.push({});
       return;
     }

[NoCoverage] StringLiteral
src/audio.js:78:13
     }
 
     this.workletNode.port.postMessage({
-      type: 'queue-audio',
+      type: "",
       audioData: audioData,
       metadata: metadata

[NoCoverage] BlockStatement
src/audio.js:84:17
     });
   }
 
-  async pause() {
-    this.isPaused = true;
-    
-    if (this.workletNode) {
-      this.workletNode.port.postMessage({
-        type: 'pause'
-      });
-    }
-  }
+  async pause() {}
 
   async resume() {

[NoCoverage] BooleanLiteral
src/audio.js:85:21
   }
 
   async pause() {
-    this.isPaused = true;
+    this.isPaused = false;
     
     if (this.workletNode) {

[NoCoverage] ConditionalExpression
src/audio.js:87:9
   async pause() {
     this.isPaused = true;
     
-    if (this.workletNode) {
+    if (true) {
       this.workletNode.port.postMessage({
         type: 'pause'

[NoCoverage] ConditionalExpression
src/audio.js:87:9
   async pause() {
     this.isPaused = true;
     
-    if (this.workletNode) {
+    if (false) {
       this.workletNode.port.postMessage({
         type: 'pause'

[NoCoverage] ObjectLiteral
src/audio.js:88:41
     this.isPaused = true;
     
     if (this.workletNode) {
-      this.workletNode.port.postMessage({
-        type: 'pause'
-      });
+      this.workletNode.port.postMessage({});
     }
   }

[NoCoverage] StringLiteral
src/audio.js:89:15
     
     if (this.workletNode) {
       this.workletNode.port.postMessage({
-        type: 'pause'
+        type: ""
       });
     }

[NoCoverage] BlockStatement
src/audio.js:94:18
     }
   }
 
-  async resume() {
-    if (!this.isPaused) return;
-    
-    this.isPaused = false;
-    await this.resumeAudioContext();
-
-    // Process any queued audio
-    while (this.queue.length > 0) {
-      const { audioData, metadata } = this.queue.shift();
-      this.workletNode.port.postMessage({
-        type: 'queue-audio',
-        audioData: audioData,
-        metadata: metadata
-      });
-    }
-
-    if (this.workletNode) {
-      this.workletNode.port.postMessage({
-        type: 'resume'
-      });
-    }
-  }
+  async resume() {}
 
   stop() {

[NoCoverage] BooleanLiteral
src/audio.js:95:9
   }
 
   async resume() {
-    if (!this.isPaused) return;
+    if (this.isPaused) return;
     
     this.isPaused = false;

[NoCoverage] ConditionalExpression
src/audio.js:95:9
   }
 
   async resume() {
-    if (!this.isPaused) return;
+    if (true) return;
     
     this.isPaused = false;

[NoCoverage] BooleanLiteral
src/audio.js:97:21
   async resume() {
     if (!this.isPaused) return;
     
-    this.isPaused = false;
+    this.isPaused = true;
     await this.resumeAudioContext();
 

[NoCoverage] ConditionalExpression
src/audio.js:101:12
     await this.resumeAudioContext();
 
     // Process any queued audio
-    while (this.queue.length > 0) {
+    while (false) {
       const { audioData, metadata } = this.queue.shift();
       this.workletNode.port.postMessage({

[NoCoverage] EqualityOperator
src/audio.js:101:12
     await this.resumeAudioContext();
 
     // Process any queued audio
-    while (this.queue.length > 0) {
+    while (this.queue.length >= 0) {
       const { audioData, metadata } = this.queue.shift();
       this.workletNode.port.postMessage({

[NoCoverage] ObjectLiteral
src/audio.js:103:41
     // Process any queued audio
     while (this.queue.length > 0) {
       const { audioData, metadata } = this.queue.shift();
-      this.workletNode.port.postMessage({
-        type: 'queue-audio',
-        audioData: audioData,
-        metadata: metadata
-      });
+      this.workletNode.port.postMessage({});
     }
 

[NoCoverage] BlockStatement
src/audio.js:110:27
       });
     }
 
-    if (this.workletNode) {
-      this.workletNode.port.postMessage({
-        type: 'resume'
-      });
-    }
+    if (this.workletNode) {}
   }
 

[NoCoverage] BlockStatement
src/audio.js:117:10
     }
   }
 
-  stop() {
-    this.isPaused = false;
-    this.queue = [];
-    
-    if (this.workletNode) {
-      this.workletNode.port.postMessage({
-        type: 'stop'
-      });
-    }
-  }
+  stop() {}
 
   getBufferStatus() {

[NoCoverage] BooleanLiteral
src/audio.js:118:21
   }
 
   stop() {
-    this.isPaused = false;
+    this.isPaused = true;
     this.queue = [];
     

[NoCoverage] BlockStatement
src/audio.js:121:27
     this.isPaused = false;
     this.queue = [];
     
-    if (this.workletNode) {
-      this.workletNode.port.postMessage({
-        type: 'stop'
-      });
-    }
+    if (this.workletNode) {}
   }
 

[NoCoverage] StringLiteral
src/audio.js:123:15
     
     if (this.workletNode) {
       this.workletNode.port.postMessage({
-        type: 'stop'
+        type: ""
       });
     }

[NoCoverage] BlockStatement
src/audio.js:128:21
     }
   }
 
-  getBufferStatus() {
-    if (!this.workletNode) return { length: 0, duration: 0 };
-    
-    // This would require the worklet to report back buffer status
-    // For now, return a placeholder
-    return { length: 0, duration: 0 };
-  }
+  getBufferStatus() {}
 
   destroy() {

[NoCoverage] ConditionalExpression
src/audio.js:129:9
   }
 
   getBufferStatus() {
-    if (!this.workletNode) return { length: 0, duration: 0 };
+    if (false) return { length: 0, duration: 0 };
     
     // This would require the worklet to report back buffer status

[NoCoverage] ConditionalExpression
src/audio.js:129:9
   }
 
   getBufferStatus() {
-    if (!this.workletNode) return { length: 0, duration: 0 };
+    if (true) return { length: 0, duration: 0 };
     
     // This would require the worklet to report back buffer status

[NoCoverage] ObjectLiteral
src/audio.js:133:12
     
     // This would require the worklet to report back buffer status
     // For now, return a placeholder
-    return { length: 0, duration: 0 };
+    return {};
   }
 

[NoCoverage] BlockStatement
src/audio.js:136:13
     return { length: 0, duration: 0 };
   }
 
-  destroy() {
-    this.stop();
-    
-    if (this.workletNode) {
-      this.workletNode.disconnect();
-      this.workletNode = null;
-    }
-    
-    if (this.audioContext) {
-      this.audioContext.close();
-      this.audioContext = null;
-    }
-    
-    this.isInitialized = false;
-  }
+  destroy() {}
 }
 

[NoCoverage] BlockStatement
src/audio.js:139:27
   destroy() {
     this.stop();
     
-    if (this.workletNode) {
-      this.workletNode.disconnect();
-      this.workletNode = null;
-    }
+    if (this.workletNode) {}
     
     if (this.audioContext) {

[NoCoverage] ConditionalExpression
src/audio.js:144:9
       this.workletNode = null;
     }
     
-    if (this.audioContext) {
+    if (false) {
       this.audioContext.close();
       this.audioContext = null;

[NoCoverage] ConditionalExpression
src/audio.js:144:9
       this.workletNode = null;
     }
     
-    if (this.audioContext) {
+    if (true) {
       this.audioContext.close();
       this.audioContext = null;

[NoCoverage] BooleanLiteral
src/audio.js:149:26
       this.audioContext = null;
     }
     
-    this.isInitialized = false;
+    this.isInitialized = true;
   }
 }
