[Survived] StringLiteral
src/index.js:4:17
 // Configuration constants for the Local LLM Demo
 export const CONFIG = {
   LLM_MODEL_ID: 'onnx-community/Qwen2.5-0.5B-Instruct-ONNX',
-  TTS_MODEL_ID: 'onnx-community/Kokoro-82M-v1.0-ONNX',
+  TTS_MODEL_ID: "",
   SAMPLE_RATE: 24000,
   MAX_NEW_TOKENS: 256,

[Killed] BlockStatement
src/index.js:15:39
 
 export { splitIntoSentences, formatPromptForInstruction };
 
-export function detectWebGPUSupport() {
-  return 'gpu' in navigator;
-}
+export function detectWebGPUSupport() {}
 
 export function getOptimalDevice() {
killedBy: Local LLM Demo Configuration detectWebGPUSupport returns boolean
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "boolean"
Received: "undefined"

[Survived] StringLiteral
src/index.js:16:10
 export { splitIntoSentences, formatPromptForInstruction };
 
 export function detectWebGPUSupport() {
-  return 'gpu' in navigator;
+  return "" in navigator;
 }
 

[Killed] BlockStatement
src/index.js:19:36
   return 'gpu' in navigator;
 }
 
-export function getOptimalDevice() {
-  return detectWebGPUSupport() ? 'webgpu' : 'wasm';
-}
+export function getOptimalDevice() {}
 
 console.log("Local LLM Demo initialized");
killedBy: Local LLM Demo Configuration getOptimalDevice returns valid device
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: undefined
Received array: ["webgpu", "wasm"]

[NoCoverage] StringLiteral
src/index.js:20:34
 }
 
 export function getOptimalDevice() {
-  return detectWebGPUSupport() ? 'webgpu' : 'wasm';
+  return detectWebGPUSupport() ? "" : 'wasm';
 }
 
