[NoCoverage] BlockStatement
src/llm.js:5:17
 const LLM_MODEL_ID = 'onnx-community/Qwen2.5-0.5B-Instruct-ONNX';
 
 export class LLMModule {
-  constructor() {
-    this.pipeline = null;
-    this.device = null;
-    this.isLoading = false;
-    this.setupEnvironment();
-  }
+  constructor() {}
 
   setupEnvironment() {

[NoCoverage] BooleanLiteral
src/llm.js:8:22
   constructor() {
     this.pipeline = null;
     this.device = null;
-    this.isLoading = false;
+    this.isLoading = true;
     this.setupEnvironment();
   }

[NoCoverage] BlockStatement
src/llm.js:12:22
     this.setupEnvironment();
   }
 
-  setupEnvironment() {
-    // Configure Transformers.js environment
-    if (typeof window !== 'undefined' && window.transformers) {
-      const { env } = window.transformers;
-      
-      // Enable browser caching for offline use
-      env.useBrowserCache = true;
-      
-      // Allow local models when serving from local server
-      env.allowRemoteModels = true;
-      env.allowLocalModels = true;
-      
-      // Optimize ONNX WASM performance
-      env.backends.onnx.wasm.numThreads = navigator.hardwareConcurrency || 4;
-    }
-  }
+  setupEnvironment() {}
 
   async detectDevice() {

[NoCoverage] EqualityOperator
src/llm.js:14:9
 
   setupEnvironment() {
     // Configure Transformers.js environment
-    if (typeof window !== 'undefined' && window.transformers) {
+    if (typeof window === 'undefined' && window.transformers) {
       const { env } = window.transformers;
       

[NoCoverage] LogicalOperator
src/llm.js:14:9
 
   setupEnvironment() {
     // Configure Transformers.js environment
-    if (typeof window !== 'undefined' && window.transformers) {
+    if (typeof window !== 'undefined' || window.transformers) {
       const { env } = window.transformers;
       

[NoCoverage] BooleanLiteral
src/llm.js:18:29
       const { env } = window.transformers;
       
       // Enable browser caching for offline use
-      env.useBrowserCache = true;
+      env.useBrowserCache = false;
       
       // Allow local models when serving from local server

[NoCoverage] BooleanLiteral
src/llm.js:21:31
       env.useBrowserCache = true;
       
       // Allow local models when serving from local server
-      env.allowRemoteModels = true;
+      env.allowRemoteModels = false;
       env.allowLocalModels = true;
       

[NoCoverage] BooleanLiteral
src/llm.js:22:30
       
       // Allow local models when serving from local server
       env.allowRemoteModels = true;
-      env.allowLocalModels = true;
+      env.allowLocalModels = false;
       
       // Optimize ONNX WASM performance

[NoCoverage] LogicalOperator
src/llm.js:25:43
       env.allowLocalModels = true;
       
       // Optimize ONNX WASM performance
-      env.backends.onnx.wasm.numThreads = navigator.hardwareConcurrency || 4;
+      env.backends.onnx.wasm.numThreads = navigator.hardwareConcurrency && 4;
     }
   }

[NoCoverage] ConditionalExpression
src/llm.js:25:43
       env.allowLocalModels = true;
       
       // Optimize ONNX WASM performance
-      env.backends.onnx.wasm.numThreads = navigator.hardwareConcurrency || 4;
+      env.backends.onnx.wasm.numThreads = false;
     }
   }

[NoCoverage] BlockStatement
src/llm.js:29:24
     }
   }
 
-  async detectDevice() {
-    // Check WebGPU availability
-    if (navigator.gpu) {
-      try {
-        const adapter = await navigator.gpu.requestAdapter();
-        if (adapter) {
-          return 'webgpu';
-        }
-      } catch {
-        console.warn('WebGPU adapter request failed');
-      }
-    }
-    return 'wasm';
-  }
+  async detectDevice() {}
 
   async initializePipeline(onProgress) {

[NoCoverage] BlockStatement
src/llm.js:31:24
 
   async detectDevice() {
     // Check WebGPU availability
-    if (navigator.gpu) {
-      try {
-        const adapter = await navigator.gpu.requestAdapter();
-        if (adapter) {
-          return 'webgpu';
-        }
-      } catch {
-        console.warn('WebGPU adapter request failed');
-      }
-    }
+    if (navigator.gpu) {}
     return 'wasm';
   }

[NoCoverage] ConditionalExpression
src/llm.js:31:9
 
   async detectDevice() {
     // Check WebGPU availability
-    if (navigator.gpu) {
+    if (true) {
       try {
         const adapter = await navigator.gpu.requestAdapter();

[NoCoverage] BlockStatement
src/llm.js:32:11
   async detectDevice() {
     // Check WebGPU availability
     if (navigator.gpu) {
-      try {
-        const adapter = await navigator.gpu.requestAdapter();
-        if (adapter) {
-          return 'webgpu';
-        }
-      } catch {
+      try {} catch {
         console.warn('WebGPU adapter request failed');
       }

[NoCoverage] ConditionalExpression
src/llm.js:34:13
     if (navigator.gpu) {
       try {
         const adapter = await navigator.gpu.requestAdapter();
-        if (adapter) {
+        if (false) {
           return 'webgpu';
         }

[NoCoverage] BlockStatement
src/llm.js:37:15
         if (adapter) {
           return 'webgpu';
         }
-      } catch {
-        console.warn('WebGPU adapter request failed');
-      }
+      } catch {}
     }
     return 'wasm';

[NoCoverage] ConditionalExpression
src/llm.js:45:9
   }
 
   async initializePipeline(onProgress) {
-    if (this.pipeline) return this.pipeline;
+    if (false) return this.pipeline;
     if (this.isLoading) {
       // Wait for current loading to complete

[NoCoverage] ConditionalExpression
src/llm.js:45:9
   }
 
   async initializePipeline(onProgress) {
-    if (this.pipeline) return this.pipeline;
+    if (true) return this.pipeline;
     if (this.isLoading) {
       // Wait for current loading to complete

[NoCoverage] ConditionalExpression
src/llm.js:46:9
 
   async initializePipeline(onProgress) {
     if (this.pipeline) return this.pipeline;
-    if (this.isLoading) {
+    if (false) {
       // Wait for current loading to complete
       while (this.isLoading) {

[NoCoverage] BlockStatement
src/llm.js:46:25
 
   async initializePipeline(onProgress) {
     if (this.pipeline) return this.pipeline;
-    if (this.isLoading) {
-      // Wait for current loading to complete
-      while (this.isLoading) {
-        await new Promise(resolve => setTimeout(resolve, 100));
-      }
-      return this.pipeline;
-    }
+    if (this.isLoading) {}
 
     this.isLoading = true;

[NoCoverage] BlockStatement
src/llm.js:48:30
     if (this.pipeline) return this.pipeline;
     if (this.isLoading) {
       // Wait for current loading to complete
-      while (this.isLoading) {
-        await new Promise(resolve => setTimeout(resolve, 100));
-      }
+      while (this.isLoading) {}
       return this.pipeline;
     }

[NoCoverage] ConditionalExpression
src/llm.js:48:14
     if (this.pipeline) return this.pipeline;
     if (this.isLoading) {
       // Wait for current loading to complete
-      while (this.isLoading) {
+      while (false) {
         await new Promise(resolve => setTimeout(resolve, 100));
       }

[NoCoverage] ArrowFunction
src/llm.js:49:27
     if (this.isLoading) {
       // Wait for current loading to complete
       while (this.isLoading) {
-        await new Promise(resolve => setTimeout(resolve, 100));
+        await new Promise(() => undefined);
       }
       return this.pipeline;

[NoCoverage] BooleanLiteral
src/llm.js:54:22
       return this.pipeline;
     }
 
-    this.isLoading = true;
+    this.isLoading = false;
 
     try {

[NoCoverage] BlockStatement
src/llm.js:59:11
     try {
       // Dynamically import Transformers.js
       let transformers;
-      try {
-        // Try to load from CDN
-        transformers = await import('https://cdn.jsdelivr.net/npm/@xenova/transformers@2.17.2/dist/transformers.min.js');
-      } catch {
+      try {} catch {
         // Fallback error handling
         throw new Error('Failed to load Transformers.js library');

[NoCoverage] StringLiteral
src/llm.js:61:37
       let transformers;
       try {
         // Try to load from CDN
-        transformers = await import('https://cdn.jsdelivr.net/npm/@xenova/transformers@2.17.2/dist/transformers.min.js');
+        transformers = await import("");
       } catch {
         // Fallback error handling

[NoCoverage] BlockStatement
src/llm.js:62:15
       try {
         // Try to load from CDN
         transformers = await import('https://cdn.jsdelivr.net/npm/@xenova/transformers@2.17.2/dist/transformers.min.js');
-      } catch {
-        // Fallback error handling
-        throw new Error('Failed to load Transformers.js library');
-      }
+      } catch {}
 
       const { pipeline, env } = transformers;

[NoCoverage] BooleanLiteral
src/llm.js:70:29
       const { pipeline, env } = transformers;
       
       // Configure environment
-      env.useBrowserCache = true;
+      env.useBrowserCache = false;
       env.allowRemoteModels = true;
       env.allowLocalModels = true;

[NoCoverage] BooleanLiteral
src/llm.js:71:31
       
       // Configure environment
       env.useBrowserCache = true;
-      env.allowRemoteModels = true;
+      env.allowRemoteModels = false;
       env.allowLocalModels = true;
       env.backends.onnx.wasm.numThreads = navigator.hardwareConcurrency || 4;

[NoCoverage] ConditionalExpression
src/llm.js:73:43
       env.useBrowserCache = true;
       env.allowRemoteModels = true;
       env.allowLocalModels = true;
-      env.backends.onnx.wasm.numThreads = navigator.hardwareConcurrency || 4;
+      env.backends.onnx.wasm.numThreads = true;
 
       // Detect device

[NoCoverage] ConditionalExpression
src/llm.js:73:43
       env.useBrowserCache = true;
       env.allowRemoteModels = true;
       env.allowLocalModels = true;
-      env.backends.onnx.wasm.numThreads = navigator.hardwareConcurrency || 4;
+      env.backends.onnx.wasm.numThreads = false;
 
       // Detect device

[NoCoverage] OptionalChaining
src/llm.js:79:7
       this.device = await this.detectDevice();
       
       // Create pipeline with progress callback
-      onProgress?.({ percentage: 0, text: 'Initializing pipeline...' });
+      onProgress({
+  percentage: 0,
+  text: 'Initializing pipeline...'
+});
       
       this.pipeline = await pipeline('text-generation', LLM_MODEL_ID, {

[NoCoverage] StringLiteral
src/llm.js:81:38
       // Create pipeline with progress callback
       onProgress?.({ percentage: 0, text: 'Initializing pipeline...' });
       
-      this.pipeline = await pipeline('text-generation', LLM_MODEL_ID, {
+      this.pipeline = await pipeline("", LLM_MODEL_ID, {
         device: this.device,
         progress_callback: (progress) => {

[NoCoverage] BlockStatement
src/llm.js:83:42
       
       this.pipeline = await pipeline('text-generation', LLM_MODEL_ID, {
         device: this.device,
-        progress_callback: (progress) => {
-          const percentage = Math.round((progress.loaded / progress.total) * 100);
-          onProgress?.({ 
-            percentage, 
-            text: `Loading ${progress.file || 'model'}: ${percentage}%` 
-          });
-        }
+        progress_callback: (progress) => {}
       });
 

[NoCoverage] ArithmeticOperator
src/llm.js:84:42
       this.pipeline = await pipeline('text-generation', LLM_MODEL_ID, {
         device: this.device,
         progress_callback: (progress) => {
-          const percentage = Math.round((progress.loaded / progress.total) * 100);
+          const percentage = Math.round((progress.loaded * progress.total) * 100);
           onProgress?.({ 
             percentage, 

[NoCoverage] ArithmeticOperator
src/llm.js:84:41
       this.pipeline = await pipeline('text-generation', LLM_MODEL_ID, {
         device: this.device,
         progress_callback: (progress) => {
-          const percentage = Math.round((progress.loaded / progress.total) * 100);
+          const percentage = Math.round(progress.loaded / progress.total / 100);
           onProgress?.({ 
             percentage, 

[NoCoverage] OptionalChaining
src/llm.js:85:11
         device: this.device,
         progress_callback: (progress) => {
           const percentage = Math.round((progress.loaded / progress.total) * 100);
-          onProgress?.({ 
-            percentage, 
-            text: `Loading ${progress.file || 'model'}: ${percentage}%` 
-          });
+          onProgress({
+  percentage,
+  text: `Loading ${progress.file || 'model'}: ${percentage}%`
+});
         }
       });

[NoCoverage] ConditionalExpression
src/llm.js:87:30
           const percentage = Math.round((progress.loaded / progress.total) * 100);
           onProgress?.({ 
             percentage, 
-            text: `Loading ${progress.file || 'model'}: ${percentage}%` 
+            text: `Loading ${true}: ${percentage}%` 
           });
         }

[NoCoverage] ConditionalExpression
src/llm.js:87:30
           const percentage = Math.round((progress.loaded / progress.total) * 100);
           onProgress?.({ 
             percentage, 
-            text: `Loading ${progress.file || 'model'}: ${percentage}%` 
+            text: `Loading ${false}: ${percentage}%` 
           });
         }

[NoCoverage] OptionalChaining
src/llm.js:92:7
         }
       });
 
-      onProgress?.({ percentage: 100, text: 'Model loaded successfully' });
+      onProgress({
+  percentage: 100,
+  text: 'Model loaded successfully'
+});
       return this.pipeline;
 

[NoCoverage] ObjectLiteral
src/llm.js:92:20
         }
       });
 
-      onProgress?.({ percentage: 100, text: 'Model loaded successfully' });
+      onProgress?.({});
       return this.pipeline;
 

[NoCoverage] BlockStatement
src/llm.js:95:21
       onProgress?.({ percentage: 100, text: 'Model loaded successfully' });
       return this.pipeline;
 
-    } catch (error) {
-      console.error('Failed to initialize LLM pipeline:', error);
-      throw new Error(`Failed to load LLM model: ${error.message}`);
-    } finally {
+    } catch (error) {} finally {
       this.isLoading = false;
     }

[NoCoverage] BlockStatement
src/llm.js:98:15
     } catch (error) {
       console.error('Failed to initialize LLM pipeline:', error);
       throw new Error(`Failed to load LLM model: ${error.message}`);
-    } finally {
-      this.isLoading = false;
-    }
+    } finally {}
   }
 

[NoCoverage] BooleanLiteral
src/llm.js:99:24
       console.error('Failed to initialize LLM pipeline:', error);
       throw new Error(`Failed to load LLM model: ${error.message}`);
     } finally {
-      this.isLoading = false;
+      this.isLoading = true;
     }
   }

[NoCoverage] BooleanLiteral
src/llm.js:110:18
       maxNewTokens = 256,
       temperature = 0.8,
       topP = 0.95,
-      doSample = true
+      doSample = false
     } = options;
 

[NoCoverage] BlockStatement
src/llm.js:113:9
       doSample = true
     } = options;
 
-    try {
-      // Ensure pipeline is initialized
-      const pipeline = await this.initializePipeline(onProgress);
-
-      // Format prompt for instruction-tuned model
-      const formattedPrompt = this.formatPrompt(prompt);
-
-      // Generate with streaming-enabled pipeline
-      const generator = await pipeline(formattedPrompt, {
-        max_new_tokens: maxNewTokens,
-        temperature: temperature,
-        top_p: topP,
-        do_sample: doSample,
-        return_full_text: false,
-        streamer_callback: onToken
-      });
-
-      // Delegate handling to helpers for clarity (streaming vs non-streaming)
-      if (generator && typeof generator[Symbol.asyncIterator] === 'function') {
-        return await this._handleStreamingGenerator(generator, onToken);
-      }
-
-      return await this._handleNonStreamingResult(generator, onToken);
-
-    } catch (error) {
+    try {} catch (error) {
       console.error('Generation failed:', error);
       throw new Error(`Text generation failed: ${error.message}`);

[NoCoverage] BooleanLiteral
src/llm.js:126:27
         temperature: temperature,
         top_p: topP,
         do_sample: doSample,
-        return_full_text: false,
+        return_full_text: true,
         streamer_callback: onToken
       });

[NoCoverage] ConditionalExpression
src/llm.js:131:11
       });
 
       // Delegate handling to helpers for clarity (streaming vs non-streaming)
-      if (generator && typeof generator[Symbol.asyncIterator] === 'function') {
+      if (false) {
         return await this._handleStreamingGenerator(generator, onToken);
       }

[NoCoverage] LogicalOperator
src/llm.js:131:11
       });
 
       // Delegate handling to helpers for clarity (streaming vs non-streaming)
-      if (generator && typeof generator[Symbol.asyncIterator] === 'function') {
+      if (generator || typeof generator[Symbol.asyncIterator] === 'function') {
         return await this._handleStreamingGenerator(generator, onToken);
       }

[NoCoverage] BlockStatement
src/llm.js:137:21
 
       return await this._handleNonStreamingResult(generator, onToken);
 
-    } catch (error) {
-      console.error('Generation failed:', error);
-      throw new Error(`Text generation failed: ${error.message}`);
-    }
+    } catch (error) {}
   }
 

[NoCoverage] StringLiteral
src/llm.js:139:23
 
     } catch (error) {
       console.error('Generation failed:', error);
-      throw new Error(`Text generation failed: ${error.message}`);
+      throw new Error(``);
     }
   }

[NoCoverage] BlockStatement
src/llm.js:143:55
     }
   }
 
-  async _handleStreamingGenerator(generator, onToken) {
-    let fullText = '';
-    for await (const chunk of generator) {
-      const token = this.extractToken(chunk);
-      if (token) {
-        fullText += token;
-        onToken?.(token);
-      }
-    }
-    return fullText;
-  }
+  async _handleStreamingGenerator(generator, onToken) {}
 
   async _handleNonStreamingResult(generator, onToken) {

[NoCoverage] BlockStatement
src/llm.js:145:42
 
   async _handleStreamingGenerator(generator, onToken) {
     let fullText = '';
-    for await (const chunk of generator) {
-      const token = this.extractToken(chunk);
-      if (token) {
-        fullText += token;
-        onToken?.(token);
-      }
-    }
+    for await (const chunk of generator) {}
     return fullText;
   }

[NoCoverage] BlockStatement
src/llm.js:147:18
     let fullText = '';
     for await (const chunk of generator) {
       const token = this.extractToken(chunk);
-      if (token) {
-        fullText += token;
-        onToken?.(token);
-      }
+      if (token) {}
     }
     return fullText;

[NoCoverage] ConditionalExpression
src/llm.js:147:11
     let fullText = '';
     for await (const chunk of generator) {
       const token = this.extractToken(chunk);
-      if (token) {
+      if (true) {
         fullText += token;
         onToken?.(token);

[NoCoverage] AssignmentOperator
src/llm.js:148:9
     for await (const chunk of generator) {
       const token = this.extractToken(chunk);
       if (token) {
-        fullText += token;
+        fullText -= token;
         onToken?.(token);
       }

[NoCoverage] OptionalChaining
src/llm.js:149:9
       const token = this.extractToken(chunk);
       if (token) {
         fullText += token;
-        onToken?.(token);
+        onToken(token);
       }
     }

[NoCoverage] BlockStatement
src/llm.js:155:55
     return fullText;
   }
 
-  async _handleNonStreamingResult(generator, onToken) {
-    const result = Array.isArray(generator) ? generator[0] : generator;
-    const text = result?.generated_text || result?.text || '';
-
-    // Simulate streaming for consistency
-    if (onToken && text) {
-      const tokens = this.tokenizeForDisplay(text);
-      for (const token of tokens) {
-        onToken(token);
-        await new Promise(resolve => setTimeout(resolve, 50));
-      }
-    }
-
-    return text;
-  }
+  async _handleNonStreamingResult(generator, onToken) {}
 
   formatPrompt(prompt) {

[NoCoverage] ConditionalExpression
src/llm.js:157:18
 
   async _handleNonStreamingResult(generator, onToken) {
     const result = Array.isArray(generator) ? generator[0] : generator;
-    const text = result?.generated_text || result?.text || '';
+    const text = true;
 
     // Simulate streaming for consistency

[NoCoverage] OptionalChaining
src/llm.js:157:18
 
   async _handleNonStreamingResult(generator, onToken) {
     const result = Array.isArray(generator) ? generator[0] : generator;
-    const text = result?.generated_text || result?.text || '';
+    const text = result.generated_text || result?.text || '';
 
     // Simulate streaming for consistency

[NoCoverage] ConditionalExpression
src/llm.js:160:9
     const text = result?.generated_text || result?.text || '';
 
     // Simulate streaming for consistency
-    if (onToken && text) {
+    if (true) {
       const tokens = this.tokenizeForDisplay(text);
       for (const token of tokens) {

[NoCoverage] LogicalOperator
src/llm.js:160:9
     const text = result?.generated_text || result?.text || '';
 
     // Simulate streaming for consistency
-    if (onToken && text) {
+    if (onToken || text) {
       const tokens = this.tokenizeForDisplay(text);
       for (const token of tokens) {

[NoCoverage] BlockStatement
src/llm.js:162:35
     // Simulate streaming for consistency
     if (onToken && text) {
       const tokens = this.tokenizeForDisplay(text);
-      for (const token of tokens) {
-        onToken(token);
-        await new Promise(resolve => setTimeout(resolve, 50));
-      }
+      for (const token of tokens) {}
     }
 

[NoCoverage] ArrowFunction
src/llm.js:164:27
       const tokens = this.tokenizeForDisplay(text);
       for (const token of tokens) {
         onToken(token);
-        await new Promise(resolve => setTimeout(resolve, 50));
+        await new Promise(() => undefined);
       }
     }

[NoCoverage] BlockStatement
src/llm.js:171:24
     return text;
   }
 
-  formatPrompt(prompt) {
-    // Format for instruction-tuned models (Qwen2.5 format)
-    return `<|im_start|>system
-You are a helpful assistant.<|im_end|>
-<|im_start|>user
-${prompt}<|im_end|>
-<|im_start|>assistant
-`;
-  }
+  formatPrompt(prompt) {}
 
   extractToken(chunk) {

[NoCoverage] BlockStatement
src/llm.js:181:23
 `;
   }
 
-  extractToken(chunk) {
-    // Extract token from different possible chunk formats
-    if (typeof chunk === 'string') {
-      return chunk;
-    }
-    if (chunk && chunk.token) {
-      return chunk.token.text || chunk.token;
-    }
-    if (chunk && chunk.generated_text) {
-      return chunk.generated_text;
-    }
-    return '';
-  }
+  extractToken(chunk) {}
 
   tokenizeForDisplay(text) {

[NoCoverage] ConditionalExpression
src/llm.js:183:9
 
   extractToken(chunk) {
     // Extract token from different possible chunk formats
-    if (typeof chunk === 'string') {
+    if (true) {
       return chunk;
     }

[NoCoverage] EqualityOperator
src/llm.js:183:9
 
   extractToken(chunk) {
     // Extract token from different possible chunk formats
-    if (typeof chunk === 'string') {
+    if (typeof chunk !== 'string') {
       return chunk;
     }

[NoCoverage] ConditionalExpression
src/llm.js:186:9
     if (typeof chunk === 'string') {
       return chunk;
     }
-    if (chunk && chunk.token) {
+    if (true) {
       return chunk.token.text || chunk.token;
     }

[NoCoverage] ConditionalExpression
src/llm.js:186:9
     if (typeof chunk === 'string') {
       return chunk;
     }
-    if (chunk && chunk.token) {
+    if (false) {
       return chunk.token.text || chunk.token;
     }

[NoCoverage] ConditionalExpression
src/llm.js:187:14
       return chunk;
     }
     if (chunk && chunk.token) {
-      return chunk.token.text || chunk.token;
+      return false;
     }
     if (chunk && chunk.generated_text) {

[NoCoverage] LogicalOperator
src/llm.js:187:14
       return chunk;
     }
     if (chunk && chunk.token) {
-      return chunk.token.text || chunk.token;
+      return chunk.token.text && chunk.token;
     }
     if (chunk && chunk.generated_text) {

[NoCoverage] BlockStatement
src/llm.js:189:40
     if (chunk && chunk.token) {
       return chunk.token.text || chunk.token;
     }
-    if (chunk && chunk.generated_text) {
-      return chunk.generated_text;
-    }
+    if (chunk && chunk.generated_text) {}
     return '';
   }

[NoCoverage] ConditionalExpression
src/llm.js:189:9
     if (chunk && chunk.token) {
       return chunk.token.text || chunk.token;
     }
-    if (chunk && chunk.generated_text) {
+    if (true) {
       return chunk.generated_text;
     }

[NoCoverage] BlockStatement
src/llm.js:195:28
     return '';
   }
 
-  tokenizeForDisplay(text) {
-    // Simple tokenization for display purposes
-    // In a real implementation, this could use the model's actual tokenizer
-    const words = text.split(/(\s+)/);
-    const tokens = [];
-    
-    for (const word of words) {
-      if (word.length > 0) {
-        tokens.push(word);
-      }
-    }
-    
-    return tokens;
-  }
+  tokenizeForDisplay(text) {}
 
   getDevice() {

[NoCoverage] Regex
src/llm.js:198:30
   tokenizeForDisplay(text) {
     // Simple tokenization for display purposes
     // In a real implementation, this could use the model's actual tokenizer
-    const words = text.split(/(\s+)/);
+    const words = text.split(/(\s)/);
     const tokens = [];
     

[NoCoverage] BlockStatement
src/llm.js:201:31
     const words = text.split(/(\s+)/);
     const tokens = [];
     
-    for (const word of words) {
-      if (word.length > 0) {
-        tokens.push(word);
-      }
-    }
+    for (const word of words) {}
     
     return tokens;

[NoCoverage] EqualityOperator
src/llm.js:202:11
     const tokens = [];
     
     for (const word of words) {
-      if (word.length > 0) {
+      if (word.length <= 0) {
         tokens.push(word);
       }

[NoCoverage] ConditionalExpression
src/llm.js:202:11
     const tokens = [];
     
     for (const word of words) {
-      if (word.length > 0) {
+      if (false) {
         tokens.push(word);
       }

[NoCoverage] BlockStatement
src/llm.js:210:15
     return tokens;
   }
 
-  getDevice() {
-    return this.device;
-  }
+  getDevice() {}
 
   getModelId() {

[NoCoverage] BlockStatement
src/llm.js:214:16
     return this.device;
   }
 
-  getModelId() {
-    return LLM_MODEL_ID;
-  }
+  getModelId() {}
 
   isInitialized() {

[NoCoverage] BlockStatement
src/llm.js:218:19
     return LLM_MODEL_ID;
   }
 
-  isInitialized() {
-    return this.pipeline !== null;
-  }
+  isInitialized() {}
 }
 

[NoCoverage] ConditionalExpression
src/llm.js:219:12
   }
 
   isInitialized() {
-    return this.pipeline !== null;
+    return false;
   }
 }

[NoCoverage] ConditionalExpression
src/llm.js:219:12
   }
 
   isInitialized() {
-    return this.pipeline !== null;
+    return true;
   }
 }
