[Killed] BooleanLiteral
src/tts.js:2:32
 // Configuration
-const FALLBACK_TO_WEB_SPEECH = true;
+const FALLBACK_TO_WEB_SPEECH = false;
 
 export class TTSModule {
killedBy: TTSModule - Comprehensive Coverage speak method should initialize and speak with web speech when Kokoro unavailable
statusReason: Error: No TTS system available

[Killed] BlockStatement
src/tts.js:5:17
 const FALLBACK_TO_WEB_SPEECH = true;
 
 export class TTSModule {
-  constructor() {
-    this.kokoroModel = null;
-    this.useWebSpeech = false;
-    this.isLoading = false;
-    this.currentUtterance = null;
-    this.currentSplitter = null;
-    this.sentences = [];
-    this.currentSentenceIndex = 0;
-    this.isPaused = false;
-    this.isStopped = false;
-    
-    // Settings
-    this.rate = 1.0;
-    this.pitch = 1.0;
-    this.selectedVoice = null;
-    
-    this.initializeWebSpeech();
-  }
+  constructor() {}
 
   initializeWebSpeech() {
killedBy: TTSModule - Comprehensive Coverage TTSModule state and configuration isKokoroAvailable should return false initially
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/tts.js:7:25
 export class TTSModule {
   constructor() {
     this.kokoroModel = null;
-    this.useWebSpeech = false;
+    this.useWebSpeech = true;
     this.isLoading = false;
     this.currentUtterance = null;
killedBy: TTSModule - Comprehensive Coverage TTSModule state and configuration getCurrentSystem should report correct TTS system
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "none"
Received: "web-speech"

[Timeout] BooleanLiteral
src/tts.js:8:22
   constructor() {
     this.kokoroModel = null;
     this.useWebSpeech = false;
-    this.isLoading = false;
+    this.isLoading = true;
     this.currentUtterance = null;
     this.currentSplitter = null;

[Timeout] BooleanLiteral
src/tts.js:13:21
     this.currentSplitter = null;
     this.sentences = [];
     this.currentSentenceIndex = 0;
-    this.isPaused = false;
+    this.isPaused = true;
     this.isStopped = false;
     

[Killed] BooleanLiteral
src/tts.js:14:22
     this.sentences = [];
     this.currentSentenceIndex = 0;
     this.isPaused = false;
-    this.isStopped = false;
+    this.isStopped = true;
     
     // Settings
killedBy: TTSModule - Comprehensive Coverage speakWithWebSpeech should speak sentences using Web Speech API
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

[Survived] BlockStatement
src/tts.js:24:25
     this.initializeWebSpeech();
   }
 
-  initializeWebSpeech() {
-    if ('speechSynthesis' in window && speechSynthesis) {
-      // Load voices
-      this.loadVoices();
-      
-      // Handle voice changes
-      speechSynthesis.addEventListener('voiceschanged', () => {
-        this.loadVoices();
-      });
-    }
-  }
+  initializeWebSpeech() {}
 
   loadVoices() {

[Killed] ConditionalExpression
src/tts.js:25:9
   }
 
   initializeWebSpeech() {
-    if ('speechSynthesis' in window && speechSynthesis) {
+    if (true) {
       // Load voices
       this.loadVoices();
killedBy: TTSModule speakWithKokoro should throw error when no TTS system available
statusReason: TypeError: Cannot read properties of undefined (reading 'addEventListener')

[Survived] BlockStatement
src/tts.js:25:57
   }
 
   initializeWebSpeech() {
-    if ('speechSynthesis' in window && speechSynthesis) {
-      // Load voices
-      this.loadVoices();
-      
-      // Handle voice changes
-      speechSynthesis.addEventListener('voiceschanged', () => {
-        this.loadVoices();
-      });
-    }
+    if ('speechSynthesis' in window && speechSynthesis) {}
   }
 

[NoCoverage] BlockStatement
src/tts.js:30:63
       this.loadVoices();
       
       // Handle voice changes
-      speechSynthesis.addEventListener('voiceschanged', () => {
-        this.loadVoices();
-      });
+      speechSynthesis.addEventListener('voiceschanged', () => {});
     }
   }

[Killed] ConditionalExpression
src/tts.js:37:9
   }
 
   loadVoices() {
-    if (!('speechSynthesis' in window) || !speechSynthesis) return;
+    if (false) return;
     
     const voices = speechSynthesis.getVoices();
killedBy: TTSModule - Comprehensive Coverage loadVoices should handle no speechSynthesis
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "Cannot read properties of undefined (reading 'getVoices')"

      103 |       stryCov_9fa48("564");
    > 105 |       const voices = speechSynthesis.getVoices();

[Killed] BooleanLiteral
src/tts.js:37:9
   }
 
   loadVoices() {
-    if (!('speechSynthesis' in window) || !speechSynthesis) return;
+    if ('speechSynthesis' in window || !speechSynthesis) return;
     
     const voices = speechSynthesis.getVoices();
killedBy: TTSModule - Comprehensive Coverage loadVoices should load voices and populate voice selector
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] LogicalOperator
src/tts.js:40:26
     if (!('speechSynthesis' in window) || !speechSynthesis) return;
     
     const voices = speechSynthesis.getVoices();
-    const voiceSelect = (typeof document !== 'undefined' && typeof document.getElementById === 'function')
+    const voiceSelect = (typeof document !== 'undefined' || typeof document.getElementById === 'function')
       ? document.getElementById('tts-voice')
       : null;
killedBy: TTSModule speakWithKokoro should initialize Kokoro model with WebGPU
statusReason: ReferenceError: document is not defined

[Killed] EqualityOperator
src/tts.js:40:26
     if (!('speechSynthesis' in window) || !speechSynthesis) return;
     
     const voices = speechSynthesis.getVoices();
-    const voiceSelect = (typeof document !== 'undefined' && typeof document.getElementById === 'function')
+    const voiceSelect = (typeof document === 'undefined' && typeof document.getElementById === 'function')
       ? document.getElementById('tts-voice')
       : null;
killedBy: TTSModule speakWithKokoro should initialize Kokoro model with WebGPU
statusReason: ReferenceError: document is not defined

[Survived] StringLiteral
src/tts.js:41:33
     
     const voices = speechSynthesis.getVoices();
     const voiceSelect = (typeof document !== 'undefined' && typeof document.getElementById === 'function')
-      ? document.getElementById('tts-voice')
+      ? document.getElementById("")
       : null;
 

[Killed] ConditionalExpression
src/tts.js:44:9
       ? document.getElementById('tts-voice')
       : null;
 
-    if (voiceSelect && voices.length > 0) {
+    if (false) {
       // Best-effort: only set innerHTML if supported
       if (typeof voiceSelect.innerHTML === 'string') {
killedBy: TTSModule - Comprehensive Coverage loadVoices should load voices and populate voice selector
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

[Killed] ConditionalExpression
src/tts.js:44:9
       ? document.getElementById('tts-voice')
       : null;
 
-    if (voiceSelect && voices.length > 0) {
+    if (true) {
       // Best-effort: only set innerHTML if supported
       if (typeof voiceSelect.innerHTML === 'string') {
killedBy: TTSModule - Comprehensive Coverage loadVoices should load voices and populate voice selector
statusReason: TypeError: Cannot read properties of undefined (reading 'innerHTML')

[Survived] EqualityOperator
src/tts.js:46:11
 
     if (voiceSelect && voices.length > 0) {
       // Best-effort: only set innerHTML if supported
-      if (typeof voiceSelect.innerHTML === 'string') {
+      if (typeof voiceSelect.innerHTML !== 'string') {
         voiceSelect.innerHTML = '';
       }

[Survived] ConditionalExpression
src/tts.js:46:11
 
     if (voiceSelect && voices.length > 0) {
       // Best-effort: only set innerHTML if supported
-      if (typeof voiceSelect.innerHTML === 'string') {
+      if (true) {
         voiceSelect.innerHTML = '';
       }

[Killed] BlockStatement
src/tts.js:50:40
         voiceSelect.innerHTML = '';
       }
 
-      voices.forEach((voice, index) => {
-        const option = (typeof document !== 'undefined' && typeof document.createElement === 'function')
-          ? document.createElement('option')
-          : { value: '', textContent: '', selected: false };
-
-        option.value = index;
-        option.textContent = `${voice.name} (${voice.lang})`;
-        if (voice.default) {
-          option.selected = true;
-          this.selectedVoice = voice;
-        }
-
-        // Append option in a safe manner depending on what's available on the mocked element
-        if (typeof voiceSelect.appendChild === 'function') {
-          voiceSelect.appendChild(option);
-        } else if (typeof voiceSelect.append === 'function') {
-          try { voiceSelect.append(option); } catch { /* ignore */ }
-        } else {
-          // If append isn't available, store options array so tests can inspect if needed
-          voiceSelect.options = voiceSelect.options || [];
-          voiceSelect.options.push(option);
-        }
-      });
+      voices.forEach((voice, index) => {});
 
       if (!this.selectedVoice && voices.length > 0) {
killedBy: TTSModule - Comprehensive Coverage loadVoices should load voices and populate voice selector
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

[Survived] ConditionalExpression
src/tts.js:51:60
       }
 
       voices.forEach((voice, index) => {
-        const option = (typeof document !== 'undefined' && typeof document.createElement === 'function')
+        const option = (typeof document !== 'undefined' && true)
           ? document.createElement('option')
           : { value: '', textContent: '', selected: false };

[Survived] ConditionalExpression
src/tts.js:51:25
       }
 
       voices.forEach((voice, index) => {
-        const option = (typeof document !== 'undefined' && typeof document.createElement === 'function')
+        const option = (false)
           ? document.createElement('option')
           : { value: '', textContent: '', selected: false };

[NoCoverage] BooleanLiteral
src/tts.js:53:53
       voices.forEach((voice, index) => {
         const option = (typeof document !== 'undefined' && typeof document.createElement === 'function')
           ? document.createElement('option')
-          : { value: '', textContent: '', selected: false };
+          : { value: '', textContent: '', selected: true };
 
         option.value = index;

[Killed] ConditionalExpression
src/tts.js:57:13
 
         option.value = index;
         option.textContent = `${voice.name} (${voice.lang})`;
-        if (voice.default) {
+        if (true) {
           option.selected = true;
           this.selectedVoice = voice;
killedBy: TTSModule - Comprehensive Coverage loadVoices should load voices and populate voice selector
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "English Voice"
Received: "Spanish Voice"

[Survived] ConditionalExpression
src/tts.js:57:13
 
         option.value = index;
         option.textContent = `${voice.name} (${voice.lang})`;
-        if (voice.default) {
+        if (false) {
           option.selected = true;
           this.selectedVoice = voice;

[Survived] BooleanLiteral
src/tts.js:58:29
         option.value = index;
         option.textContent = `${voice.name} (${voice.lang})`;
         if (voice.default) {
-          option.selected = true;
+          option.selected = false;
           this.selectedVoice = voice;
         }

[Killed] EqualityOperator
src/tts.js:63:13
         }
 
         // Append option in a safe manner depending on what's available on the mocked element
-        if (typeof voiceSelect.appendChild === 'function') {
+        if (typeof voiceSelect.appendChild !== 'function') {
           voiceSelect.appendChild(option);
         } else if (typeof voiceSelect.append === 'function') {
killedBy: TTSModule - Comprehensive Coverage loadVoices should load voices and populate voice selector
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

[Killed] ConditionalExpression
src/tts.js:63:13
         }
 
         // Append option in a safe manner depending on what's available on the mocked element
-        if (typeof voiceSelect.appendChild === 'function') {
+        if (false) {
           voiceSelect.appendChild(option);
         } else if (typeof voiceSelect.append === 'function') {
killedBy: TTSModule - Comprehensive Coverage loadVoices should load voices and populate voice selector
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

[Killed] EqualityOperator
src/tts.js:65:20
         // Append option in a safe manner depending on what's available on the mocked element
         if (typeof voiceSelect.appendChild === 'function') {
           voiceSelect.appendChild(option);
-        } else if (typeof voiceSelect.append === 'function') {
+        } else if (typeof voiceSelect.append !== 'function') {
           try { voiceSelect.append(option); } catch { /* ignore */ }
         } else {
killedBy: TTSModule - Comprehensive Coverage Additional Tests should handle loading voices when appendChild and append are not available
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ConditionalExpression
src/tts.js:65:20
         // Append option in a safe manner depending on what's available on the mocked element
         if (typeof voiceSelect.appendChild === 'function') {
           voiceSelect.appendChild(option);
-        } else if (typeof voiceSelect.append === 'function') {
+        } else if (true) {
           try { voiceSelect.append(option); } catch { /* ignore */ }
         } else {
killedBy: TTSModule - Comprehensive Coverage Additional Tests should handle loading voices when appendChild and append are not available
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[NoCoverage] BlockStatement
src/tts.js:66:15
         if (typeof voiceSelect.appendChild === 'function') {
           voiceSelect.appendChild(option);
         } else if (typeof voiceSelect.append === 'function') {
-          try { voiceSelect.append(option); } catch { /* ignore */ }
+          try {} catch { /* ignore */ }
         } else {
           // If append isn't available, store options array so tests can inspect if needed

[Killed] BlockStatement
src/tts.js:67:16
           voiceSelect.appendChild(option);
         } else if (typeof voiceSelect.append === 'function') {
           try { voiceSelect.append(option); } catch { /* ignore */ }
-        } else {
-          // If append isn't available, store options array so tests can inspect if needed
-          voiceSelect.options = voiceSelect.options || [];
-          voiceSelect.options.push(option);
-        }
+        } else {}
       });
 
killedBy: TTSModule - Comprehensive Coverage Additional Tests should handle loading voices when appendChild and append are not available
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] LogicalOperator
src/tts.js:69:33
           try { voiceSelect.append(option); } catch { /* ignore */ }
         } else {
           // If append isn't available, store options array so tests can inspect if needed
-          voiceSelect.options = voiceSelect.options || [];
+          voiceSelect.options = voiceSelect.options && [];
           voiceSelect.options.push(option);
         }
killedBy: TTSModule - Comprehensive Coverage Additional Tests should handle loading voices when appendChild and append are not available
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] ConditionalExpression
src/tts.js:69:33
           try { voiceSelect.append(option); } catch { /* ignore */ }
         } else {
           // If append isn't available, store options array so tests can inspect if needed
-          voiceSelect.options = voiceSelect.options || [];
+          voiceSelect.options = true;
           voiceSelect.options.push(option);
         }
killedBy: TTSModule - Comprehensive Coverage Additional Tests should handle loading voices when appendChild and append are not available
statusReason: TypeError: voiceSelect.options.push is not a function

[Killed] BooleanLiteral
src/tts.js:74:11
         }
       });
 
-      if (!this.selectedVoice && voices.length > 0) {
+      if (this.selectedVoice && voices.length > 0) {
         this.selectedVoice = voices[0];
       }
killedBy: TTSModule - Comprehensive Coverage loadVoices should select first voice if no default voice
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"default": false, "lang": "en-US", "name": "Voice 1"}
Received: null

[Killed] ConditionalExpression
src/tts.js:74:11
         }
       });
 
-      if (!this.selectedVoice && voices.length > 0) {
+      if (false) {
         this.selectedVoice = voices[0];
       }
killedBy: TTSModule - Comprehensive Coverage loadVoices should select first voice if no default voice
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"default": false, "lang": "en-US", "name": "Voice 1"}
Received: null

[Killed] BlockStatement
src/tts.js:80:38
     }
   }
 
-  async initializeKokoro(onProgress) {
-    if (this.kokoroModel) return this.kokoroModel;
-    if (this.isLoading) {
-      return await this._waitForLoading();
-    }
-
-    this.isLoading = true;
-
-    try {
-      return await this._loadKokoroModel(onProgress);
-    } catch (error) {
-      return this._handleKokoroLoadError(error, onProgress);
-    } finally {
-      this.isLoading = false;
-    }
-  }
+  async initializeKokoro(onProgress) {}
 
   async _waitForLoading() {
killedBy: TTSModule - Comprehensive Coverage speak method should initialize and speak with web speech when Kokoro unavailable
statusReason: Error: WebGPU is required for Kokoro TTS

[Killed] ConditionalExpression
src/tts.js:81:9
   }
 
   async initializeKokoro(onProgress) {
-    if (this.kokoroModel) return this.kokoroModel;
+    if (true) return this.kokoroModel;
     if (this.isLoading) {
       return await this._waitForLoading();
killedBy: TTSModule - Comprehensive Coverage speak method should initialize and speak with web speech when Kokoro unavailable
statusReason: Error: WebGPU is required for Kokoro TTS

[Survived] ConditionalExpression
src/tts.js:81:9
   }
 
   async initializeKokoro(onProgress) {
-    if (this.kokoroModel) return this.kokoroModel;
+    if (false) return this.kokoroModel;
     if (this.isLoading) {
       return await this._waitForLoading();

[Killed] ConditionalExpression
src/tts.js:82:9
 
   async initializeKokoro(onProgress) {
     if (this.kokoroModel) return this.kokoroModel;
-    if (this.isLoading) {
+    if (false) {
       return await this._waitForLoading();
     }
killedBy: TTSModule - Comprehensive Coverage Additional Tests should wait if kokoro model is already loading
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "mockModel"
Received: {"stream": [Function mockConstructor]}

[Killed] ConditionalExpression
src/tts.js:82:9
 
   async initializeKokoro(onProgress) {
     if (this.kokoroModel) return this.kokoroModel;
-    if (this.isLoading) {
+    if (true) {
       return await this._waitForLoading();
     }
killedBy: TTSModule - Comprehensive Coverage speak method should initialize and speak with web speech when Kokoro unavailable
statusReason: Error: WebGPU is required for Kokoro TTS

[Killed] BlockStatement
src/tts.js:88:9
 
     this.isLoading = true;
 
-    try {
-      return await this._loadKokoroModel(onProgress);
-    } catch (error) {
+    try {} catch (error) {
       return this._handleKokoroLoadError(error, onProgress);
     } finally {
killedBy: TTSModule - Comprehensive Coverage speak method should initialize and speak with web speech when Kokoro unavailable
statusReason: Error: WebGPU is required for Kokoro TTS

[Killed] BlockStatement
src/tts.js:90:21
 
     try {
       return await this._loadKokoroModel(onProgress);
-    } catch (error) {
-      return this._handleKokoroLoadError(error, onProgress);
-    } finally {
+    } catch (error) {} finally {
       this.isLoading = false;
     }
killedBy: TTSModule speakWithKokoro should fall back to Web Speech when WebGPU unavailable
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "web-speech"
Received: undefined

[Killed] BlockStatement
src/tts.js:92:15
       return await this._loadKokoroModel(onProgress);
     } catch (error) {
       return this._handleKokoroLoadError(error, onProgress);
-    } finally {
-      this.isLoading = false;
-    }
+    } finally {}
   }
 
killedBy: TTSModule - Comprehensive Coverage TTSModule state and configuration getCurrentSystem should report correct TTS system
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/tts.js:97:27
     }
   }
 
-  async _waitForLoading() {
-    while (this.isLoading) {
-      await new Promise(resolve => setTimeout(resolve, 100));
-    }
-    return this.kokoroModel;
-  }
+  async _waitForLoading() {}
 
   async _loadKokoroModel(onProgress) {
killedBy: TTSModule - Comprehensive Coverage Additional Tests should wait if kokoro model is already loading
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "mockModel"
Received: null

[Killed] ConditionalExpression
src/tts.js:98:12
   }
 
   async _waitForLoading() {
-    while (this.isLoading) {
+    while (false) {
       await new Promise(resolve => setTimeout(resolve, 100));
     }
killedBy: TTSModule - Comprehensive Coverage Additional Tests should wait if kokoro model is already loading
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "mockModel"
Received: null

[Timeout] BlockStatement
src/tts.js:98:28
   }
 
   async _waitForLoading() {
-    while (this.isLoading) {
-      await new Promise(resolve => setTimeout(resolve, 100));
-    }
+    while (this.isLoading) {}
     return this.kokoroModel;
   }

[Killed] OptionalChaining
src/tts.js:105:5
   }
 
   async _loadKokoroModel(onProgress) {
-    onProgress?.({ percentage: 0, text: 'Loading Kokoro TTS model...' });
+    onProgress({
+  percentage: 0,
+  text: 'Loading Kokoro TTS model...'
+});
     
     // Check for WebGPU availability first
killedBy: TTSModule - Comprehensive Coverage TTSModule state and configuration isKokoroAvailable should return true after initialization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
src/tts.js:105:41
   }
 
   async _loadKokoroModel(onProgress) {
-    onProgress?.({ percentage: 0, text: 'Loading Kokoro TTS model...' });
+    onProgress?.({ percentage: 0, text: "" });
     
     // Check for WebGPU availability first
killedBy: TTSModule - Comprehensive Coverage Additional Tests should call onProgress during kokoro initialization
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"percentage": 0, "text": "Loading Kokoro TTS model..."}
Received
       1
          Object {
            "percentage": 0,
        -   "text": "Loading Kokoro TTS model...",

[Killed] BooleanLiteral
src/tts.js:108:9
     onProgress?.({ percentage: 0, text: 'Loading Kokoro TTS model...' });
     
     // Check for WebGPU availability first
-    if (!navigator.gpu) {
+    if (navigator.gpu) {
       throw new Error('WebGPU not available');
     }
killedBy: TTSModule - Comprehensive Coverage TTSModule state and configuration isKokoroAvailable should return true after initialization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/tts.js:108:9
     onProgress?.({ percentage: 0, text: 'Loading Kokoro TTS model...' });
     
     // Check for WebGPU availability first
-    if (!navigator.gpu) {
+    if (true) {
       throw new Error('WebGPU not available');
     }
killedBy: TTSModule - Comprehensive Coverage TTSModule state and configuration isKokoroAvailable should return true after initialization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] StringLiteral
src/tts.js:109:23
     
     // Check for WebGPU availability first
     if (!navigator.gpu) {
-      throw new Error('WebGPU not available');
+      throw new Error("");
     }
 

[Survived] StringLiteral
src/tts.js:116:14
     const { KokoroTTS } = await import('kokoro-js');
     
     this.kokoroModel = await KokoroTTS.from_pretrained("onnx-community/Kokoro-82M-v1.0-ONNX", {
-      dtype: "fp32",
+      dtype: "",
       device: "webgpu",
       progress_callback: (item) => {

[Survived] StringLiteral
src/tts.js:117:15
     
     this.kokoroModel = await KokoroTTS.from_pretrained("onnx-community/Kokoro-82M-v1.0-ONNX", {
       dtype: "fp32",
-      device: "webgpu",
+      device: "",
       progress_callback: (item) => {
         if (item.status === "progress" && item.file?.endsWith?.("onnx")) {

[Killed] BlockStatement
src/tts.js:118:36
     this.kokoroModel = await KokoroTTS.from_pretrained("onnx-community/Kokoro-82M-v1.0-ONNX", {
       dtype: "fp32",
       device: "webgpu",
-      progress_callback: (item) => {
-        if (item.status === "progress" && item.file?.endsWith?.("onnx")) {
-          const progress = Math.round(item.progress * 100);
-          onProgress?.({ percentage: progress, text: `Loading Kokoro model: ${progress}%` });
-        }
-      },
+      progress_callback: (item) => {},
     });
 
killedBy: TTSModule - Comprehensive Coverage Additional Tests should call onProgress during kokoro initialization
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"percentage": 50, "text": "Loading Kokoro model: 50%"}
Received
       1
          Object {
        -   "percentage": 50,
        -   "text": "Loading Kokoro model: 50%",

[Killed] EqualityOperator
src/tts.js:119:13
       dtype: "fp32",
       device: "webgpu",
       progress_callback: (item) => {
-        if (item.status === "progress" && item.file?.endsWith?.("onnx")) {
+        if (item.status !== "progress" && item.file?.endsWith?.("onnx")) {
           const progress = Math.round(item.progress * 100);
           onProgress?.({ percentage: progress, text: `Loading Kokoro model: ${progress}%` });
killedBy: TTSModule - Comprehensive Coverage Additional Tests should call onProgress during kokoro initialization
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"percentage": 50, "text": "Loading Kokoro model: 50%"}
Received
       1
          Object {
        -   "percentage": 50,
        -   "text": "Loading Kokoro model: 50%",

[Killed] MethodExpression
src/tts.js:119:43
       dtype: "fp32",
       device: "webgpu",
       progress_callback: (item) => {
-        if (item.status === "progress" && item.file?.endsWith?.("onnx")) {
+        if (item.status === "progress" && item.file?.startsWith?.("onnx")) {
           const progress = Math.round(item.progress * 100);
           onProgress?.({ percentage: progress, text: `Loading Kokoro model: ${progress}%` });
killedBy: TTSModule - Comprehensive Coverage Additional Tests should call onProgress during kokoro initialization
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"percentage": 50, "text": "Loading Kokoro model: 50%"}
Received
       1
          Object {
        -   "percentage": 50,
        -   "text": "Loading Kokoro model: 50%",

[Killed] ArithmeticOperator
src/tts.js:120:39
       device: "webgpu",
       progress_callback: (item) => {
         if (item.status === "progress" && item.file?.endsWith?.("onnx")) {
-          const progress = Math.round(item.progress * 100);
+          const progress = Math.round(item.progress / 100);
           onProgress?.({ percentage: progress, text: `Loading Kokoro model: ${progress}%` });
         }
killedBy: TTSModule - Comprehensive Coverage Additional Tests should call onProgress during kokoro initialization
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"percentage": 50, "text": "Loading Kokoro model: 50%"}
Received
       1
          Object {
        -   "percentage": 50,
        -   "text": "Loading Kokoro model: 50%",

[Survived] OptionalChaining
src/tts.js:121:11
       progress_callback: (item) => {
         if (item.status === "progress" && item.file?.endsWith?.("onnx")) {
           const progress = Math.round(item.progress * 100);
-          onProgress?.({ percentage: progress, text: `Loading Kokoro model: ${progress}%` });
+          onProgress({
+  percentage: progress,
+  text: `Loading Kokoro model: ${progress}%`
+});
         }
       },

[Killed] OptionalChaining
src/tts.js:126:5
       },
     });
 
-    onProgress?.({ percentage: 100, text: 'Kokoro TTS loaded successfully' });
+    onProgress({
+  percentage: 100,
+  text: 'Kokoro TTS loaded successfully'
+});
     this.useWebSpeech = false;
     return this.kokoroModel;
killedBy: TTSModule - Comprehensive Coverage TTSModule state and configuration getCurrentSystem should report correct TTS system
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "kokoro"
Received: "web-speech"
