[Killed] ObjectLiteral
src/tts.js:126:18
       },
     });
 
-    onProgress?.({ percentage: 100, text: 'Kokoro TTS loaded successfully' });
+    onProgress?.({});
     this.useWebSpeech = false;
     return this.kokoroModel;
killedBy: TTSModule - Comprehensive Coverage Additional Tests should call onProgress during kokoro initialization
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"percentage": 100, "text": "Kokoro TTS loaded successfully"}
Received
       1
          Object {
        -   "percentage": 100,
        -   "text": "Kokoro TTS loaded successfully",

[Killed] BooleanLiteral
src/tts.js:127:25
     });
 
     onProgress?.({ percentage: 100, text: 'Kokoro TTS loaded successfully' });
-    this.useWebSpeech = false;
+    this.useWebSpeech = true;
     return this.kokoroModel;
   }
killedBy: TTSModule - Comprehensive Coverage TTSModule state and configuration getCurrentSystem should report correct TTS system
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "kokoro"
Received: "web-speech"

[Killed] BlockStatement
src/tts.js:131:45
     return this.kokoroModel;
   }
 
-  _handleKokoroLoadError(error, onProgress) {
-    console.warn('Kokoro TTS not available, falling back to Web Speech API:', error);
-
-    if (FALLBACK_TO_WEB_SPEECH && 'speechSynthesis' in window) {
-      this.useWebSpeech = true;
-      onProgress?.({ percentage: 100, text: 'Using Web Speech API' });
-      return 'web-speech';
-    } else {
-      throw new Error('No TTS system available');
-    }
-  }
+  _handleKokoroLoadError(error, onProgress) {}
 
   async _simulateModelLoad(onProgress) {
killedBy: TTSModule - Comprehensive Coverage speak method should initialize and speak with web speech when Kokoro unavailable
statusReason: Error: WebGPU is required for Kokoro TTS

[Killed] ConditionalExpression
src/tts.js:134:9
   _handleKokoroLoadError(error, onProgress) {
     console.warn('Kokoro TTS not available, falling back to Web Speech API:', error);
 
-    if (FALLBACK_TO_WEB_SPEECH && 'speechSynthesis' in window) {
+    if (true) {
       this.useWebSpeech = true;
       onProgress?.({ percentage: 100, text: 'Using Web Speech API' });
killedBy: TTSModule speakWithKokoro should throw error when no TTS system available
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: "web-speech"

[Killed] ConditionalExpression
src/tts.js:134:9
   _handleKokoroLoadError(error, onProgress) {
     console.warn('Kokoro TTS not available, falling back to Web Speech API:', error);
 
-    if (FALLBACK_TO_WEB_SPEECH && 'speechSynthesis' in window) {
+    if (false) {
       this.useWebSpeech = true;
       onProgress?.({ percentage: 100, text: 'Using Web Speech API' });
killedBy: TTSModule speakWithKokoro should fall back to Web Speech when WebGPU unavailable
statusReason: Error: No TTS system available

[Killed] BooleanLiteral
src/tts.js:135:27
     console.warn('Kokoro TTS not available, falling back to Web Speech API:', error);
 
     if (FALLBACK_TO_WEB_SPEECH && 'speechSynthesis' in window) {
-      this.useWebSpeech = true;
+      this.useWebSpeech = false;
       onProgress?.({ percentage: 100, text: 'Using Web Speech API' });
       return 'web-speech';
killedBy: TTSModule - Comprehensive Coverage speak method should initialize and speak with web speech when Kokoro unavailable
statusReason: Error: WebGPU is required for Kokoro TTS

[Killed] OptionalChaining
src/tts.js:136:7
 
     if (FALLBACK_TO_WEB_SPEECH && 'speechSynthesis' in window) {
       this.useWebSpeech = true;
-      onProgress?.({ percentage: 100, text: 'Using Web Speech API' });
+      onProgress({
+  percentage: 100,
+  text: 'Using Web Speech API'
+});
       return 'web-speech';
     } else {
killedBy: TTSModule - Comprehensive Coverage speak method should initialize and speak with web speech when Kokoro unavailable
statusReason: TypeError: onProgress is not a function

[Killed] ObjectLiteral
src/tts.js:136:20
 
     if (FALLBACK_TO_WEB_SPEECH && 'speechSynthesis' in window) {
       this.useWebSpeech = true;
-      onProgress?.({ percentage: 100, text: 'Using Web Speech API' });
+      onProgress?.({});
       return 'web-speech';
     } else {
killedBy: TTSModule speakWithKokoro should fall back to Web Speech when WebGPU unavailable
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"percentage": 100, "text": "Using Web Speech API"}
Received
       1
          Object {
        -   "percentage": 100,
        -   "text": "Using Web Speech API",

[Killed] BlockStatement
src/tts.js:138:12
       this.useWebSpeech = true;
       onProgress?.({ percentage: 100, text: 'Using Web Speech API' });
       return 'web-speech';
-    } else {
-      throw new Error('No TTS system available');
-    }
+    } else {}
   }
 
killedBy: TTSModule speakWithKokoro should throw error when no TTS system available
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] StringLiteral
src/tts.js:139:23
       onProgress?.({ percentage: 100, text: 'Using Web Speech API' });
       return 'web-speech';
     } else {
-      throw new Error('No TTS system available');
+      throw new Error("");
     }
   }
killedBy: TTSModule speakWithKokoro should throw error when no TTS system available
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "No TTS system available"
Received message:   ""

      332 |         } else {
      333 |           stryCov_9fa48("699");
    > 334 |           throw new Error(stryMutAct_9fa48("700") ? "" : (stryCov_9fa48("700"), 'No TTS system available'));

[NoCoverage] BlockStatement
src/tts.js:143:40
     }
   }
 
-  async _simulateModelLoad(onProgress) {
-    for (let i = 0; i <= 100; i += 10) {
-      onProgress?.({ percentage: i, text: `Loading Kokoro model: ${i}%` });
-      await new Promise(resolve => setTimeout(resolve, 100));
-    }
-  }
+  async _simulateModelLoad(onProgress) {}
 
   splitIntoSentences(text) {

[NoCoverage] AssignmentOperator
src/tts.js:144:31
   }
 
   async _simulateModelLoad(onProgress) {
-    for (let i = 0; i <= 100; i += 10) {
+    for (let i = 0; i <= 100; i -= 10) {
       onProgress?.({ percentage: i, text: `Loading Kokoro model: ${i}%` });
       await new Promise(resolve => setTimeout(resolve, 100));

[NoCoverage] EqualityOperator
src/tts.js:144:21
   }
 
   async _simulateModelLoad(onProgress) {
-    for (let i = 0; i <= 100; i += 10) {
+    for (let i = 0; i < 100; i += 10) {
       onProgress?.({ percentage: i, text: `Loading Kokoro model: ${i}%` });
       await new Promise(resolve => setTimeout(resolve, 100));

[NoCoverage] OptionalChaining
src/tts.js:145:7
 
   async _simulateModelLoad(onProgress) {
     for (let i = 0; i <= 100; i += 10) {
-      onProgress?.({ percentage: i, text: `Loading Kokoro model: ${i}%` });
+      onProgress({
+  percentage: i,
+  text: `Loading Kokoro model: ${i}%`
+});
       await new Promise(resolve => setTimeout(resolve, 100));
     }

[NoCoverage] ObjectLiteral
src/tts.js:145:20
 
   async _simulateModelLoad(onProgress) {
     for (let i = 0; i <= 100; i += 10) {
-      onProgress?.({ percentage: i, text: `Loading Kokoro model: ${i}%` });
+      onProgress?.({});
       await new Promise(resolve => setTimeout(resolve, 100));
     }

[NoCoverage] ArrowFunction
src/tts.js:146:25
   async _simulateModelLoad(onProgress) {
     for (let i = 0; i <= 100; i += 10) {
       onProgress?.({ percentage: i, text: `Loading Kokoro model: ${i}%` });
-      await new Promise(resolve => setTimeout(resolve, 100));
+      await new Promise(() => undefined);
     }
   }

[Killed] BlockStatement
src/tts.js:150:28
     }
   }
 
-  splitIntoSentences(text) {
-    // Simple sentence splitting
-    return text
-      .split(/[.!?]+/)
-      .map(s => s.trim())
-      .filter(s => s.length > 0)
-      .map(s => s + '.');
-  }
+  splitIntoSentences(text) {}
 
   async speak(text, options = {}) {
killedBy: TTSModule speakWithKokoro should handle speakWithKokoro with proper audio streaming
statusReason: Error: expect(received).resolves.toBeUndefined()

Received promise rejected instead of resolved
Rejected to value: [TypeError: Cannot read properties of undefined (reading 'forEach')]

[Killed] MethodExpression
src/tts.js:152:12
 
   splitIntoSentences(text) {
     // Simple sentence splitting
-    return text
-      .split(/[.!?]+/)
-      .map(s => s.trim())
-      .filter(s => s.length > 0)
+    return text.split(/[.!?]+/).map(s => s.trim())
       .map(s => s + '.');
   }
killedBy: TTSModule - Comprehensive Coverage splitIntoSentences should split text into sentences correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
    "Hello world.",
    "How are you.",

[Killed] Regex
src/tts.js:153:14
   splitIntoSentences(text) {
     // Simple sentence splitting
     return text
-      .split(/[.!?]+/)
+      .split(/[^.!?]+/)
       .map(s => s.trim())
       .filter(s => s.length > 0)
killedBy: TTSModule - Comprehensive Coverage splitIntoSentences should split text into sentences correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   "Hello world.",
-   "How are you.",

[Survived] Regex
src/tts.js:153:14
   splitIntoSentences(text) {
     // Simple sentence splitting
     return text
-      .split(/[.!?]+/)
+      .split(/[.!?]/)
       .map(s => s.trim())
       .filter(s => s.length > 0)

[Killed] ArrowFunction
src/tts.js:154:12
     // Simple sentence splitting
     return text
       .split(/[.!?]+/)
-      .map(s => s.trim())
+      .map(() => undefined)
       .filter(s => s.length > 0)
       .map(s => s + '.');
killedBy: TTSModule - Comprehensive Coverage splitIntoSentences should split text into sentences correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] MethodExpression
src/tts.js:154:17
     // Simple sentence splitting
     return text
       .split(/[.!?]+/)
-      .map(s => s.trim())
+      .map(s => s)
       .filter(s => s.length > 0)
       .map(s => s + '.');
killedBy: TTSModule - Comprehensive Coverage splitIntoSentences should split text into sentences correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    "Hello world.",
-   "How are you.",

[Killed] EqualityOperator
src/tts.js:155:20
     return text
       .split(/[.!?]+/)
       .map(s => s.trim())
-      .filter(s => s.length > 0)
+      .filter(s => s.length >= 0)
       .map(s => s + '.');
   }
killedBy: TTSModule - Comprehensive Coverage splitIntoSentences should split text into sentences correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
    "Hello world.",
    "How are you.",

[Killed] EqualityOperator
src/tts.js:155:20
     return text
       .split(/[.!?]+/)
       .map(s => s.trim())
-      .filter(s => s.length > 0)
+      .filter(s => s.length <= 0)
       .map(s => s + '.');
   }
killedBy: TTSModule - Comprehensive Coverage splitIntoSentences should split text into sentences correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

  Array [
-   "Hello world.",
-   "How are you.",

[Killed] ArrowFunction
src/tts.js:156:12
       .split(/[.!?]+/)
       .map(s => s.trim())
       .filter(s => s.length > 0)
-      .map(s => s + '.');
+      .map(() => undefined);
   }
 
killedBy: TTSModule - Comprehensive Coverage splitIntoSentences should split text into sentences correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   "Hello world.",
-   "How are you.",

[Killed] BlockStatement
src/tts.js:162:9
   async speak(text, options = {}) {
     const { outputElement, onProgress, audioModule } = options;
 
-    try {
-      // Initialize TTS system
-      await this.initializeKokoro(onProgress);
-      
-      // Split text into sentences
-      this.sentences = this.splitIntoSentences(text);
-      this.currentSentenceIndex = 0;
-      this.isStopped = false;
-      this.isPaused = false;
-
-      // Display sentences in output element
-      if (outputElement) {
-        this.displaySentences(outputElement);
-      }
-
-      if (this.useWebSpeech) {
-        await this.speakWithWebSpeech(outputElement);
-      } else {
-        await this.speakWithKokoro(audioModule, outputElement);
-      }
-
-    } catch (error) {
+    try {} catch (error) {
       console.error('TTS failed:', error);
       throw error;
killedBy: TTSModule - Comprehensive Coverage speak method should initialize and speak with web speech when Kokoro unavailable
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   "Hello world.",
-   "How are you.",

[Survived] BooleanLiteral
src/tts.js:169:24
       // Split text into sentences
       this.sentences = this.splitIntoSentences(text);
       this.currentSentenceIndex = 0;
-      this.isStopped = false;
+      this.isStopped = true;
       this.isPaused = false;
 

[Survived] BooleanLiteral
src/tts.js:170:23
       this.sentences = this.splitIntoSentences(text);
       this.currentSentenceIndex = 0;
       this.isStopped = false;
-      this.isPaused = false;
+      this.isPaused = true;
 
       // Display sentences in output element

[Survived] ConditionalExpression
src/tts.js:173:11
       this.isPaused = false;
 
       // Display sentences in output element
-      if (outputElement) {
+      if (false) {
         this.displaySentences(outputElement);
       }

[Survived] ConditionalExpression
src/tts.js:173:11
       this.isPaused = false;
 
       // Display sentences in output element
-      if (outputElement) {
+      if (true) {
         this.displaySentences(outputElement);
       }

[Killed] BlockStatement
src/tts.js:177:30
         this.displaySentences(outputElement);
       }
 
-      if (this.useWebSpeech) {
-        await this.speakWithWebSpeech(outputElement);
-      } else {
+      if (this.useWebSpeech) {} else {
         await this.speakWithKokoro(audioModule, outputElement);
       }
killedBy: TTSModule - Comprehensive Coverage speak method should initialize and speak with web speech when Kokoro unavailable
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/tts.js:177:11
         this.displaySentences(outputElement);
       }
 
-      if (this.useWebSpeech) {
+      if (false) {
         await this.speakWithWebSpeech(outputElement);
       } else {
killedBy: TTSModule - Comprehensive Coverage speak method should initialize and speak with web speech when Kokoro unavailable
statusReason: Error: WebGPU is required for Kokoro TTS

[NoCoverage] BlockStatement
src/tts.js:179:14
 
       if (this.useWebSpeech) {
         await this.speakWithWebSpeech(outputElement);
-      } else {
-        await this.speakWithKokoro(audioModule, outputElement);
-      }
+      } else {}
 
     } catch (error) {

[Killed] BlockStatement
src/tts.js:183:21
         await this.speakWithKokoro(audioModule, outputElement);
       }
 
-    } catch (error) {
-      console.error('TTS failed:', error);
-      throw error;
-    }
+    } catch (error) {}
   }
 
killedBy: TTSModule - Comprehensive Coverage speak method should handle TTS initialization errors
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/tts.js:189:35
     }
   }
 
-  displaySentences(outputElement) {
-    outputElement.innerHTML = '';
-    
-    this.sentences.forEach((sentence, index) => {
-      const span = document.createElement('span');
-      span.textContent = sentence + ' ';
-      span.id = `sentence-${index}`;
-      span.className = 'sentence';
-      outputElement.appendChild(span);
-    });
-  }
+  displaySentences(outputElement) {}
 
   async speakWithWebSpeech(outputElement) {
killedBy: TTSModule - Comprehensive Coverage displaySentences should create sentence spans in output element
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

[Killed] StringLiteral
src/tts.js:190:31
   }
 
   displaySentences(outputElement) {
-    outputElement.innerHTML = '';
+    outputElement.innerHTML = "Stryker was here!";
     
     this.sentences.forEach((sentence, index) => {
killedBy: TTSModule - Comprehensive Coverage displaySentences should create sentence spans in output element
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "Stryker was here!"

[Killed] BlockStatement
src/tts.js:192:49
   displaySentences(outputElement) {
     outputElement.innerHTML = '';
     
-    this.sentences.forEach((sentence, index) => {
-      const span = document.createElement('span');
-      span.textContent = sentence + ' ';
-      span.id = `sentence-${index}`;
-      span.className = 'sentence';
-      outputElement.appendChild(span);
-    });
+    this.sentences.forEach((sentence, index) => {});
   }
 
killedBy: TTSModule - Comprehensive Coverage displaySentences should create sentence spans in output element
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

[Killed] StringLiteral
src/tts.js:193:43
     outputElement.innerHTML = '';
     
     this.sentences.forEach((sentence, index) => {
-      const span = document.createElement('span');
+      const span = document.createElement("");
       span.textContent = sentence + ' ';
       span.id = `sentence-${index}`;
killedBy: TTSModule - Comprehensive Coverage displaySentences should create sentence spans in output element
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "span"
Received
       1: ""
       2: ""

Number of calls: 2

[Survived] StringLiteral
src/tts.js:194:37
     
     this.sentences.forEach((sentence, index) => {
       const span = document.createElement('span');
-      span.textContent = sentence + ' ';
+      span.textContent = sentence + "";
       span.id = `sentence-${index}`;
       span.className = 'sentence';

[Killed] ConditionalExpression
src/tts.js:206:13
       let currentIndex = 0;
 
       const speakNext = () => {
-        if (currentIndex >= this.sentences.length || this.isStopped) {
+        if (false || this.isStopped) {
           resolve();
           return;
killedBy: TTSModule - Comprehensive Coverage speakWithWebSpeech should speak sentences using Web Speech API
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] LogicalOperator
src/tts.js:206:13
       let currentIndex = 0;
 
       const speakNext = () => {
-        if (currentIndex >= this.sentences.length || this.isStopped) {
+        if (currentIndex >= this.sentences.length && this.isStopped) {
           resolve();
           return;
killedBy: TTSModule - Comprehensive Coverage speakWithWebSpeech should speak sentences using Web Speech API
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/tts.js:211:28
           return;
         }
 
-        if (this.isPaused) {
-          // Wait for resume
-          setTimeout(speakNext, 100);
-          return;
-        }
+        if (this.isPaused) {}
 
         const sentence = this.sentences[currentIndex];
killedBy: TTSModule - Comprehensive Coverage speakWithWebSpeech should handle pause state
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: {"onend": [Function anonymous], "onerror": [Function anonymous], "onstart": [Function anonymous], "pitch": 1, "rate": 1, "text": "Sentence 1", "voice": null}

[Survived] BlockStatement
src/tts.js:222:33
         this.currentUtterance = utterance;
 
         // Configure utterance
-        if (this.selectedVoice) {
-          utterance.voice = this.selectedVoice;
-        }
+        if (this.selectedVoice) {}
         utterance.rate = this.rate;
         utterance.pitch = this.pitch;

[Survived] ConditionalExpression
src/tts.js:222:13
         this.currentUtterance = utterance;
 
         // Configure utterance
-        if (this.selectedVoice) {
+        if (true) {
           utterance.voice = this.selectedVoice;
         }

[Survived] BlockStatement
src/tts.js:228:35
         utterance.rate = this.rate;
         utterance.pitch = this.pitch;
 
-        utterance.onstart = () => {
-          if (outputElement) {
-            this.markSentenceSpoken(currentIndex);
-          }
-        };
+        utterance.onstart = () => {};
 
         // Small safety timer in case the environment (or test mocks) do not

[Survived] ConditionalExpression
src/tts.js:229:15
         utterance.pitch = this.pitch;
 
         utterance.onstart = () => {
-          if (outputElement) {
+          if (false) {
             this.markSentenceSpoken(currentIndex);
           }

[Survived] BlockStatement
src/tts.js:229:30
         utterance.pitch = this.pitch;
 
         utterance.onstart = () => {
-          if (outputElement) {
-            this.markSentenceSpoken(currentIndex);
-          }
+          if (outputElement) {}
         };
 

[Killed] BlockStatement
src/tts.js:238:35
         // invoke the utterance callbacks. This prevents the promise from
         // hanging in test environments where speechSynthesis is a no-op.
         let safetyTimer = null;
-        const clearSafety = () => {
-          if (safetyTimer) {
-            clearTimeout(safetyTimer);
-            safetyTimer = null;
-          }
-        };
+        const clearSafety = () => {};
 
         utterance.onend = () => {
killedBy: TTSModule - Comprehensive Coverage speakWithWebSpeech should handle pause state
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

[Killed] BlockStatement
src/tts.js:239:28
         // hanging in test environments where speechSynthesis is a no-op.
         let safetyTimer = null;
         const clearSafety = () => {
-          if (safetyTimer) {
-            clearTimeout(safetyTimer);
-            safetyTimer = null;
-          }
+          if (safetyTimer) {}
         };
 
killedBy: TTSModule - Comprehensive Coverage speakWithWebSpeech should handle pause state
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

[Killed] ConditionalExpression
src/tts.js:239:15
         // hanging in test environments where speechSynthesis is a no-op.
         let safetyTimer = null;
         const clearSafety = () => {
-          if (safetyTimer) {
+          if (false) {
             clearTimeout(safetyTimer);
             safetyTimer = null;
killedBy: TTSModule - Comprehensive Coverage speakWithWebSpeech should handle pause state
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

[Killed] BlockStatement
src/tts.js:245:33
           }
         };
 
-        utterance.onend = () => {
-          clearSafety();
-          currentIndex++;
-          setTimeout(speakNext, 100); // Small delay between sentences
-        };
+        utterance.onend = () => {};
 
         // If onerror is called, also clear safety timer
killedBy: TTSModule - Comprehensive Coverage speakWithWebSpeech should speak sentences using Web Speech API
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] UpdateOperator
src/tts.js:247:11
 
         utterance.onend = () => {
           clearSafety();
-          currentIndex++;
+          currentIndex--;
           setTimeout(speakNext, 100); // Small delay between sentences
         };
killedBy: TTSModule - Comprehensive Coverage speakWithWebSpeech should speak sentences using Web Speech API
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/tts.js:253:40
 
         // If onerror is called, also clear safety timer
         const originalOnError = utterance.onerror;
-        utterance.onerror = (event) => {
-          clearSafety();
-          if (typeof originalOnError === 'function') {
-            try { originalOnError.call(utterance, event); } catch { /* ignore */ }
-          }
-          console.error('Speech synthesis error:', event);
-          reject(new Error('Speech synthesis failed'));
-        };
+        utterance.onerror = (event) => {};
 
         // Start a safety timer to auto-advance if no events fire.
killedBy: TTSModule - Comprehensive Coverage speakWithWebSpeech should handle speech synthesis errors
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/tts.js:255:15
         const originalOnError = utterance.onerror;
         utterance.onerror = (event) => {
           clearSafety();
-          if (typeof originalOnError === 'function') {
+          if (false) {
             try { originalOnError.call(utterance, event); } catch { /* ignore */ }
           }
killedBy: TTSModule - Comprehensive Coverage speakWithWebSpeech should call original onerror handler
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/tts.js:255:54
         const originalOnError = utterance.onerror;
         utterance.onerror = (event) => {
           clearSafety();
-          if (typeof originalOnError === 'function') {
-            try { originalOnError.call(utterance, event); } catch { /* ignore */ }
-          }
+          if (typeof originalOnError === 'function') {}
           console.error('Speech synthesis error:', event);
           reject(new Error('Speech synthesis failed'));
killedBy: TTSModule - Comprehensive Coverage speakWithWebSpeech should call original onerror handler
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/tts.js:256:17
         utterance.onerror = (event) => {
           clearSafety();
           if (typeof originalOnError === 'function') {
-            try { originalOnError.call(utterance, event); } catch { /* ignore */ }
+            try {} catch { /* ignore */ }
           }
           console.error('Speech synthesis error:', event);
killedBy: TTSModule - Comprehensive Coverage speakWithWebSpeech should call original onerror handler
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/tts.js:263:40
         };
 
         // Start a safety timer to auto-advance if no events fire.
-        safetyTimer = setTimeout(() => {
-          safetyTimer = null;
-          // Try to simulate onend to keep behavior consistent
-          try {
-            if (typeof utterance.onend === 'function') utterance.onend();
-          } catch {
-            // ignore
-            currentIndex++;
-            setTimeout(speakNext, 100);
-          }
-        }, 250);
+        safetyTimer = setTimeout(() => {}, 250);
 
         // Finally, request speech. If speak throws, clear safety and reject.
killedBy: TTSModule - Comprehensive Coverage speakWithWebSpeech should speak sentences using Web Speech API
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/tts.js:266:15
         safetyTimer = setTimeout(() => {
           safetyTimer = null;
           // Try to simulate onend to keep behavior consistent
-          try {
-            if (typeof utterance.onend === 'function') utterance.onend();
-          } catch {
+          try {} catch {
             // ignore
             currentIndex++;
killedBy: TTSModule - Comprehensive Coverage speakWithWebSpeech should speak sentences using Web Speech API
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."
