[Killed] ConditionalExpression
src/tts.js:267:17
           safetyTimer = null;
           // Try to simulate onend to keep behavior consistent
           try {
-            if (typeof utterance.onend === 'function') utterance.onend();
+            if (false) utterance.onend();
           } catch {
             // ignore
killedBy: TTSModule - Comprehensive Coverage speakWithWebSpeech should speak sentences using Web Speech API
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] EqualityOperator
src/tts.js:267:17
           safetyTimer = null;
           // Try to simulate onend to keep behavior consistent
           try {
-            if (typeof utterance.onend === 'function') utterance.onend();
+            if (typeof utterance.onend !== 'function') utterance.onend();
           } catch {
             // ignore
killedBy: TTSModule - Comprehensive Coverage speakWithWebSpeech should speak sentences using Web Speech API
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[NoCoverage] BlockStatement
src/tts.js:268:19
           // Try to simulate onend to keep behavior consistent
           try {
             if (typeof utterance.onend === 'function') utterance.onend();
-          } catch {
-            // ignore
-            currentIndex++;
-            setTimeout(speakNext, 100);
-          }
+          } catch {}
         }, 250);
 

[NoCoverage] UpdateOperator
src/tts.js:270:13
             if (typeof utterance.onend === 'function') utterance.onend();
           } catch {
             // ignore
-            currentIndex++;
+            currentIndex--;
             setTimeout(speakNext, 100);
           }

[Killed] BlockStatement
src/tts.js:276:13
         }, 250);
 
         // Finally, request speech. If speak throws, clear safety and reject.
-        try {
-          speechSynthesis.speak(utterance);
-        } catch (e) {
+        try {} catch (e) {
           clearSafety();
           reject(e);
killedBy: TTSModule - Comprehensive Coverage speakWithWebSpeech should speak sentences using Web Speech API
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

[Survived] BlockStatement
src/tts.js:278:21
         // Finally, request speech. If speak throws, clear safety and reject.
         try {
           speechSynthesis.speak(utterance);
-        } catch (e) {
-          clearSafety();
-          reject(e);
-        }
+        } catch (e) {}
       };
 

[Killed] StringLiteral
src/tts.js:290:60
 
   async speakWithKokoro(audioModule, outputElement) {
     // Import Kokoro TTS modules
-    const { KokoroTTS, TextSplitterStream } = await import('kokoro-js');
+    const { KokoroTTS, TextSplitterStream } = await import("");
     
     // 0) Guards
killedBy: TTSModule - Comprehensive Coverage speakWithKokoro should throw error for empty text content
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "No text content to speak"
Received message:   "Cannot read properties of undefined (reading 'from_pretrained')"

      660 |         } else {
      661 |           stryCov_9fa48("805");
    > 662 |           this.kokoroModel = await KokoroTTS.from_pretrained(stryMutAct_9fa48("806") ? "" : (stryCov_9fa48("806"), "onnx-community

[Killed] BooleanLiteral
src/tts.js:293:9
     const { KokoroTTS, TextSplitterStream } = await import('kokoro-js');
     
     // 0) Guards
-    if (!navigator.gpu) {
+    if (navigator.gpu) {
       throw new Error("WebGPU is required for Kokoro TTS");
     }
killedBy: TTSModule - Comprehensive Coverage speakWithKokoro should throw error if audio worklet is not initialized
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Audio worklet not initialized"
Received message:   "WebGPU is required for Kokoro TTS"

      642 |         } else {
      643 |           stryCov_9fa48("794");
    > 644 |           throw new Error(stryMutAct_9fa48("795") ? "" : (stryCov_9fa48("795"), "WebGPU is required for Kokoro TTS"));

[Killed] ConditionalExpression
src/tts.js:293:9
     const { KokoroTTS, TextSplitterStream } = await import('kokoro-js');
     
     // 0) Guards
-    if (!navigator.gpu) {
+    if (true) {
       throw new Error("WebGPU is required for Kokoro TTS");
     }
killedBy: TTSModule - Comprehensive Coverage speakWithKokoro should throw error if audio worklet is not initialized
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Audio worklet not initialized"
Received message:   "WebGPU is required for Kokoro TTS"

      642 |         } else {
      643 |           stryCov_9fa48("794");
    > 644 |           throw new Error(stryMutAct_9fa48("795") ? "" : (stryCov_9fa48("795"), "WebGPU is required for Kokoro TTS"));

[Killed] ConditionalExpression
src/tts.js:296:9
     if (!navigator.gpu) {
       throw new Error("WebGPU is required for Kokoro TTS");
     }
-    if (!audioModule?.port) {
+    if (true) {
       throw new Error("Audio worklet not initialized");
     }
killedBy: TTSModule - Comprehensive Coverage speakWithKokoro should throw error for empty text content
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "No text content to speak"
Received message:   "Audio worklet not initialized"

      650 |         } else {
      651 |           stryCov_9fa48("800");
    > 652 |           throw new Error(stryMutAct_9fa48("801") ? "" : (stryCov_9fa48("801"), "Audio worklet not initialized"));

[Killed] BooleanLiteral
src/tts.js:296:9
     if (!navigator.gpu) {
       throw new Error("WebGPU is required for Kokoro TTS");
     }
-    if (!audioModule?.port) {
+    if (audioModule?.port) {
       throw new Error("Audio worklet not initialized");
     }
killedBy: TTSModule - Comprehensive Coverage speakWithKokoro should throw error if audio worklet is not initialized
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Audio worklet not initialized"
Received message:   "outputElement.appendChild is not a function"

      443 |           span.id = stryMutAct_9fa48("742") ? `` : (stryCov_9fa48("742"), `sentence-${index}`);
      444 |           span.className = stryMutAct_9fa48("743") ? "" : (stryCov_9fa48("743"), 'sentence');
    > 445 |

[Survived] ConditionalExpression
src/tts.js:301:9
     }
 
     // 1) Load TTS model (cache instance in class to avoid reloading)
-    if (!this.kokoroModel) {
+    if (true) {
       this.kokoroModel = await KokoroTTS.from_pretrained("onnx-community/Kokoro-82M-v1.0-ONNX", {
         dtype: "fp32",

[Survived] BlockStatement
src/tts.js:301:28
     }
 
     // 1) Load TTS model (cache instance in class to avoid reloading)
-    if (!this.kokoroModel) {
-      this.kokoroModel = await KokoroTTS.from_pretrained("onnx-community/Kokoro-82M-v1.0-ONNX", {
-        dtype: "fp32",
-        device: "webgpu",
-        progress_callback: (item) => {
-          if (item.status === "progress" && item.file?.endsWith?.("onnx")) {
-            // Update progress for ONNX files only
-            const progress = Math.round(item.progress * 100);
-            console.log(`Loading Kokoro model: ${progress}%`);
-            // You can emit a progress event here if needed
-          }
-        },
-      });
-    }
+    if (!this.kokoroModel) {}
 
     // 2) Get text content and prepare sentences

[Survived] StringLiteral
src/tts.js:302:58
 
     // 1) Load TTS model (cache instance in class to avoid reloading)
     if (!this.kokoroModel) {
-      this.kokoroModel = await KokoroTTS.from_pretrained("onnx-community/Kokoro-82M-v1.0-ONNX", {
+      this.kokoroModel = await KokoroTTS.from_pretrained("", {
         dtype: "fp32",
         device: "webgpu",

[NoCoverage] BlockStatement
src/tts.js:305:38
       this.kokoroModel = await KokoroTTS.from_pretrained("onnx-community/Kokoro-82M-v1.0-ONNX", {
         dtype: "fp32",
         device: "webgpu",
-        progress_callback: (item) => {
-          if (item.status === "progress" && item.file?.endsWith?.("onnx")) {
-            // Update progress for ONNX files only
-            const progress = Math.round(item.progress * 100);
-            console.log(`Loading Kokoro model: ${progress}%`);
-            // You can emit a progress event here if needed
-          }
-        },
+        progress_callback: (item) => {},
       });
     }

[NoCoverage] ArithmeticOperator
src/tts.js:308:41
         progress_callback: (item) => {
           if (item.status === "progress" && item.file?.endsWith?.("onnx")) {
             // Update progress for ONNX files only
-            const progress = Math.round(item.progress * 100);
+            const progress = Math.round(item.progress / 100);
             console.log(`Loading Kokoro model: ${progress}%`);
             // You can emit a progress event here if needed

[Killed] LogicalOperator
src/tts.js:317:18
     }
 
     // 2) Get text content and prepare sentences
-    const text = outputElement.textContent ?? "";
+    const text = outputElement.textContent && "";
     if (!text.trim()) {
       throw new Error("No text content to speak");
killedBy: TTSModule - Comprehensive Coverage Additional Tests should handle worklet messages in speakWithKokoro
statusReason: Error: No text content to speak

[NoCoverage] StringLiteral
src/tts.js:317:47
     }
 
     // 2) Get text content and prepare sentences
-    const text = outputElement.textContent ?? "";
+    const text = outputElement.textContent ?? "Stryker was here!";
     if (!text.trim()) {
       throw new Error("No text content to speak");

[Killed] ConditionalExpression
src/tts.js:318:9
 
     // 2) Get text content and prepare sentences
     const text = outputElement.textContent ?? "";
-    if (!text.trim()) {
+    if (false) {
       throw new Error("No text content to speak");
     }
killedBy: TTSModule - Comprehensive Coverage speakWithKokoro should throw error for empty text content
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] MethodExpression
src/tts.js:318:10
 
     // 2) Get text content and prepare sentences
     const text = outputElement.textContent ?? "";
-    if (!text.trim()) {
+    if (!text) {
       throw new Error("No text content to speak");
     }
killedBy: TTSModule - Comprehensive Coverage speakWithKokoro should throw error for empty text content
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Survived] ArrayDeclaration
src/tts.js:327:25
     this.displaySentences(outputElement);
 
     // 3) Initialize tracking variables
-    this.pendingTexts = [];
+    this.pendingTexts = ["Stryker was here"];
     this.currentSentenceIndex = 0;
     this.isStopped = false;

[NoCoverage] BlockStatement
src/tts.js:334:35
 
     // 4) Set up worklet message handler
     const originalHandler = audioModule.port.onmessage;
-    const onWorkletMsg = (evt) => {
-      const data = evt?.data;
-      if (!data || typeof data !== "object") return;
-      
-      if (data.type === "next_chunk") {
-        this.advanceHighlight();
-      } else if (data.type === "playback_ended") {
-        this.finalizeUIState();
-      }
-      
-      // Call original handler if it exists
-      if (originalHandler) {
-        originalHandler(evt);
-      }
-    };
+    const onWorkletMsg = (evt) => {};
     audioModule.port.onmessage = onWorkletMsg;
 

[NoCoverage] OptionalChaining
src/tts.js:335:20
     // 4) Set up worklet message handler
     const originalHandler = audioModule.port.onmessage;
     const onWorkletMsg = (evt) => {
-      const data = evt?.data;
+      const data = evt.data;
       if (!data || typeof data !== "object") return;
       

[NoCoverage] ConditionalExpression
src/tts.js:336:11
     const originalHandler = audioModule.port.onmessage;
     const onWorkletMsg = (evt) => {
       const data = evt?.data;
-      if (!data || typeof data !== "object") return;
+      if (true) return;
       
       if (data.type === "next_chunk") {

[NoCoverage] LogicalOperator
src/tts.js:336:11
     const originalHandler = audioModule.port.onmessage;
     const onWorkletMsg = (evt) => {
       const data = evt?.data;
-      if (!data || typeof data !== "object") return;
+      if (!data && typeof data !== "object") return;
       
       if (data.type === "next_chunk") {

[NoCoverage] ConditionalExpression
src/tts.js:338:11
       const data = evt?.data;
       if (!data || typeof data !== "object") return;
       
-      if (data.type === "next_chunk") {
+      if (false) {
         this.advanceHighlight();
       } else if (data.type === "playback_ended") {

[NoCoverage] BlockStatement
src/tts.js:338:39
       const data = evt?.data;
       if (!data || typeof data !== "object") return;
       
-      if (data.type === "next_chunk") {
-        this.advanceHighlight();
-      } else if (data.type === "playback_ended") {
+      if (data.type === "next_chunk") {} else if (data.type === "playback_ended") {
         this.finalizeUIState();
       }

[NoCoverage] ConditionalExpression
src/tts.js:340:18
       
       if (data.type === "next_chunk") {
         this.advanceHighlight();
-      } else if (data.type === "playback_ended") {
+      } else if (false) {
         this.finalizeUIState();
       }

[NoCoverage] BlockStatement
src/tts.js:340:50
       
       if (data.type === "next_chunk") {
         this.advanceHighlight();
-      } else if (data.type === "playback_ended") {
-        this.finalizeUIState();
-      }
+      } else if (data.type === "playback_ended") {}
       
       // Call original handler if it exists

[NoCoverage] BlockStatement
src/tts.js:345:28
       }
       
       // Call original handler if it exists
-      if (originalHandler) {
-        originalHandler(evt);
-      }
+      if (originalHandler) {}
     };
     audioModule.port.onmessage = onWorkletMsg;

[NoCoverage] ConditionalExpression
src/tts.js:345:11
       }
       
       // Call original handler if it exists
-      if (originalHandler) {
+      if (true) {
         originalHandler(evt);
       }

[Killed] BlockStatement
src/tts.js:356:34
     const stream = this.kokoroModel.stream(this.currentSplitter);
 
     // 6) Start consuming the stream
-    const consume = (async () => {
-      try {
-        for await (const chunk of stream) {
-          if (this.isStopped) break;
-          
-          if (chunk.audio && chunk.audio.audio) {
-            // Send Float32Array PCM data to worklet
-            audioModule.port.postMessage(chunk.audio.audio);
-          }
-          
-          if (chunk.text) {
-            this.pendingTexts.push(chunk.text);
-            this.tryResolveHighlights();
-          }
-        }
-      } catch (error) {
-        console.error('TTS streaming error:', error);
-        throw error;
-      }
-    })();
+    const consume = (async () => {})();
 
     // 7) Feed text to splitter
killedBy: TTSModule speakWithKokoro should handle speakWithKokoro with proper audio streaming
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/tts.js:357:11
 
     // 6) Start consuming the stream
     const consume = (async () => {
-      try {
-        for await (const chunk of stream) {
-          if (this.isStopped) break;
-          
-          if (chunk.audio && chunk.audio.audio) {
-            // Send Float32Array PCM data to worklet
-            audioModule.port.postMessage(chunk.audio.audio);
-          }
-          
-          if (chunk.text) {
-            this.pendingTexts.push(chunk.text);
-            this.tryResolveHighlights();
-          }
-        }
-      } catch (error) {
+      try {} catch (error) {
         console.error('TTS streaming error:', error);
         throw error;
killedBy: TTSModule speakWithKokoro should handle speakWithKokoro with proper audio streaming
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/tts.js:358:43
     // 6) Start consuming the stream
     const consume = (async () => {
       try {
-        for await (const chunk of stream) {
-          if (this.isStopped) break;
-          
-          if (chunk.audio && chunk.audio.audio) {
-            // Send Float32Array PCM data to worklet
-            audioModule.port.postMessage(chunk.audio.audio);
-          }
-          
-          if (chunk.text) {
-            this.pendingTexts.push(chunk.text);
-            this.tryResolveHighlights();
-          }
-        }
+        for await (const chunk of stream) {}
       } catch (error) {
         console.error('TTS streaming error:', error);
killedBy: TTSModule speakWithKokoro should handle speakWithKokoro with proper audio streaming
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/tts.js:359:15
     const consume = (async () => {
       try {
         for await (const chunk of stream) {
-          if (this.isStopped) break;
+          if (true) break;
           
           if (chunk.audio && chunk.audio.audio) {
killedBy: TTSModule speakWithKokoro should handle speakWithKokoro with proper audio streaming
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] ConditionalExpression
src/tts.js:359:15
     const consume = (async () => {
       try {
         for await (const chunk of stream) {
-          if (this.isStopped) break;
+          if (false) break;
           
           if (chunk.audio && chunk.audio.audio) {

[Killed] ConditionalExpression
src/tts.js:361:15
         for await (const chunk of stream) {
           if (this.isStopped) break;
           
-          if (chunk.audio && chunk.audio.audio) {
+          if (false) {
             // Send Float32Array PCM data to worklet
             audioModule.port.postMessage(chunk.audio.audio);
killedBy: TTSModule speakWithKokoro should handle speakWithKokoro with proper audio streaming
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/tts.js:361:49
         for await (const chunk of stream) {
           if (this.isStopped) break;
           
-          if (chunk.audio && chunk.audio.audio) {
-            // Send Float32Array PCM data to worklet
-            audioModule.port.postMessage(chunk.audio.audio);
-          }
+          if (chunk.audio && chunk.audio.audio) {}
           
           if (chunk.text) {
killedBy: TTSModule speakWithKokoro should handle speakWithKokoro with proper audio streaming
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] ConditionalExpression
src/tts.js:366:15
             audioModule.port.postMessage(chunk.audio.audio);
           }
           
-          if (chunk.text) {
+          if (true) {
             this.pendingTexts.push(chunk.text);
             this.tryResolveHighlights();

[Survived] ConditionalExpression
src/tts.js:366:15
             audioModule.port.postMessage(chunk.audio.audio);
           }
           
-          if (chunk.text) {
+          if (false) {
             this.pendingTexts.push(chunk.text);
             this.tryResolveHighlights();

[NoCoverage] BlockStatement
src/tts.js:371:23
             this.tryResolveHighlights();
           }
         }
-      } catch (error) {
-        console.error('TTS streaming error:', error);
-        throw error;
-      }
+      } catch (error) {}
     })();
 

[NoCoverage] StringLiteral
src/tts.js:372:23
           }
         }
       } catch (error) {
-        console.error('TTS streaming error:', error);
+        console.error("", error);
         throw error;
       }

[Survived] BlockStatement
src/tts.js:378:9
     })();
 
     // 7) Feed text to splitter
-    try {
-      for (const sentence of this.sentences) {
-        if (this.isStopped) break;
-        this.currentSplitter.push(sentence + " ");
-      }
-      this.currentSplitter.close();
-
-      // Wait for stream to complete
-      await consume;
-      
-    } catch (error) {
+    try {} catch (error) {
       console.error('Kokoro TTS failed:', error);
       throw error;

[Survived] BlockStatement
src/tts.js:379:46
 
     // 7) Feed text to splitter
     try {
-      for (const sentence of this.sentences) {
-        if (this.isStopped) break;
-        this.currentSplitter.push(sentence + " ");
-      }
+      for (const sentence of this.sentences) {}
       this.currentSplitter.close();
 

[Survived] ConditionalExpression
src/tts.js:380:13
     // 7) Feed text to splitter
     try {
       for (const sentence of this.sentences) {
-        if (this.isStopped) break;
+        if (false) break;
         this.currentSplitter.push(sentence + " ");
       }

[Survived] ConditionalExpression
src/tts.js:380:13
     // 7) Feed text to splitter
     try {
       for (const sentence of this.sentences) {
-        if (this.isStopped) break;
+        if (true) break;
         this.currentSplitter.push(sentence + " ");
       }

[Survived] StringLiteral
src/tts.js:381:46
     try {
       for (const sentence of this.sentences) {
         if (this.isStopped) break;
-        this.currentSplitter.push(sentence + " ");
+        this.currentSplitter.push(sentence + "");
       }
       this.currentSplitter.close();

[NoCoverage] BlockStatement
src/tts.js:388:21
       // Wait for stream to complete
       await consume;
       
-    } catch (error) {
-      console.error('Kokoro TTS failed:', error);
-      throw error;
-    } finally {
+    } catch (error) {} finally {
       // Restore original message handler
       audioModule.port.onmessage = originalHandler;

[NoCoverage] StringLiteral
src/tts.js:389:21
       await consume;
       
     } catch (error) {
-      console.error('Kokoro TTS failed:', error);
+      console.error("", error);
       throw error;
     } finally {

[Survived] BlockStatement
src/tts.js:391:15
     } catch (error) {
       console.error('Kokoro TTS failed:', error);
       throw error;
-    } finally {
-      // Restore original message handler
-      audioModule.port.onmessage = originalHandler;
-      this.currentSplitter = null;
-    }
+    } finally {}
   }
 

[NoCoverage] BlockStatement
src/tts.js:399:22
   }
 
   // Helper method to advance sentence highlighting
-  advanceHighlight() {
-    if (this.currentSentenceIndex < this.sentences.length) {
-      this.markSentenceSpoken(this.currentSentenceIndex);
-      this.currentSentenceIndex++;
-    }
-  }
+  advanceHighlight() {}
 
   // Helper method to finalize UI state when playback ends

[NoCoverage] EqualityOperator
src/tts.js:400:9
 
   // Helper method to advance sentence highlighting
   advanceHighlight() {
-    if (this.currentSentenceIndex < this.sentences.length) {
+    if (this.currentSentenceIndex <= this.sentences.length) {
       this.markSentenceSpoken(this.currentSentenceIndex);
       this.currentSentenceIndex++;

[NoCoverage] ConditionalExpression
src/tts.js:400:9
 
   // Helper method to advance sentence highlighting
   advanceHighlight() {
-    if (this.currentSentenceIndex < this.sentences.length) {
+    if (false) {
       this.markSentenceSpoken(this.currentSentenceIndex);
       this.currentSentenceIndex++;

[NoCoverage] UpdateOperator
src/tts.js:402:7
   advanceHighlight() {
     if (this.currentSentenceIndex < this.sentences.length) {
       this.markSentenceSpoken(this.currentSentenceIndex);
-      this.currentSentenceIndex++;
+      this.currentSentenceIndex--;
     }
   }

[NoCoverage] BlockStatement
src/tts.js:407:21
   }
 
   // Helper method to finalize UI state when playback ends
-  finalizeUIState() {
-    this.isStopped = true;
-    this.isPaused = false;
-    this.currentSentenceIndex = 0;
-    
-    // Clear all highlights
-    document.querySelectorAll('.sentence.spoken').forEach(el => {
-      el.classList.remove('spoken');
-    });
-  }
+  finalizeUIState() {}
 
   // Helper method to try resolving pending text snippets to highlights

[NoCoverage] BooleanLiteral
src/tts.js:408:22
 
   // Helper method to finalize UI state when playback ends
   finalizeUIState() {
-    this.isStopped = true;
+    this.isStopped = false;
     this.isPaused = false;
     this.currentSentenceIndex = 0;

[NoCoverage] BooleanLiteral
src/tts.js:409:21
   // Helper method to finalize UI state when playback ends
   finalizeUIState() {
     this.isStopped = true;
-    this.isPaused = false;
+    this.isPaused = true;
     this.currentSentenceIndex = 0;
     

[NoCoverage] BlockStatement
src/tts.js:413:65
     this.currentSentenceIndex = 0;
     
     // Clear all highlights
-    document.querySelectorAll('.sentence.spoken').forEach(el => {
-      el.classList.remove('spoken');
-    });
+    document.querySelectorAll('.sentence.spoken').forEach(el => {});
   }
 

[NoCoverage] StringLiteral
src/tts.js:413:31
     this.currentSentenceIndex = 0;
     
     // Clear all highlights
-    document.querySelectorAll('.sentence.spoken').forEach(el => {
+    document.querySelectorAll("").forEach(el => {
       el.classList.remove('spoken');
     });

[Survived] BlockStatement
src/tts.js:419:26
   }
 
   // Helper method to try resolving pending text snippets to highlights
-  tryResolveHighlights() {
-    // For simplicity, we'll assume the chunks align with sentences
-    // In a more sophisticated implementation, you would normalize text
-    // and map character ranges as described in the reference
-    while (this.pendingTexts.length > 0 && this.currentSentenceIndex < this.sentences.length) {
-      const pendingText = this.pendingTexts.shift();
-      // Simple matching - in production you'd want more robust text alignment
-      if (pendingText && pendingText.trim()) {
-        // Text is available, highlight will be triggered by worklet next_chunk message
-      }
-    }
-  }
+  tryResolveHighlights() {}
 
   markSentenceSpoken(index) {

[Timeout] EqualityOperator
src/tts.js:423:12
     // For simplicity, we'll assume the chunks align with sentences
     // In a more sophisticated implementation, you would normalize text
     // and map character ranges as described in the reference
-    while (this.pendingTexts.length > 0 && this.currentSentenceIndex < this.sentences.length) {
+    while (this.pendingTexts.length >= 0 && this.currentSentenceIndex < this.sentences.length) {
       const pendingText = this.pendingTexts.shift();
       // Simple matching - in production you'd want more robust text alignment

[Survived] EqualityOperator
src/tts.js:423:44
     // For simplicity, we'll assume the chunks align with sentences
     // In a more sophisticated implementation, you would normalize text
     // and map character ranges as described in the reference
-    while (this.pendingTexts.length > 0 && this.currentSentenceIndex < this.sentences.length) {
+    while (this.pendingTexts.length > 0 && this.currentSentenceIndex <= this.sentences.length) {
       const pendingText = this.pendingTexts.shift();
       // Simple matching - in production you'd want more robust text alignment

[Survived] ConditionalExpression
src/tts.js:426:11
     while (this.pendingTexts.length > 0 && this.currentSentenceIndex < this.sentences.length) {
       const pendingText = this.pendingTexts.shift();
       // Simple matching - in production you'd want more robust text alignment
-      if (pendingText && pendingText.trim()) {
+      if (false) {
         // Text is available, highlight will be triggered by worklet next_chunk message
       }

[Survived] ConditionalExpression
src/tts.js:426:11
     while (this.pendingTexts.length > 0 && this.currentSentenceIndex < this.sentences.length) {
       const pendingText = this.pendingTexts.shift();
       // Simple matching - in production you'd want more robust text alignment
-      if (pendingText && pendingText.trim()) {
+      if (true) {
         // Text is available, highlight will be triggered by worklet next_chunk message
       }

[Survived] BlockStatement
src/tts.js:432:29
     }
   }
 
-  markSentenceSpoken(index) {
-    const sentenceEl = (typeof document !== 'undefined' && typeof document.getElementById === 'function')
-      ? document.getElementById(`sentence-${index}`)
-      : null;
-
-    // Remove previous highlights (guarded)
-    if (typeof document !== 'undefined' && typeof document.querySelectorAll === 'function') {
-      const prev = document.querySelectorAll('.sentence.spoken') || [];
-      prev.forEach(el => {
-        if (el && el.classList && typeof el.classList.remove === 'function') {
-          el.classList.remove('spoken');
-        }
-      });
-    }
-
-    // Highlight current sentence if possible
-    if (sentenceEl && sentenceEl.classList && typeof sentenceEl.classList.add === 'function') {
-      sentenceEl.classList.add('spoken');
-    }
-
-    this.currentSentenceIndex = index;
-  }
+  markSentenceSpoken(index) {}
 
   pause() {

[Survived] EqualityOperator
src/tts.js:433:60
   }
 
   markSentenceSpoken(index) {
-    const sentenceEl = (typeof document !== 'undefined' && typeof document.getElementById === 'function')
+    const sentenceEl = (typeof document !== 'undefined' && typeof document.getElementById !== 'function')
       ? document.getElementById(`sentence-${index}`)
       : null;
