[Survived] EqualityOperator
src/tts.js:433:25
   }
 
   markSentenceSpoken(index) {
-    const sentenceEl = (typeof document !== 'undefined' && typeof document.getElementById === 'function')
+    const sentenceEl = (typeof document === 'undefined' && typeof document.getElementById === 'function')
       ? document.getElementById(`sentence-${index}`)
       : null;

[Survived] ConditionalExpression
src/tts.js:438:9
       : null;
 
     // Remove previous highlights (guarded)
-    if (typeof document !== 'undefined' && typeof document.querySelectorAll === 'function') {
+    if (false) {
       const prev = document.querySelectorAll('.sentence.spoken') || [];
       prev.forEach(el => {

[Survived] ConditionalExpression
src/tts.js:438:44
       : null;
 
     // Remove previous highlights (guarded)
-    if (typeof document !== 'undefined' && typeof document.querySelectorAll === 'function') {
+    if (typeof document !== 'undefined' && true) {
       const prev = document.querySelectorAll('.sentence.spoken') || [];
       prev.forEach(el => {

[Killed] ConditionalExpression
src/tts.js:439:20
 
     // Remove previous highlights (guarded)
     if (typeof document !== 'undefined' && typeof document.querySelectorAll === 'function') {
-      const prev = document.querySelectorAll('.sentence.spoken') || [];
+      const prev = false;
       prev.forEach(el => {
         if (el && el.classList && typeof el.classList.remove === 'function') {
killedBy: TTSModule - Comprehensive Coverage speakWithWebSpeech should speak sentences using Web Speech API
statusReason: TypeError: prev.forEach is not a function

[Killed] ConditionalExpression
src/tts.js:439:20
 
     // Remove previous highlights (guarded)
     if (typeof document !== 'undefined' && typeof document.querySelectorAll === 'function') {
-      const prev = document.querySelectorAll('.sentence.spoken') || [];
+      const prev = true;
       prev.forEach(el => {
         if (el && el.classList && typeof el.classList.remove === 'function') {
killedBy: TTSModule - Comprehensive Coverage speakWithWebSpeech should speak sentences using Web Speech API
statusReason: TypeError: prev.forEach is not a function

[Survived] BlockStatement
src/tts.js:440:26
     // Remove previous highlights (guarded)
     if (typeof document !== 'undefined' && typeof document.querySelectorAll === 'function') {
       const prev = document.querySelectorAll('.sentence.spoken') || [];
-      prev.forEach(el => {
-        if (el && el.classList && typeof el.classList.remove === 'function') {
-          el.classList.remove('spoken');
-        }
-      });
+      prev.forEach(el => {});
     }
 

[Killed] LogicalOperator
src/tts.js:441:13
     if (typeof document !== 'undefined' && typeof document.querySelectorAll === 'function') {
       const prev = document.querySelectorAll('.sentence.spoken') || [];
       prev.forEach(el => {
-        if (el && el.classList && typeof el.classList.remove === 'function') {
+        if (el || el.classList && typeof el.classList.remove === 'function') {
           el.classList.remove('spoken');
         }
killedBy: TTSModule - Comprehensive Coverage Additional Tests should handle if an element in querySelectorAll result is null
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "Cannot read properties of null (reading 'classList')"

      921 |             } else {
      922 |               stryCov_9fa48("932");

[Killed] LogicalOperator
src/tts.js:441:13
     if (typeof document !== 'undefined' && typeof document.querySelectorAll === 'function') {
       const prev = document.querySelectorAll('.sentence.spoken') || [];
       prev.forEach(el => {
-        if (el && el.classList && typeof el.classList.remove === 'function') {
+        if (el && el.classList || typeof el.classList.remove === 'function') {
           el.classList.remove('spoken');
         }
killedBy: TTSModule - Comprehensive Coverage Additional Tests should handle if an element in querySelectorAll result is null
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "Cannot read properties of null (reading 'classList')"

      921 |             } else {
      922 |               stryCov_9fa48("932");

[Killed] LogicalOperator
src/tts.js:448:9
     }
 
     // Highlight current sentence if possible
-    if (sentenceEl && sentenceEl.classList && typeof sentenceEl.classList.add === 'function') {
+    if (sentenceEl || sentenceEl.classList && typeof sentenceEl.classList.add === 'function') {
       sentenceEl.classList.add('spoken');
     }
killedBy: TTSModule - Comprehensive Coverage speakWithWebSpeech should speak sentences using Web Speech API
statusReason: TypeError: Cannot read properties of undefined (reading 'classList')

[Killed] ConditionalExpression
src/tts.js:448:9
     }
 
     // Highlight current sentence if possible
-    if (sentenceEl && sentenceEl.classList && typeof sentenceEl.classList.add === 'function') {
+    if (true) {
       sentenceEl.classList.add('spoken');
     }
killedBy: TTSModule - Comprehensive Coverage speakWithWebSpeech should speak sentences using Web Speech API
statusReason: TypeError: Cannot read properties of undefined (reading 'classList')

[NoCoverage] StringLiteral
src/tts.js:449:32
 
     // Highlight current sentence if possible
     if (sentenceEl && sentenceEl.classList && typeof sentenceEl.classList.add === 'function') {
-      sentenceEl.classList.add('spoken');
+      sentenceEl.classList.add("");
     }
 

[Killed] BlockStatement
src/tts.js:455:11
     this.currentSentenceIndex = index;
   }
 
-  pause() {
-    if (this.useWebSpeech) {
-      speechSynthesis.pause();
-    }
-    this.isPaused = true;
-  }
+  pause() {}
 
   resume() {
killedBy: TTSModule - Comprehensive Coverage Playback control pause should call speechSynthesis.pause for web speech
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/tts.js:456:28
   }
 
   pause() {
-    if (this.useWebSpeech) {
-      speechSynthesis.pause();
-    }
+    if (this.useWebSpeech) {}
     this.isPaused = true;
   }
killedBy: TTSModule - Comprehensive Coverage Playback control pause should call speechSynthesis.pause for web speech
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/tts.js:456:9
   }
 
   pause() {
-    if (this.useWebSpeech) {
+    if (false) {
       speechSynthesis.pause();
     }
killedBy: TTSModule - Comprehensive Coverage Playback control pause should call speechSynthesis.pause for web speech
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BooleanLiteral
src/tts.js:459:21
     if (this.useWebSpeech) {
       speechSynthesis.pause();
     }
-    this.isPaused = true;
+    this.isPaused = false;
   }
 
killedBy: TTSModule - Comprehensive Coverage Playback control pause should call speechSynthesis.pause for web speech
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/tts.js:462:12
     this.isPaused = true;
   }
 
-  resume() {
-    if (this.useWebSpeech) {
-      speechSynthesis.resume();
-    }
-    this.isPaused = false;
-  }
+  resume() {}
 
   stop() {
killedBy: TTSModule - Comprehensive Coverage Playback control resume should call speechSynthesis.resume for web speech
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/tts.js:463:28
   }
 
   resume() {
-    if (this.useWebSpeech) {
-      speechSynthesis.resume();
-    }
+    if (this.useWebSpeech) {}
     this.isPaused = false;
   }
killedBy: TTSModule - Comprehensive Coverage Playback control resume should call speechSynthesis.resume for web speech
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/tts.js:463:9
   }
 
   resume() {
-    if (this.useWebSpeech) {
+    if (false) {
       speechSynthesis.resume();
     }
killedBy: TTSModule - Comprehensive Coverage Playback control resume should call speechSynthesis.resume for web speech
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BooleanLiteral
src/tts.js:466:21
     if (this.useWebSpeech) {
       speechSynthesis.resume();
     }
-    this.isPaused = false;
+    this.isPaused = true;
   }
 
killedBy: TTSModule - Comprehensive Coverage Playback control resume should call speechSynthesis.resume for web speech
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/tts.js:470:22
   }
 
   stop() {
-    this.isStopped = true;
+    this.isStopped = false;
     this.isPaused = false;
     
killedBy: TTSModule - Comprehensive Coverage Playback control stop should call speechSynthesis.cancel for web speech
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/tts.js:473:28
     this.isStopped = true;
     this.isPaused = false;
     
-    if (this.useWebSpeech) {
-      speechSynthesis.cancel();
-    }
+    if (this.useWebSpeech) {}
     
     // For Kokoro, stop the stream and clear worklet queue
killedBy: TTSModule - Comprehensive Coverage Playback control stop should call speechSynthesis.cancel for web speech
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/tts.js:478:9
     }
     
     // For Kokoro, stop the stream and clear worklet queue
-    if (this.currentSplitter) {
+    if (false) {
       try {
         this.currentSplitter.close?.();
killedBy: TTSModule - Comprehensive Coverage Playback control stop should close Kokoro splitter if active
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/tts.js:478:31
     }
     
     // For Kokoro, stop the stream and clear worklet queue
-    if (this.currentSplitter) {
-      try {
-        this.currentSplitter.close?.();
-      } catch {
-        // Ignore errors when closing splitter
-      }
-      this.currentSplitter = null;
-    }
+    if (this.currentSplitter) {}
     
     // Clear highlights
killedBy: TTSModule - Comprehensive Coverage Playback control stop should close Kokoro splitter if active
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/tts.js:479:11
     
     // For Kokoro, stop the stream and clear worklet queue
     if (this.currentSplitter) {
-      try {
-        this.currentSplitter.close?.();
-      } catch {
+      try {} catch {
         // Ignore errors when closing splitter
       }
killedBy: TTSModule - Comprehensive Coverage Playback control stop should close Kokoro splitter if active
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] OptionalChaining
src/tts.js:480:9
     // For Kokoro, stop the stream and clear worklet queue
     if (this.currentSplitter) {
       try {
-        this.currentSplitter.close?.();
+        this.currentSplitter.close();
       } catch {
         // Ignore errors when closing splitter

[Survived] BlockStatement
src/tts.js:488:65
     }
     
     // Clear highlights
-    document.querySelectorAll('.sentence.spoken').forEach(el => {
-      if (el && el.classList) {
-        el.classList.remove('spoken');
-      }
-    });
+    document.querySelectorAll('.sentence.spoken').forEach(el => {});
     
     this.currentSentenceIndex = 0;

[Survived] StringLiteral
src/tts.js:488:31
     }
     
     // Clear highlights
-    document.querySelectorAll('.sentence.spoken').forEach(el => {
+    document.querySelectorAll("").forEach(el => {
       if (el && el.classList) {
         el.classList.remove('spoken');

[Survived] ConditionalExpression
src/tts.js:489:11
     
     // Clear highlights
     document.querySelectorAll('.sentence.spoken').forEach(el => {
-      if (el && el.classList) {
+      if (false) {
         el.classList.remove('spoken');
       }

[Survived] LogicalOperator
src/tts.js:489:11
     
     // Clear highlights
     document.querySelectorAll('.sentence.spoken').forEach(el => {
-      if (el && el.classList) {
+      if (el || el.classList) {
         el.classList.remove('spoken');
       }

[Killed] BlockStatement
src/tts.js:497:17
     this.currentSentenceIndex = 0;
   }
 
-  setRate(rate) {
-    this.rate = rate;
-  }
+  setRate(rate) {}
 
   setPitch(pitch) {
killedBy: TTSModule - Comprehensive Coverage Additional Tests setRate and setPitch should update values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1.5
Received: 1

[Killed] BlockStatement
src/tts.js:501:19
     this.rate = rate;
   }
 
-  setPitch(pitch) {
-    this.pitch = pitch;
-  }
+  setPitch(pitch) {}
 
   setVoice(voiceIndex) {
killedBy: TTSModule - Comprehensive Coverage Additional Tests setRate and setPitch should update values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0.8
Received: 1

[Killed] BlockStatement
src/tts.js:505:24
     this.pitch = pitch;
   }
 
-  setVoice(voiceIndex) {
-    const voices = speechSynthesis.getVoices();
-    if (voices[voiceIndex]) {
-      this.selectedVoice = voices[voiceIndex];
-    }
-  }
+  setVoice(voiceIndex) {}
 
   getAvailableVoices() {
killedBy: TTSModule - Comprehensive Coverage TTSModule state and configuration setVoice should select a voice by index
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"default": false, "lang": "es-ES", "name": "Spanish Voice"}
Received: null

[Killed] ConditionalExpression
src/tts.js:507:9
 
   setVoice(voiceIndex) {
     const voices = speechSynthesis.getVoices();
-    if (voices[voiceIndex]) {
+    if (false) {
       this.selectedVoice = voices[voiceIndex];
     }
killedBy: TTSModule - Comprehensive Coverage TTSModule state and configuration setVoice should select a voice by index
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"default": false, "lang": "es-ES", "name": "Spanish Voice"}
Received: null

[Killed] ConditionalExpression
src/tts.js:507:9
 
   setVoice(voiceIndex) {
     const voices = speechSynthesis.getVoices();
-    if (voices[voiceIndex]) {
+    if (true) {
       this.selectedVoice = voices[voiceIndex];
     }
killedBy: TTSModule - Comprehensive Coverage TTSModule state and configuration setVoice should select a voice by index
statusReason: Error: expect(received).toBe(expected) // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: {"default": false, "lang": "es-ES", "name": "Spanish Voice"}
Received: serializes to the same string

[Killed] BlockStatement
src/tts.js:512:24
     }
   }
 
-  getAvailableVoices() {
-    return speechSynthesis.getVoices();
-  }
+  getAvailableVoices() {}
 
   isWebSpeechAvailable() {
killedBy: TTSModule - Comprehensive Coverage TTSModule state and configuration getAvailableVoices should return voices from speechSynthesis
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"default": true, "lang": "en-US", "name": "English Voice"}, {"default": false, "lang": "es-ES", "name": "Spanish Voice"}]
Received: undefined

[Killed] BlockStatement
src/tts.js:516:26
     return speechSynthesis.getVoices();
   }
 
-  isWebSpeechAvailable() {
-    return 'speechSynthesis' in window;
-  }
+  isWebSpeechAvailable() {}
 
   isKokoroAvailable() {
killedBy: TTSModule - Comprehensive Coverage TTSModule state and configuration isWebSpeechAvailable should return true if supported
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] StringLiteral
src/tts.js:517:12
   }
 
   isWebSpeechAvailable() {
-    return 'speechSynthesis' in window;
+    return "" in window;
   }
 
killedBy: TTSModule - Comprehensive Coverage TTSModule state and configuration isWebSpeechAvailable should return true if supported
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/tts.js:520:23
     return 'speechSynthesis' in window;
   }
 
-  isKokoroAvailable() {
-    return this.kokoroModel !== null;
-  }
+  isKokoroAvailable() {}
 
   getCurrentSystem() {
killedBy: TTSModule - Comprehensive Coverage TTSModule state and configuration isKokoroAvailable should return false initially
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] ConditionalExpression
src/tts.js:521:12
   }
 
   isKokoroAvailable() {
-    return this.kokoroModel !== null;
+    return false;
   }
 
killedBy: TTSModule - Comprehensive Coverage TTSModule state and configuration isKokoroAvailable should return true after initialization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/tts.js:521:12
   }
 
   isKokoroAvailable() {
-    return this.kokoroModel !== null;
+    return true;
   }
 
killedBy: TTSModule - Comprehensive Coverage TTSModule state and configuration isKokoroAvailable should return false initially
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/tts.js:524:22
     return this.kokoroModel !== null;
   }
 
-  getCurrentSystem() {
-    if (this.kokoroModel && !this.useWebSpeech) return 'kokoro';
-    if (this.useWebSpeech) return 'web-speech';
-    return 'none';
-  }
+  getCurrentSystem() {}
 }
 
killedBy: TTSModule - Comprehensive Coverage TTSModule state and configuration getCurrentSystem should report correct TTS system
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "none"
Received: undefined

[Killed] ConditionalExpression
src/tts.js:525:9
   }
 
   getCurrentSystem() {
-    if (this.kokoroModel && !this.useWebSpeech) return 'kokoro';
+    if (true) return 'kokoro';
     if (this.useWebSpeech) return 'web-speech';
     return 'none';
killedBy: TTSModule - Comprehensive Coverage TTSModule state and configuration getCurrentSystem should report correct TTS system
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "none"
Received: "kokoro"

[Killed] ConditionalExpression
src/tts.js:525:9
   }
 
   getCurrentSystem() {
-    if (this.kokoroModel && !this.useWebSpeech) return 'kokoro';
+    if (false) return 'kokoro';
     if (this.useWebSpeech) return 'web-speech';
     return 'none';
killedBy: TTSModule - Comprehensive Coverage TTSModule state and configuration getCurrentSystem should report correct TTS system
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "kokoro"
Received: "none"

[Killed] ConditionalExpression
src/tts.js:526:9
 
   getCurrentSystem() {
     if (this.kokoroModel && !this.useWebSpeech) return 'kokoro';
-    if (this.useWebSpeech) return 'web-speech';
+    if (true) return 'web-speech';
     return 'none';
   }
killedBy: TTSModule - Comprehensive Coverage TTSModule state and configuration getCurrentSystem should report correct TTS system
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "none"
Received: "web-speech"

[Killed] ConditionalExpression
src/tts.js:526:9
 
   getCurrentSystem() {
     if (this.kokoroModel && !this.useWebSpeech) return 'kokoro';
-    if (this.useWebSpeech) return 'web-speech';
+    if (false) return 'web-speech';
     return 'none';
   }
killedBy: TTSModule - Comprehensive Coverage TTSModule state and configuration getCurrentSystem should report correct TTS system
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "web-speech"
Received: "none"
