[Killed] BlockStatement
src/components/audio-processor.js:3:35
 // Audio utilities for the Local LLM Demo
 export class AudioProcessor {
-  constructor(sampleRate = 24000) {
-    this.sampleRate = sampleRate;
-    this.buffer = [];
-  }
+  constructor(sampleRate = 24000) {}
 
   processAudioChunk(audioData) {
killedBy: AudioProcessor Property Tests Property-Based Tests should always return processed audio data
statusReason: Error: Property failed after 1 tests
{ seed: -1105764867, path: "0:0:0:0", endOnFailure: true }
Counterexample: [8000,[0]]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/components/audio-processor.js:8:32
     this.buffer = [];
   }
 
-  processAudioChunk(audioData) {
-    if (!audioData || audioData.length === 0) {
-      throw new Error('Invalid audio data');
-    }
-
-    // Convert to Float32Array if needed
-    let float32Data;
-    if (audioData instanceof Float32Array) {
-      float32Data = audioData;
-    } else if (Array.isArray(audioData)) {
-      float32Data = new Float32Array(audioData);
-    } else {
-      throw new Error('Audio data must be Float32Array or Array');
-    }
-
-    this.buffer.push(...float32Data);
-    return float32Data;
-  }
+  processAudioChunk(audioData) {}
 
   getBufferLength() {
killedBy: AudioProcessor Property Tests Property-Based Tests should always return processed audio data
statusReason: Error: Property failed after 1 tests
{ seed: 268098685, path: "0:0:0:0", endOnFailure: true }
Counterexample: [8000,[0]]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/components/audio-processor.js:9:9
   }
 
   processAudioChunk(audioData) {
-    if (!audioData || audioData.length === 0) {
+    if (false) {
       throw new Error('Invalid audio data');
     }
killedBy: AudioProcessor Property Tests Edge Case Tests should handle empty audio data
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid audio data"

Received function did not throw

[Killed] BlockStatement
src/components/audio-processor.js:9:47
   }
 
   processAudioChunk(audioData) {
-    if (!audioData || audioData.length === 0) {
-      throw new Error('Invalid audio data');
-    }
+    if (!audioData || audioData.length === 0) {}
 
     // Convert to Float32Array if needed
killedBy: AudioProcessor Property Tests Edge Case Tests should handle empty audio data
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid audio data"

Received function did not throw

[Killed] ConditionalExpression
src/components/audio-processor.js:15:9
 
     // Convert to Float32Array if needed
     let float32Data;
-    if (audioData instanceof Float32Array) {
+    if (false) {
       float32Data = audioData;
     } else if (Array.isArray(audioData)) {
killedBy: AudioProcessor Property Tests Property-Based Tests should always return processed audio data
statusReason: Error: Property failed after 1 tests
{ seed: -1441954743, path: "0:0:0", endOnFailure: true }
Counterexample: [8000,[0]]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/components/audio-processor.js:15:44
 
     // Convert to Float32Array if needed
     let float32Data;
-    if (audioData instanceof Float32Array) {
-      float32Data = audioData;
-    } else if (Array.isArray(audioData)) {
+    if (audioData instanceof Float32Array) {} else if (Array.isArray(audioData)) {
       float32Data = new Float32Array(audioData);
     } else {
killedBy: AudioProcessor should process Float32Array audio chunks
statusReason: TypeError: float32Data is not iterable (cannot read property undefined)

[Killed] ConditionalExpression
src/components/audio-processor.js:17:16
     let float32Data;
     if (audioData instanceof Float32Array) {
       float32Data = audioData;
-    } else if (Array.isArray(audioData)) {
+    } else if (true) {
       float32Data = new Float32Array(audioData);
     } else {
killedBy: AudioProcessor should throw error for invalid audio data
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Audio data must be Float32Array or Array"

Received function did not throw

[Killed] BlockStatement
src/components/audio-processor.js:17:42
     let float32Data;
     if (audioData instanceof Float32Array) {
       float32Data = audioData;
-    } else if (Array.isArray(audioData)) {
-      float32Data = new Float32Array(audioData);
-    } else {
+    } else if (Array.isArray(audioData)) {} else {
       throw new Error('Audio data must be Float32Array or Array');
     }
killedBy: AudioProcessor should process Array audio chunks
statusReason: TypeError: float32Data is not iterable (cannot read property undefined)

[Killed] BlockStatement
src/components/audio-processor.js:19:12
       float32Data = audioData;
     } else if (Array.isArray(audioData)) {
       float32Data = new Float32Array(audioData);
-    } else {
-      throw new Error('Audio data must be Float32Array or Array');
-    }
+    } else {}
 
     this.buffer.push(...float32Data);
killedBy: AudioProcessor should throw error for invalid audio data
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Audio data must be Float32Array or Array"
Received message:   "float32Data is not iterable (cannot read property undefined)"

       95 |         }
       96 |       }
    >  97 |       this.buffer.push(...float32Data);

[Killed] BlockStatement
src/components/audio-processor.js:27:21
     return float32Data;
   }
 
-  getBufferLength() {
-    return this.buffer.length;
-  }
+  getBufferLength() {}
 
   getBufferDuration() {
killedBy: AudioProcessor Property Tests Property-Based Tests should correctly track buffer length
statusReason: Error: Property failed after 1 tests
{ seed: 627746929, path: "0:0:0", endOnFailure: true }
Counterexample: [[0]]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/components/audio-processor.js:31:23
     return this.buffer.length;
   }
 
-  getBufferDuration() {
-    return this.buffer.length / this.sampleRate;
-  }
+  getBufferDuration() {}
 
   clearBuffer() {
killedBy: AudioProcessor Property Tests Edge Case Tests should calculate duration correctly
statusReason: Error: Property failed after 1 tests
{ seed: -342356850, path: "0:0:0:0", endOnFailure: true }
Counterexample: [8000,[0]]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
src/components/audio-processor.js:32:12
   }
 
   getBufferDuration() {
-    return this.buffer.length / this.sampleRate;
+    return this.buffer.length * this.sampleRate;
   }
 
killedBy: AudioProcessor Property Tests Edge Case Tests should calculate duration correctly
statusReason: Error: Property failed after 1 tests
{ seed: -1076171160, path: "0:0:0:0", endOnFailure: true }
Counterexample: [8000,[0]]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/components/audio-processor.js:35:17
     return this.buffer.length / this.sampleRate;
   }
 
-  clearBuffer() {
-    this.buffer = [];
-  }
+  clearBuffer() {}
 
   resample(targetSampleRate) {
killedBy: AudioProcessor Property Tests Metamorphic Tests should reset buffer length to zero after clearing
statusReason: Error: Property failed after 1 tests
{ seed: 1364018794, path: "0:0:0", endOnFailure: true }
Counterexample: [[0]]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/components/audio-processor.js:39:30
     this.buffer = [];
   }
 
-  resample(targetSampleRate) {
-    if (targetSampleRate === this.sampleRate) {
-      return new Float32Array(this.buffer);
-    }
-
-    const ratio = this.sampleRate / targetSampleRate;
-    const newLength = Math.floor(this.buffer.length / ratio);
-    const resampled = new Float32Array(newLength);
-
-    for (let i = 0; i < newLength; i++) {
-      const srcIndex = Math.floor(i * ratio);
-      resampled[i] = this.buffer[srcIndex] || 0;
-    }
-
-    return resampled;
-  }
+  resample(targetSampleRate) {}
 }
 
killedBy: AudioProcessor should resample audio
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 2, 3, 4, 5, 6]
Received: undefined

[Killed] EqualityOperator
src/components/audio-processor.js:40:9
   }
 
   resample(targetSampleRate) {
-    if (targetSampleRate === this.sampleRate) {
+    if (targetSampleRate !== this.sampleRate) {
       return new Float32Array(this.buffer);
     }
killedBy: AudioProcessor should resample audio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 6

[Killed] ConditionalExpression
src/components/audio-processor.js:40:9
   }
 
   resample(targetSampleRate) {
-    if (targetSampleRate === this.sampleRate) {
+    if (true) {
       return new Float32Array(this.buffer);
     }
killedBy: AudioProcessor should resample audio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 6

[Killed] ArithmeticOperator
src/components/audio-processor.js:44:19
       return new Float32Array(this.buffer);
     }
 
-    const ratio = this.sampleRate / targetSampleRate;
+    const ratio = this.sampleRate * targetSampleRate;
     const newLength = Math.floor(this.buffer.length / ratio);
     const resampled = new Float32Array(newLength);
killedBy: AudioProcessor should resample audio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] ArithmeticOperator
src/components/audio-processor.js:45:34
     }
 
     const ratio = this.sampleRate / targetSampleRate;
-    const newLength = Math.floor(this.buffer.length / ratio);
+    const newLength = Math.floor(this.buffer.length * ratio);
     const resampled = new Float32Array(newLength);
 
killedBy: AudioProcessor should resample audio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 12

[Killed] ConditionalExpression
src/components/audio-processor.js:48:21
     const newLength = Math.floor(this.buffer.length / ratio);
     const resampled = new Float32Array(newLength);
 
-    for (let i = 0; i < newLength; i++) {
+    for (let i = 0; false; i++) {
       const srcIndex = Math.floor(i * ratio);
       resampled[i] = this.buffer[srcIndex] || 0;
killedBy: AudioProcessor should resample audio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/components/audio-processor.js:48:41
     const newLength = Math.floor(this.buffer.length / ratio);
     const resampled = new Float32Array(newLength);
 
-    for (let i = 0; i < newLength; i++) {
-      const srcIndex = Math.floor(i * ratio);
-      resampled[i] = this.buffer[srcIndex] || 0;
-    }
+    for (let i = 0; i < newLength; i++) {}
 
     return resampled;
killedBy: AudioProcessor should resample audio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArithmeticOperator
src/components/audio-processor.js:49:35
     const resampled = new Float32Array(newLength);
 
     for (let i = 0; i < newLength; i++) {
-      const srcIndex = Math.floor(i * ratio);
+      const srcIndex = Math.floor(i / ratio);
       resampled[i] = this.buffer[srcIndex] || 0;
     }
killedBy: AudioProcessor should resample audio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1

[Killed] ConditionalExpression
src/components/audio-processor.js:50:22
 
     for (let i = 0; i < newLength; i++) {
       const srcIndex = Math.floor(i * ratio);
-      resampled[i] = this.buffer[srcIndex] || 0;
+      resampled[i] = true;
     }
 
killedBy: AudioProcessor should resample audio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1

[Killed] LogicalOperator
src/components/audio-processor.js:50:22
 
     for (let i = 0; i < newLength; i++) {
       const srcIndex = Math.floor(i * ratio);
-      resampled[i] = this.buffer[srcIndex] || 0;
+      resampled[i] = this.buffer[srcIndex] && 0;
     }
 
killedBy: AudioProcessor should resample audio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0
