[Killed] ConditionalExpression
src/utils/text-processing.js:3:7
 // Text processing utilities for LLM and TTS
 export function splitTextIntoChunks(text, chunkSize = 100) {
-  if (!text || typeof text !== 'string') {
+  if (false) {
     return [];
   }
killedBy: Text Processing Utilities splitTextIntoChunks should handle empty or invalid input
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "",

[Killed] EqualityOperator
src/utils/text-processing.js:3:16
 // Text processing utilities for LLM and TTS
 export function splitTextIntoChunks(text, chunkSize = 100) {
-  if (!text || typeof text !== 'string') {
+  if (!text || typeof text === 'string') {
     return [];
   }
killedBy: Property-based tests for utils splitTextIntoChunks preserves text content
statusReason: Error: Property failed after 1 tests
{ seed: 398287307, path: "0:0:1:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["!",10]
Shrunk 8 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] MethodExpression
src/utils/text-processing.js:7:17
     return [];
   }
 
-  const words = text.trim().split(/\s+/);
+  const words = text.split(/\s+/);
   const chunks = [];
   let currentChunk = [];

[Killed] BlockStatement
src/utils/text-processing.js:11:29
   const chunks = [];
   let currentChunk = [];
 
-  for (const word of words) {
-    if (currentChunk.join(' ').length + word.length + 1 <= chunkSize) {
-      currentChunk.push(word);
-    } else {
-      if (currentChunk.length > 0) {
-        chunks.push(currentChunk.join(' '));
-        currentChunk = [word];
-      } else {
-        // Word is longer than chunk size, add it anyway
-        chunks.push(word);
-      }
-    }
-  }
+  for (const word of words) {}
 
   if (currentChunk.length > 0) {
killedBy: Text Processing Utilities splitTextIntoChunks should split text into chunks of specified size
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 1
Received:   0

[Killed] ArithmeticOperator
src/utils/text-processing.js:12:9
   let currentChunk = [];
 
   for (const word of words) {
-    if (currentChunk.join(' ').length + word.length + 1 <= chunkSize) {
+    if (currentChunk.join(' ').length - word.length + 1 <= chunkSize) {
       currentChunk.push(word);
     } else {
killedBy: Text Processing Utilities splitTextIntoChunks should split text into chunks of specified size
statusReason: Error: expect(received).toBeLessThanOrEqual(expected)

Expected: <= 20
Received:    28

[Killed] ArithmeticOperator
src/utils/text-processing.js:12:9
   let currentChunk = [];
 
   for (const word of words) {
-    if (currentChunk.join(' ').length + word.length + 1 <= chunkSize) {
+    if (currentChunk.join(' ').length + word.length - 1 <= chunkSize) {
       currentChunk.push(word);
     } else {
killedBy: Text Processing Utilities splitTextIntoChunks should split text into chunks of specified size
statusReason: Error: expect(received).toBeLessThanOrEqual(expected)

Expected: <= 20
Received:    22

[Killed] BlockStatement
src/utils/text-processing.js:14:12
   for (const word of words) {
     if (currentChunk.join(' ').length + word.length + 1 <= chunkSize) {
       currentChunk.push(word);
-    } else {
-      if (currentChunk.length > 0) {
-        chunks.push(currentChunk.join(' '));
-        currentChunk = [word];
-      } else {
-        // Word is longer than chunk size, add it anyway
-        chunks.push(word);
-      }
-    }
+    } else {}
   }
 
killedBy: Text Processing Utilities splitTextIntoChunks should split text into chunks of specified size
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 1
Received:   1

[Killed] ConditionalExpression
src/utils/text-processing.js:15:11
     if (currentChunk.join(' ').length + word.length + 1 <= chunkSize) {
       currentChunk.push(word);
     } else {
-      if (currentChunk.length > 0) {
+      if (false) {
         chunks.push(currentChunk.join(' '));
         currentChunk = [word];
killedBy: Property-based tests for utils splitTextIntoChunks preserves text content
statusReason: Error: Property failed after 20 tests
{ seed: 840872162, path: "19:3:2:3:3:3:3:3:3:8:13:12:12:12:12:12:12:20:19:19:19:19:19:23:27:26:26:26:26:29:32:31:31:31:33:34:33", endOnFailure: true }
Counterexample: ["! ! ! ! ! \"",10]
Shrunk 36 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/utils/text-processing.js:15:11
     if (currentChunk.join(' ').length + word.length + 1 <= chunkSize) {
       currentChunk.push(word);
     } else {
-      if (currentChunk.length > 0) {
+      if (currentChunk.length >= 0) {
         chunks.push(currentChunk.join(' '));
         currentChunk = [word];
killedBy: Text Processing Utilities splitTextIntoChunks should handle single word longer than chunk size
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
+   "",
    "supercalifragilisticexpialidocious",

[Killed] BlockStatement
src/utils/text-processing.js:18:14
       if (currentChunk.length > 0) {
         chunks.push(currentChunk.join(' '));
         currentChunk = [word];
-      } else {
-        // Word is longer than chunk size, add it anyway
-        chunks.push(word);
-      }
+      } else {}
     }
   }
killedBy: Property-based tests for utils splitTextIntoChunks preserves text content
statusReason: Error: Property failed after 34 tests
{ seed: -2143812209, path: "33:3:2:3:3:3:3:3:3:9:8:8:8:8:8:14:13:13:13:13:13:13:18:17:17:17:17:17:17:22:21:21:21:21:26:25:25:25:25:25:30:29:29:29:33:32:32:32:32:36:35:35:35:35:38:37:37:37:37:37:37:39:38:38:38:38:39:2", endOnFailure: true }
Counterexample: ["!!!!!!!!!!",10]
Shrunk 67 time(s)

Hint: Enable verbose mode in order to have the list of all failing va

[Killed] EqualityOperator
src/utils/text-processing.js:25:7
     }
   }
 
-  if (currentChunk.length > 0) {
+  if (currentChunk.length <= 0) {
     chunks.push(currentChunk.join(' '));
   }
killedBy: Property-based tests for utils splitTextIntoChunks preserves text content
statusReason: Error: Property failed after 1 tests
{ seed: -1927250251, path: "0:0:1:0:0:0:0:0:0:1", endOnFailure: true }
Counterexample: ["!",10]
Shrunk 9 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/utils/text-processing.js:25:32
     }
   }
 
-  if (currentChunk.length > 0) {
-    chunks.push(currentChunk.join(' '));
-  }
+  if (currentChunk.length > 0) {}
 
   return chunks;
killedBy: Property-based tests for utils splitTextIntoChunks preserves text content
statusReason: Error: Property failed after 1 tests
{ seed: 677909631, path: "0:1:0:0:0:0:0:1", endOnFailure: true }
Counterexample: ["!",10]
Shrunk 7 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/utils/text-processing.js:32:42
   return chunks;
 }
 
-export function splitIntoSentences(text) {
-  return text
-    .split(/[.!?]+/)
-    .map(s => s.trim())
-    .filter(s => s.length > 0)
-    .map(s => s + '.');
-}
+export function splitIntoSentences(text) {}
 
 export function formatPromptForInstruction(prompt) {
killedBy: Property-based tests for utils splitIntoSentences adds punctuation
statusReason: Error: Property failed after 1 tests
{ seed: -568604354, path: "0:0:0", endOnFailure: true }
Counterexample: [" "]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
src/utils/text-processing.js:33:10
 }
 
 export function splitIntoSentences(text) {
-  return text
-    .split(/[.!?]+/)
-    .map(s => s.trim())
-    .filter(s => s.length > 0)
+  return text.split(/[.!?]+/).map(s => s.trim())
     .map(s => s + '.');
 }
killedBy: Local LLM Demo Configuration splitIntoSentences correctly splits text
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 4
Received array:  ["Hello world.", "This is a test.", "How are you.", "."]

[Killed] ConditionalExpression
src/utils/text-processing.js:36:18
   return text
     .split(/[.!?]+/)
     .map(s => s.trim())
-    .filter(s => s.length > 0)
+    .filter(s => true)
     .map(s => s + '.');
 }
killedBy: Local LLM Demo Configuration splitIntoSentences correctly splits text
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 4
Received array:  ["Hello world.", "This is a test.", "How are you.", "."]

[Killed] BlockStatement
src/utils/text-processing.js:40:52
     .map(s => s + '.');
 }
 
-export function formatPromptForInstruction(prompt) {
-  return `<|im_start|>system
-You are a helpful assistant.<|im_end|>
-<|im_start|>user
-${prompt}<|im_end|>
-<|im_start|>assistant
-`;
-}
+export function formatPromptForInstruction(prompt) {}
 
 export function normalizeText(text) {
killedBy: Local LLM Demo Configuration formatPromptForInstruction creates proper format
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] StringLiteral
src/utils/text-processing.js:41:10
 }
 
 export function formatPromptForInstruction(prompt) {
-  return `<|im_start|>system
-You are a helpful assistant.<|im_end|>
-<|im_start|>user
-${prompt}<|im_end|>
-<|im_start|>assistant
-`;
+  return ``;
 }
 
killedBy: Text Processing Utilities formatPromptForInstruction should format prompt with instruction template
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "<|im_start|>system"
Received string:    ""

[Killed] BlockStatement
src/utils/text-processing.js:49:37
 `;
 }
 
-export function normalizeText(text) {
-  if (!text || typeof text !== 'string') {
-    return '';
-  }
-
-  return text
-    .trim()
-    .replace(/\s+/g, ' ')
-    .replace(/([.!?])\s*([A-Z])/g, '$1 $2');
-}
+export function normalizeText(text) {}
 
 export function estimateTokenCount(text) {
killedBy: Text Processing Utilities normalizeText should normalize whitespace and punctuation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world. How are you? Fine!"
Received: undefined

[Killed] ConditionalExpression
src/utils/text-processing.js:50:7
 }
 
 export function normalizeText(text) {
-  if (!text || typeof text !== 'string') {
+  if (true) {
     return '';
   }
killedBy: Text Processing Utilities normalizeText should normalize whitespace and punctuation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world. How are you? Fine!"
Received: ""

[Killed] BlockStatement
src/utils/text-processing.js:50:42
 }
 
 export function normalizeText(text) {
-  if (!text || typeof text !== 'string') {
-    return '';
-  }
+  if (!text || typeof text !== 'string') {}
 
   return text
killedBy: Text Processing Utilities normalizeText should handle empty or invalid input
statusReason: TypeError: Cannot read properties of null (reading 'trim')

[Killed] StringLiteral
src/utils/text-processing.js:51:12
 
 export function normalizeText(text) {
   if (!text || typeof text !== 'string') {
-    return '';
+    return "Stryker was here!";
   }
 
killedBy: Text Processing Utilities normalizeText should handle empty or invalid input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "Stryker was here!"

[Killed] MethodExpression
src/utils/text-processing.js:54:10
     return '';
   }
 
-  return text
-    .trim()
+  return text
     .replace(/\s+/g, ' ')
     .replace(/([.!?])\s*([A-Z])/g, '$1 $2');
killedBy: Text Processing Utilities normalizeText should normalize whitespace and punctuation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world. How are you? Fine!"
Received: " Hello world. How are you? Fine! "

[Killed] Regex
src/utils/text-processing.js:56:14
 
   return text
     .trim()
-    .replace(/\s+/g, ' ')
+    .replace(/\S+/g, ' ')
     .replace(/([.!?])\s*([A-Z])/g, '$1 $2');
 }
killedBy: Text Processing Utilities normalizeText should normalize whitespace and punctuation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world. How are you? Fine!"
Received: "          "

[Killed] Regex
src/utils/text-processing.js:56:14
 
   return text
     .trim()
-    .replace(/\s+/g, ' ')
+    .replace(/\s/g, ' ')
     .replace(/([.!?])\s*([A-Z])/g, '$1 $2');
 }
killedBy: Text Processing Utilities normalizeText should normalize whitespace and punctuation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world. How are you? Fine!"
Received: "Hello    world. How are you? Fine!"

[Killed] Regex
src/utils/text-processing.js:57:14
   return text
     .trim()
     .replace(/\s+/g, ' ')
-    .replace(/([.!?])\s*([A-Z])/g, '$1 $2');
+    .replace(/([.!?])\s([A-Z])/g, '$1 $2');
 }
 
killedBy: Text Processing Utilities normalizeText should normalize whitespace and punctuation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world. How are you? Fine!"
Received: "Hello world.How are you?Fine!"

[Killed] Regex
src/utils/text-processing.js:57:14
   return text
     .trim()
     .replace(/\s+/g, ' ')
-    .replace(/([.!?])\s*([A-Z])/g, '$1 $2');
+    .replace(/([^.!?])\s*([A-Z])/g, '$1 $2');
 }
 
killedBy: Text Processing Utilities normalizeText should normalize whitespace and punctuation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world. How are you? Fine!"
Received: "Hello world.How are you?Fine!"

[Killed] BlockStatement
src/utils/text-processing.js:60:42
     .replace(/([.!?])\s*([A-Z])/g, '$1 $2');
 }
 
-export function estimateTokenCount(text) {
-  if (!text || typeof text !== 'string') {
-    return 0;
-  }
-
-  // Rough estimation: ~4 characters per token for English text
-  return Math.ceil(text.length / 4);
-}
+export function estimateTokenCount(text) {}
 
 export function tokenizeForDisplay(text) {
killedBy: Property-based tests for utils estimateTokenCount returns positive for non-empty text
statusReason: Error: Property failed after 1 tests
{ seed: 1857819800, path: "0:0:0", endOnFailure: true }
Counterexample: [" "]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
src/utils/text-processing.js:61:7
 }
 
 export function estimateTokenCount(text) {
-  if (!text || typeof text !== 'string') {
+  if (text || typeof text !== 'string') {
     return 0;
   }
killedBy: Text Processing Utilities estimateTokenCount should estimate token count for text
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] BlockStatement
src/utils/text-processing.js:61:42
 }
 
 export function estimateTokenCount(text) {
-  if (!text || typeof text !== 'string') {
-    return 0;
-  }
+  if (!text || typeof text !== 'string') {}
 
   // Rough estimation: ~4 characters per token for English text
killedBy: Text Processing Utilities estimateTokenCount should handle empty or invalid input
statusReason: TypeError: Cannot read properties of null (reading 'length')

[Survived] ArithmeticOperator
src/utils/text-processing.js:66:20
   }
 
   // Rough estimation: ~4 characters per token for English text
-  return Math.ceil(text.length / 4);
+  return Math.ceil(text.length * 4);
 }
 

[Killed] BlockStatement
src/utils/text-processing.js:69:42
   return Math.ceil(text.length / 4);
 }
 
-export function tokenizeForDisplay(text) {
-  // Simple tokenization for display purposes
-  const words = text.split(/(\s+)/);
-  return words.filter(word => word.length > 0);
-}
+export function tokenizeForDisplay(text) {}
 
 export function formatDuration(seconds) {
killedBy: Text Processing Utilities tokenizeForDisplay should tokenize text for display
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Survived] Regex
src/utils/text-processing.js:71:28
 
 export function tokenizeForDisplay(text) {
   // Simple tokenization for display purposes
-  const words = text.split(/(\s+)/);
+  const words = text.split(/(\s)/);
   return words.filter(word => word.length > 0);
 }

[Killed] ConditionalExpression
src/utils/text-processing.js:72:31
 export function tokenizeForDisplay(text) {
   // Simple tokenization for display purposes
   const words = text.split(/(\s+)/);
-  return words.filter(word => word.length > 0);
+  return words.filter(word => false);
 }
 
killedBy: Text Processing Utilities tokenizeForDisplay should tokenize text for display
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "Hello"
Received array: []

[Killed] EqualityOperator
src/utils/text-processing.js:72:31
 export function tokenizeForDisplay(text) {
   // Simple tokenization for display purposes
   const words = text.split(/(\s+)/);
-  return words.filter(word => word.length > 0);
+  return words.filter(word => word.length <= 0);
 }
 
killedBy: Text Processing Utilities tokenizeForDisplay should tokenize text for display
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "Hello"
Received array: []

[Killed] BlockStatement
src/utils/text-processing.js:75:41
   return words.filter(word => word.length > 0);
 }
 
-export function formatDuration(seconds) {
-  if (typeof seconds !== 'number' || seconds < 0) {
-    return '0:00';
-  }
-
-  const minutes = Math.floor(seconds / 60);
-  const remainingSeconds = Math.floor(seconds % 60);
-  return `${minutes}:${remainingSeconds.toString().padStart(2, '0')}`;
-}
+export function formatDuration(seconds) {}
 
 export function debounce(func, wait) {
killedBy: Text Processing Utilities formatDuration should format seconds to MM:SS format
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1:05"
Received: undefined

[Killed] EqualityOperator
src/utils/text-processing.js:76:7
 }
 
 export function formatDuration(seconds) {
-  if (typeof seconds !== 'number' || seconds < 0) {
+  if (typeof seconds === 'number' || seconds < 0) {
     return '0:00';
   }
killedBy: Text Processing Utilities formatDuration should format seconds to MM:SS format
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1:05"
Received: "0:00"

[Killed] ConditionalExpression
src/utils/text-processing.js:76:38
 }
 
 export function formatDuration(seconds) {
-  if (typeof seconds !== 'number' || seconds < 0) {
+  if (typeof seconds !== 'number' || false) {
     return '0:00';
   }
killedBy: Text Processing Utilities formatDuration should handle invalid input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0:00"
Received: "-1:-1"

[Killed] ArithmeticOperator
src/utils/text-processing.js:80:30
     return '0:00';
   }
 
-  const minutes = Math.floor(seconds / 60);
+  const minutes = Math.floor(seconds * 60);
   const remainingSeconds = Math.floor(seconds % 60);
   return `${minutes}:${remainingSeconds.toString().padStart(2, '0')}`;
killedBy: Text Processing Utilities formatDuration should format seconds to MM:SS format
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1:05"
Received: "3900:05"

[Killed] ArithmeticOperator
src/utils/text-processing.js:81:39
   }
 
   const minutes = Math.floor(seconds / 60);
-  const remainingSeconds = Math.floor(seconds % 60);
+  const remainingSeconds = Math.floor(seconds * 60);
   return `${minutes}:${remainingSeconds.toString().padStart(2, '0')}`;
 }
killedBy: Text Processing Utilities formatDuration should format seconds to MM:SS format
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1:05"
Received: "1:3900"

[Killed] BlockStatement
src/utils/text-processing.js:85:38
   return `${minutes}:${remainingSeconds.toString().padStart(2, '0')}`;
 }
 
-export function debounce(func, wait) {
-  let timeout;
-  return function executedFunction(...args) {
-    const later = () => {
-      clearTimeout(timeout);
-      func(...args);
-    };
-    clearTimeout(timeout);
-    timeout = setTimeout(later, wait);
-  };
-}
+export function debounce(func, wait) {}
 
 export function calculateTokensPerSecond(tokenCount, durationMs) {
killedBy: Text Processing Utilities debounce should debounce function calls
statusReason: TypeError: fn is not a function

[Killed] BlockStatement
src/utils/text-processing.js:87:45
 
 export function debounce(func, wait) {
   let timeout;
-  return function executedFunction(...args) {
-    const later = () => {
-      clearTimeout(timeout);
-      func(...args);
-    };
-    clearTimeout(timeout);
-    timeout = setTimeout(later, wait);
-  };
+  return function executedFunction(...args) {};
 }
 
killedBy: Text Processing Utilities debounce should debounce function calls
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/utils/text-processing.js:88:25
 export function debounce(func, wait) {
   let timeout;
   return function executedFunction(...args) {
-    const later = () => {
-      clearTimeout(timeout);
-      func(...args);
-    };
+    const later = () => {};
     clearTimeout(timeout);
     timeout = setTimeout(later, wait);
killedBy: Text Processing Utilities debounce should debounce function calls
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/utils/text-processing.js:97:66
   };
 }
 
-export function calculateTokensPerSecond(tokenCount, durationMs) {
-  if (typeof tokenCount !== 'number' || typeof durationMs !== 'number' || durationMs <= 0) {
-    return 0;
-  }
-
-  return (tokenCount / (durationMs / 1000)).toFixed(1);
-}
+export function calculateTokensPerSecond(tokenCount, durationMs) {}
 
killedBy: Text Processing Utilities calculateTokensPerSecond should calculate tokens per second
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "20.0"
Received: undefined

[Killed] LogicalOperator
src/utils/text-processing.js:98:7
 }
 
 export function calculateTokensPerSecond(tokenCount, durationMs) {
-  if (typeof tokenCount !== 'number' || typeof durationMs !== 'number' || durationMs <= 0) {
+  if (typeof tokenCount !== 'number' && typeof durationMs !== 'number' || durationMs <= 0) {
     return 0;
   }
killedBy: Text Processing Utilities calculateTokensPerSecond should handle invalid input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: "NaN"

[Killed] EqualityOperator
src/utils/text-processing.js:98:75
 }
 
 export function calculateTokensPerSecond(tokenCount, durationMs) {
-  if (typeof tokenCount !== 'number' || typeof durationMs !== 'number' || durationMs <= 0) {
+  if (typeof tokenCount !== 'number' || typeof durationMs !== 'number' || durationMs < 0) {
     return 0;
   }
killedBy: Text Processing Utilities calculateTokensPerSecond should handle invalid input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: "Infinity"

[Killed] ArithmeticOperator
src/utils/text-processing.js:102:11
     return 0;
   }
 
-  return (tokenCount / (durationMs / 1000)).toFixed(1);
+  return (tokenCount * (durationMs / 1000)).toFixed(1);
 }
 
killedBy: Text Processing Utilities calculateTokensPerSecond should calculate tokens per second
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "20.0"
Received: "500.0"

[Killed] ArithmeticOperator
src/utils/text-processing.js:102:25
     return 0;
   }
 
-  return (tokenCount / (durationMs / 1000)).toFixed(1);
+  return (tokenCount / (durationMs * 1000)).toFixed(1);
 }
 
killedBy: Text Processing Utilities calculateTokensPerSecond should calculate tokens per second
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "20.0"
Received: "0.0"
