[Killed] BlockStatement
src/components/person.js:3:28
 // person.js
 class Person {
-    constructor(name, age) {
-        if (typeof name !== 'string' || name.trim() === '') {
-            throw new Error("Invalid name");
-        }
-        if (typeof age !== 'number' || age < 0) {
-            throw new Error("Invalid age");
-        }
-        this.name = name.trim();
-        this.age = age;
-    }
+    constructor(name, age) {}
 
     getGreeting() {
killedBy: Person Component Tests Property-Based Tests should always include the name and age in the greeting
statusReason: Error: Property failed after 1 tests
{ seed: -1827507128, path: "0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["!",0]
Shrunk 7 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/components/person.js:4:13
 // person.js
 class Person {
     constructor(name, age) {
-        if (typeof name !== 'string' || name.trim() === '') {
+        if (false) {
             throw new Error("Invalid name");
         }
killedBy: Person should throw error for invalid name
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid name"

Received function did not throw

[Killed] ConditionalExpression
src/components/person.js:4:13
 // person.js
 class Person {
     constructor(name, age) {
-        if (typeof name !== 'string' || name.trim() === '') {
+        if (false || name.trim() === '') {
             throw new Error("Invalid name");
         }
killedBy: Person should throw error for invalid name
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid name"
Received message:   "Cannot read properties of null (reading 'trim')"

      53 |     } else {
      54 |       stryCov_9fa48("0");

[Killed] EqualityOperator
src/components/person.js:7:40
         if (typeof name !== 'string' || name.trim() === '') {
             throw new Error("Invalid name");
         }
-        if (typeof age !== 'number' || age < 0) {
+        if (typeof age !== 'number' || age <= 0) {
             throw new Error("Invalid age");
         }
killedBy: Person Component Tests Property-Based Tests should always include the name and age in the greeting
statusReason: Error: Property failed after 11 tests
{ seed: -610266390, path: "10:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["!",0]
Shrunk 8 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/components/person.js:7:49
         if (typeof name !== 'string' || name.trim() === '') {
             throw new Error("Invalid name");
         }
-        if (typeof age !== 'number' || age < 0) {
-            throw new Error("Invalid age");
-        }
+        if (typeof age !== 'number' || age < 0) {}
         this.name = name.trim();
         this.age = age;
killedBy: Person should throw error for invalid age
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid age"

Received function did not throw

[Killed] StringLiteral
src/components/person.js:8:29
             throw new Error("Invalid name");
         }
         if (typeof age !== 'number' || age < 0) {
-            throw new Error("Invalid age");
+            throw new Error("");
         }
         this.name = name.trim();
killedBy: Person should throw error for invalid age
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid age"
Received message:   ""

      66 |         } else {
      67 |           stryCov_9fa48("22");
    > 68 |           throw new Error(stryMutAct_9fa48("23") ? "" : (stryCov_9fa48("23"), "Invalid age"));

[Killed] MethodExpression
src/components/person.js:10:21
         if (typeof age !== 'number' || age < 0) {
             throw new Error("Invalid age");
         }
-        this.name = name.trim();
+        this.name = name;
         this.age = age;
     }
killedBy: Person Component Tests Fuzzing and Edge Case Tests should trim whitespace from names
statusReason: Error: Property failed after 1 tests
{ seed: 1785002704, path: "0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["!",0]
Shrunk 9 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/components/person.js:14:19
         this.age = age;
     }
 
-    getGreeting() {
-        return `Hello, my name is ${this.name} and I am ${this.age} years old.`;
-    }
+    getGreeting() {}
 
     getAgeInMonths() {
killedBy: Person Component Tests Property-Based Tests should always include the name and age in the greeting
statusReason: Error: Property failed after 1 tests
{ seed: 48233597, path: "0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["!",0]
Shrunk 9 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/components/person.js:18:22
         return `Hello, my name is ${this.name} and I am ${this.age} years old.`;
     }
 
-    getAgeInMonths() {
-        return this.age * 12;
-    }
+    getAgeInMonths() {}
 
     canVote() {
killedBy: Person Component Tests Metamorphic Tests should increase age in months by 12 when age in years increases by 1
statusReason: Error: Property failed after 1 tests
{ seed: 1823885432, path: "0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"name":"!","age":0}]
Shrunk 9 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
src/components/person.js:19:16
     }
 
     getAgeInMonths() {
-        return this.age * 12;
+        return this.age / 12;
     }
 
killedBy: Person Component Tests Metamorphic Tests should increase age in months by 12 when age in years increases by 1
statusReason: Error: Property failed after 1 tests
{ seed: -1524398747, path: "0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"name":"!","age":0}]
Shrunk 10 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/components/person.js:22:15
         return this.age * 12;
     }
 
-    canVote() {
-        return this.age >= 18;
-    }
+    canVote() {}
 
     introduce() {
killedBy: Person Component Tests Property-Based Tests should correctly determine voting eligibility based on age
statusReason: Error: Property failed after 1 tests
{ seed: 891534552, path: "0", endOnFailure: true }
Counterexample: [0]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/components/person.js:23:16
     }
 
     canVote() {
-        return this.age >= 18;
+        return this.age > 18;
     }
 
killedBy: Person Component Tests Fuzzing and Edge Case Tests should handle voting age boundaries correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/components/person.js:23:16
     }
 
     canVote() {
-        return this.age >= 18;
+        return true;
     }
 
killedBy: Person Component Tests Property-Based Tests should correctly determine voting eligibility based on age
statusReason: Error: Property failed after 8 tests
{ seed: 1703391203, path: "7:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/components/person.js:26:17
         return this.age >= 18;
     }
 
-    introduce() {
-        return `Hi, I'm ${this.name} and I'm ${this.age} years old.`;
-    }
+    introduce() {}
 
     getBirthYear() {
killedBy: Person introduce method should return an introduction message
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hi, I'm Test Person and I'm 30 years old."
Received: undefined

[Killed] StringLiteral
src/components/person.js:27:16
     }
 
     introduce() {
-        return `Hi, I'm ${this.name} and I'm ${this.age} years old.`;
+        return ``;
     }
 
killedBy: Person introduce method should return an introduction message
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hi, I'm Test Person and I'm 30 years old."
Received: ""

[Killed] BlockStatement
src/components/person.js:30:20
         return `Hi, I'm ${this.name} and I'm ${this.age} years old.`;
     }
 
-    getBirthYear() {
-        const currentYear = new Date().getFullYear();
-        return currentYear - this.age;
-    }
+    getBirthYear() {}
 
     static fromJSON(json) {
killedBy: Person getBirthYear method should return the correct birth year
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1995
Received: undefined

[Killed] ArithmeticOperator
src/components/person.js:32:16
 
     getBirthYear() {
         const currentYear = new Date().getFullYear();
-        return currentYear - this.age;
+        return currentYear + this.age;
     }
 
killedBy: Person getBirthYear method should return the correct birth year
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1995
Received: 2055

[Killed] BlockStatement
src/components/person.js:35:27
         return currentYear - this.age;
     }
 
-    static fromJSON(json) {
-        const data = JSON.parse(json);
-        return new Person(data.name, data.age);
-    }
+    static fromJSON(json) {}
 }
 
killedBy: Person Component Tests Fuzzing and Edge Case Tests should correctly serialize to and deserialize from JSON
statusReason: Error: Property failed after 1 tests
{ seed: 1471926501, path: "0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"name":"!","age":0}]
Shrunk 10 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
