[Killed] BlockStatement
src/utils/utils.js:5:31
     return a + b;
 }
 
-function tellBirthday(person) {
-    return `${person.introduce()} I was born in ${person.getBirthYear()}.`;
-}
+function tellBirthday(person) {}
 
 module.exports = { add, tellBirthday };
killedBy: Utils tellBirthday should return a descriptive string using person methods
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] StringLiteral
src/utils/utils.js:6:12
 }
 
 function tellBirthday(person) {
-    return `${person.introduce()} I was born in ${person.getBirthYear()}.`;
+    return ``;
 }
 
killedBy: Utils tellBirthday should return a descriptive string using person methods
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0
