[NoCoverage] BlockStatement
src/tts.js:5:17
 const FALLBACK_TO_WEB_SPEECH = true;
 
 export class TTSModule {
-  constructor() {
-    this.kokoroModel = null;
-    this.useWebSpeech = false;
-    this.isLoading = false;
-    this.currentUtterance = null;
-    this.sentences = [];
-    this.currentSentenceIndex = 0;
-    this.isPaused = false;
-    this.isStopped = false;
-    
-    // Settings
-    this.rate = 1.0;
-    this.pitch = 1.0;
-    this.selectedVoice = null;
-    
-    this.initializeWebSpeech();
-  }
+  constructor() {}
 
   initializeWebSpeech() {

[NoCoverage] BlockStatement
src/tts.js:23:25
     this.initializeWebSpeech();
   }
 
-  initializeWebSpeech() {
-    if ('speechSynthesis' in window) {
-      // Load voices
-      this.loadVoices();
-      
-      // Handle voice changes
-      speechSynthesis.addEventListener('voiceschanged', () => {
-        this.loadVoices();
-      });
-    }
-  }
+  initializeWebSpeech() {}
 
   loadVoices() {

[NoCoverage] ConditionalExpression
src/tts.js:24:9
   }
 
   initializeWebSpeech() {
-    if ('speechSynthesis' in window) {
+    if (true) {
       // Load voices
       this.loadVoices();

[NoCoverage] BlockStatement
src/tts.js:24:38
   }
 
   initializeWebSpeech() {
-    if ('speechSynthesis' in window) {
-      // Load voices
-      this.loadVoices();
-      
-      // Handle voice changes
-      speechSynthesis.addEventListener('voiceschanged', () => {
-        this.loadVoices();
-      });
-    }
+    if ('speechSynthesis' in window) {}
   }
 

[NoCoverage] BlockStatement
src/tts.js:35:16
     }
   }
 
-  loadVoices() {
-    const voices = speechSynthesis.getVoices();
-    const voiceSelect = document.getElementById('tts-voice');
-    
-    if (voiceSelect && voices.length > 0) {
-      voiceSelect.innerHTML = '';
-      
-      voices.forEach((voice, index) => {
-        const option = document.createElement('option');
-        option.value = index;
-        option.textContent = `${voice.name} (${voice.lang})`;
-        if (voice.default) {
-          option.selected = true;
-          this.selectedVoice = voice;
-        }
-        voiceSelect.appendChild(option);
-      });
-      
-      if (!this.selectedVoice && voices.length > 0) {
-        this.selectedVoice = voices[0];
-      }
-    }
-  }
+  loadVoices() {}
 
   async initializeKokoro(onProgress) {

[NoCoverage] EqualityOperator
src/tts.js:39:24
     const voices = speechSynthesis.getVoices();
     const voiceSelect = document.getElementById('tts-voice');
     
-    if (voiceSelect && voices.length > 0) {
+    if (voiceSelect && voices.length >= 0) {
       voiceSelect.innerHTML = '';
       

[NoCoverage] BlockStatement
src/tts.js:42:40
     if (voiceSelect && voices.length > 0) {
       voiceSelect.innerHTML = '';
       
-      voices.forEach((voice, index) => {
-        const option = document.createElement('option');
-        option.value = index;
-        option.textContent = `${voice.name} (${voice.lang})`;
-        if (voice.default) {
-          option.selected = true;
-          this.selectedVoice = voice;
-        }
-        voiceSelect.appendChild(option);
-      });
+      voices.forEach((voice, index) => {});
       
       if (!this.selectedVoice && voices.length > 0) {

[NoCoverage] StringLiteral
src/tts.js:45:30
       voices.forEach((voice, index) => {
         const option = document.createElement('option');
         option.value = index;
-        option.textContent = `${voice.name} (${voice.lang})`;
+        option.textContent = ``;
         if (voice.default) {
           option.selected = true;

[NoCoverage] BlockStatement
src/tts.js:46:28
         const option = document.createElement('option');
         option.value = index;
         option.textContent = `${voice.name} (${voice.lang})`;
-        if (voice.default) {
-          option.selected = true;
-          this.selectedVoice = voice;
-        }
+        if (voice.default) {}
         voiceSelect.appendChild(option);
       });

[NoCoverage] EqualityOperator
src/tts.js:53:34
         voiceSelect.appendChild(option);
       });
       
-      if (!this.selectedVoice && voices.length > 0) {
+      if (!this.selectedVoice && voices.length >= 0) {
         this.selectedVoice = voices[0];
       }

[NoCoverage] EqualityOperator
src/tts.js:53:34
         voiceSelect.appendChild(option);
       });
       
-      if (!this.selectedVoice && voices.length > 0) {
+      if (!this.selectedVoice && voices.length <= 0) {
         this.selectedVoice = voices[0];
       }

[NoCoverage] ConditionalExpression
src/tts.js:62:14
   async initializeKokoro(onProgress) {
     if (this.kokoroModel) return this.kokoroModel;
     if (this.isLoading) {
-      while (this.isLoading) {
+      while (false) {
         await new Promise(resolve => setTimeout(resolve, 100));
       }

[NoCoverage] BlockStatement
src/tts.js:62:30
   async initializeKokoro(onProgress) {
     if (this.kokoroModel) return this.kokoroModel;
     if (this.isLoading) {
-      while (this.isLoading) {
-        await new Promise(resolve => setTimeout(resolve, 100));
-      }
+      while (this.isLoading) {}
       return this.kokoroModel;
     }

[NoCoverage] BlockStatement
src/tts.js:70:9
 
     this.isLoading = true;
 
-    try {
-      onProgress?.({ percentage: 0, text: 'Loading Kokoro TTS model...' });
-      
-      // Simulate model loading for demonstration
-      await this._simulateModelLoad(onProgress);
-
-      // For now, we'll fall back to Web Speech API
-      throw new Error('Kokoro model not available in this demo');
-    } catch (error) {
+    try {} catch (error) {
       console.warn('Kokoro TTS not available, falling back to Web Speech API:', error);
 

[NoCoverage] OptionalChaining
src/tts.js:71:7
     this.isLoading = true;
 
     try {
-      onProgress?.({ percentage: 0, text: 'Loading Kokoro TTS model...' });
+      onProgress({
+  percentage: 0,
+  text: 'Loading Kokoro TTS model...'
+});
       
       // Simulate model loading for demonstration

[NoCoverage] BlockStatement
src/tts.js:78:21
 
       // For now, we'll fall back to Web Speech API
       throw new Error('Kokoro model not available in this demo');
-    } catch (error) {
-      console.warn('Kokoro TTS not available, falling back to Web Speech API:', error);
-
-      if (FALLBACK_TO_WEB_SPEECH && 'speechSynthesis' in window) {
-        this.useWebSpeech = true;
-        onProgress?.({ percentage: 100, text: 'Using Web Speech API' });
-        return 'web-speech';
-      } else {
-        throw new Error('No TTS system available');
-      }
-    } finally {
+    } catch (error) {} finally {
       this.isLoading = false;
     }

[NoCoverage] StringLiteral
src/tts.js:79:20
       // For now, we'll fall back to Web Speech API
       throw new Error('Kokoro model not available in this demo');
     } catch (error) {
-      console.warn('Kokoro TTS not available, falling back to Web Speech API:', error);
+      console.warn("", error);
 
       if (FALLBACK_TO_WEB_SPEECH && 'speechSynthesis' in window) {

[NoCoverage] LogicalOperator
src/tts.js:81:11
     } catch (error) {
       console.warn('Kokoro TTS not available, falling back to Web Speech API:', error);
 
-      if (FALLBACK_TO_WEB_SPEECH && 'speechSynthesis' in window) {
+      if (FALLBACK_TO_WEB_SPEECH || 'speechSynthesis' in window) {
         this.useWebSpeech = true;
         onProgress?.({ percentage: 100, text: 'Using Web Speech API' });

[NoCoverage] StringLiteral
src/tts.js:84:16
       if (FALLBACK_TO_WEB_SPEECH && 'speechSynthesis' in window) {
         this.useWebSpeech = true;
         onProgress?.({ percentage: 100, text: 'Using Web Speech API' });
-        return 'web-speech';
+        return "";
       } else {
         throw new Error('No TTS system available');

[NoCoverage] BlockStatement
src/tts.js:88:15
       } else {
         throw new Error('No TTS system available');
       }
-    } finally {
-      this.isLoading = false;
-    }
+    } finally {}
   }
 

[NoCoverage] EqualityOperator
src/tts.js:94:21
   }
 
   async _simulateModelLoad(onProgress) {
-    for (let i = 0; i <= 100; i += 10) {
+    for (let i = 0; i > 100; i += 10) {
       onProgress?.({ percentage: i, text: `Loading Kokoro model: ${i}%` });
       await new Promise(resolve => setTimeout(resolve, 100));

[NoCoverage] BlockStatement
src/tts.js:94:40
   }
 
   async _simulateModelLoad(onProgress) {
-    for (let i = 0; i <= 100; i += 10) {
-      onProgress?.({ percentage: i, text: `Loading Kokoro model: ${i}%` });
-      await new Promise(resolve => setTimeout(resolve, 100));
-    }
+    for (let i = 0; i <= 100; i += 10) {}
   }
 

[NoCoverage] ConditionalExpression
src/tts.js:105:20
     return text
       .split(/[.!?]+/)
       .map(s => s.trim())
-      .filter(s => s.length > 0)
+      .filter(s => false)
       .map(s => s + '.');
   }

[NoCoverage] StringLiteral
src/tts.js:106:21
       .split(/[.!?]+/)
       .map(s => s.trim())
       .filter(s => s.length > 0)
-      .map(s => s + '.');
+      .map(s => s + "");
   }
 

[NoCoverage] BlockStatement
src/tts.js:112:9
   async speak(text, options = {}) {
     const { outputElement, onProgress } = options;
 
-    try {
-      // Initialize TTS system
-      await this.initializeKokoro(onProgress);
-      
-      // Split text into sentences
-      this.sentences = this.splitIntoSentences(text);
-      this.currentSentenceIndex = 0;
-      this.isStopped = false;
-      this.isPaused = false;
-
-      // Display sentences in output element
-      if (outputElement) {
-        this.displaySentences(outputElement);
-      }
-
-      if (this.useWebSpeech) {
-        await this.speakWithWebSpeech(outputElement);
-      } else {
-        await this.speakWithKokoro();
-      }
-
-    } catch (error) {
+    try {} catch (error) {
       console.error('TTS failed:', error);
       throw error;

[NoCoverage] BlockStatement
src/tts.js:123:26
       this.isPaused = false;
 
       // Display sentences in output element
-      if (outputElement) {
-        this.displaySentences(outputElement);
-      }
+      if (outputElement) {}
 
       if (this.useWebSpeech) {

[NoCoverage] ConditionalExpression
src/tts.js:127:11
         this.displaySentences(outputElement);
       }
 
-      if (this.useWebSpeech) {
+      if (true) {
         await this.speakWithWebSpeech(outputElement);
       } else {

[NoCoverage] BlockStatement
src/tts.js:129:14
 
       if (this.useWebSpeech) {
         await this.speakWithWebSpeech(outputElement);
-      } else {
-        await this.speakWithKokoro();
-      }
+      } else {}
 
     } catch (error) {

[NoCoverage] StringLiteral
src/tts.js:134:21
       }
 
     } catch (error) {
-      console.error('TTS failed:', error);
+      console.error("", error);
       throw error;
     }

[NoCoverage] EqualityOperator
src/tts.js:156:13
       let currentIndex = 0;
 
       const speakNext = () => {
-        if (currentIndex >= this.sentences.length || this.isStopped) {
+        if (currentIndex > this.sentences.length || this.isStopped) {
           resolve();
           return;

[NoCoverage] EqualityOperator
src/tts.js:156:13
       let currentIndex = 0;
 
       const speakNext = () => {
-        if (currentIndex >= this.sentences.length || this.isStopped) {
+        if (currentIndex < this.sentences.length || this.isStopped) {
           resolve();
           return;

[NoCoverage] ConditionalExpression
src/tts.js:172:13
         this.currentUtterance = utterance;
 
         // Configure utterance
-        if (this.selectedVoice) {
+        if (false) {
           utterance.voice = this.selectedVoice;
         }

[NoCoverage] ConditionalExpression
src/tts.js:179:15
         utterance.pitch = this.pitch;
 
         utterance.onstart = () => {
-          if (outputElement) {
+          if (true) {
             this.markSentenceSpoken(currentIndex);
           }

[NoCoverage] BlockStatement
src/tts.js:184:33
           }
         };
 
-        utterance.onend = () => {
-          currentIndex++;
-          setTimeout(speakNext, 100); // Small delay between sentences
-        };
+        utterance.onend = () => {};
 
         utterance.onerror = (event) => {

[NoCoverage] UpdateOperator
src/tts.js:185:11
         };
 
         utterance.onend = () => {
-          currentIndex++;
+          currentIndex--;
           setTimeout(speakNext, 100); // Small delay between sentences
         };

[NoCoverage] BlockStatement
src/tts.js:189:40
           setTimeout(speakNext, 100); // Small delay between sentences
         };
 
-        utterance.onerror = (event) => {
-          console.error('Speech synthesis error:', event);
-          reject(new Error('Speech synthesis failed'));
-        };
+        utterance.onerror = (event) => {};
 
         speechSynthesis.speak(utterance);

[NoCoverage] StringLiteral
src/tts.js:190:25
         };
 
         utterance.onerror = (event) => {
-          console.error('Speech synthesis error:', event);
+          console.error("", event);
           reject(new Error('Speech synthesis failed'));
         };

[NoCoverage] BlockStatement
src/tts.js:201:27
     });
   }
 
-  async speakWithKokoro() {
-    // Placeholder for Kokoro implementation
-    // In a real implementation, this would:
-    // 1. Load the Kokoro ONNX model
-    // 2. Generate audio for each sentence
-    // 3. Stream audio to the AudioWorklet
-    // 4. Mark sentences as spoken based on audio playback progress
-    
-    throw new Error('Kokoro TTS not implemented in this demo');
-  }
+  async speakWithKokoro() {}
 
   markSentenceSpoken(index) {

[NoCoverage] BlockStatement
src/tts.js:212:29
     throw new Error('Kokoro TTS not implemented in this demo');
   }
 
-  markSentenceSpoken(index) {
-    const sentenceEl = document.getElementById(`sentence-${index}`);
-    if (sentenceEl) {
-      // Remove previous highlights
-      document.querySelectorAll('.sentence.spoken').forEach(el => {
-        el.classList.remove('spoken');
-      });
-      
-      // Highlight current sentence
-      sentenceEl.classList.add('spoken');
-    }
-    
-    this.currentSentenceIndex = index;
-  }
+  markSentenceSpoken(index) {}
 
   pause() {

[NoCoverage] StringLiteral
src/tts.js:213:48
   }
 
   markSentenceSpoken(index) {
-    const sentenceEl = document.getElementById(`sentence-${index}`);
+    const sentenceEl = document.getElementById(``);
     if (sentenceEl) {
       // Remove previous highlights

[NoCoverage] ConditionalExpression
src/tts.js:214:9
 
   markSentenceSpoken(index) {
     const sentenceEl = document.getElementById(`sentence-${index}`);
-    if (sentenceEl) {
+    if (false) {
       // Remove previous highlights
       document.querySelectorAll('.sentence.spoken').forEach(el => {

[NoCoverage] ConditionalExpression
src/tts.js:214:9
 
   markSentenceSpoken(index) {
     const sentenceEl = document.getElementById(`sentence-${index}`);
-    if (sentenceEl) {
+    if (true) {
       // Remove previous highlights
       document.querySelectorAll('.sentence.spoken').forEach(el => {

[NoCoverage] BlockStatement
src/tts.js:216:67
     const sentenceEl = document.getElementById(`sentence-${index}`);
     if (sentenceEl) {
       // Remove previous highlights
-      document.querySelectorAll('.sentence.spoken').forEach(el => {
-        el.classList.remove('spoken');
-      });
+      document.querySelectorAll('.sentence.spoken').forEach(el => {});
       
       // Highlight current sentence

[NoCoverage] StringLiteral
src/tts.js:217:29
     if (sentenceEl) {
       // Remove previous highlights
       document.querySelectorAll('.sentence.spoken').forEach(el => {
-        el.classList.remove('spoken');
+        el.classList.remove("");
       });
       

[NoCoverage] ConditionalExpression
src/tts.js:228:9
   }
 
   pause() {
-    if (this.useWebSpeech) {
+    if (true) {
       speechSynthesis.pause();
     }

[NoCoverage] BlockStatement
src/tts.js:241:10
     this.isPaused = false;
   }
 
-  stop() {
-    this.isStopped = true;
-    this.isPaused = false;
-    
-    if (this.useWebSpeech) {
-      speechSynthesis.cancel();
-    }
-    
-    // Clear highlights
-    document.querySelectorAll('.sentence.spoken').forEach(el => {
-      el.classList.remove('spoken');
-    });
-    
-    this.currentSentenceIndex = 0;
-  }
+  stop() {}
 
   setRate(rate) {

[NoCoverage] BlockStatement
src/tts.js:250:65
     }
     
     // Clear highlights
-    document.querySelectorAll('.sentence.spoken').forEach(el => {
-      el.classList.remove('spoken');
-    });
+    document.querySelectorAll('.sentence.spoken').forEach(el => {});
     
     this.currentSentenceIndex = 0;

[NoCoverage] BlockStatement
src/tts.js:284:22
     return this.kokoroModel !== null;
   }
 
-  getCurrentSystem() {
-    if (this.kokoroModel) return 'kokoro';
-    if (this.useWebSpeech) return 'web-speech';
-    return 'none';
-  }
+  getCurrentSystem() {}
 }
 

[NoCoverage] ConditionalExpression
src/tts.js:285:9
   }
 
   getCurrentSystem() {
-    if (this.kokoroModel) return 'kokoro';
+    if (true) return 'kokoro';
     if (this.useWebSpeech) return 'web-speech';
     return 'none';

[NoCoverage] ConditionalExpression
src/tts.js:285:9
   }
 
   getCurrentSystem() {
-    if (this.kokoroModel) return 'kokoro';
+    if (false) return 'kokoro';
     if (this.useWebSpeech) return 'web-speech';
     return 'none';

[NoCoverage] ConditionalExpression
src/tts.js:286:9
 
   getCurrentSystem() {
     if (this.kokoroModel) return 'kokoro';
-    if (this.useWebSpeech) return 'web-speech';
+    if (false) return 'web-speech';
     return 'none';
   }

[NoCoverage] ConditionalExpression
src/tts.js:286:9
 
   getCurrentSystem() {
     if (this.kokoroModel) return 'kokoro';
-    if (this.useWebSpeech) return 'web-speech';
+    if (true) return 'web-speech';
     return 'none';
   }
